{
  "text": "Draft version February 25, 2025\nTypeset using LATEX default style in AASTeX62\nHigh Energy Jet Emission from GRS 1758−258 & 1E 1740.7−2942 with INTEGRAL?\nJames Rodi,1 Angela Bazzano,1 and Pietro Ubertini1\n1INAF - Istituto di Astrofisica e Planetologia Spaziali; via Fosso del Cavaliere 100; 00133 Roma, Italy\n(Received; Revised; Accepted)\nSubmitted to ApJ\nABSTRACT\nGRS 1758−258 and 1E 1740.7−2942 are two long-known persistent black hole binaries in the Galactic\nCenter region. Using INTEGRAL’s extensive monitoring of the Galactic Center and Bulge, we studied\ntheir temporal and spectral evolutions in the 30−610 keV energy range from March 2003 through April\n2022 with the IBIS/ISGRI gamma-ray telescope. Our analyses found that the sources typically had\nComptonized spectra, though not always with the same parameters. The spectral states with more\nthan 8 Ms of observation time show deviations from a Comptonized spectrum above ∼200 keV or a\n“hard tail” that extends up to at least 600 keV. The origin of this component remains debated with\nthe most popular scenarios being synchrotron emission from the jet or Comptonization in a hybrid\nthermal/non-thermal plasma. Anyway, the GRS 1758−258 and 1E 1740.7−2942 spectra are acceptably\ndescribed by CompTT+po (jet) and Eqpair (hybrid Comptonization) scenarios. To differentiate between\nthe two scenarios, we calculated the Spearman correlation coefficient comparing 30−50 keV count rates\nwith those in higher energy bands (50−100, 100−300, and 300−600 keV). The count rates below 300\nkeV are strongly correlated, indicating those photons arise from the same physical process. Above 300\nkeV the count rates are either anti-correlated or not correlated with the 30−50 keV count rates for\nGRS 1758−258, which suggests that the photons originate from a different physical process. For 1E\n1740.7−2942, the level of correlation is unclear due to scatter in the data points. However, the 300−600\nkeV count rates are consistent with a constant value. This disfavors the hybrid Comptonization scenario\nfor both sources.\nKeywords: gamma rays: General — X-rays: individual (GRS 1758-258) — X-rays: individual (1E\n1740.7-2942)\n1. INTRODUCTION\n1E 1740.7−2942 (hereafter 1E) and GRS 1758−258 (GRS) are two of a handful of persistent, though variable, Black\nHole Binaries in the Galaxy. In particular these two sources belong to the Low Mass X-ray Binary (LMXB) class and\nspend most of their time in the so-called hard state and with thermally dominated soft state part of the time and\nintermediate states. They both are observed at various energy bands and considered micro-quasars because of their\nradio characteristics, i.e. radio jets (Rodriguez et al. 1992; Mirabel & Rodr´ıguez 1999) and double-lobed counterparts\n(Mart´ı et al. 2017). The sources are located in a crowded field close by to the Galactic Center at a distance of 8 ± 1\nkpc. For GRS it was estimated taking into account Jet-ISM interaction (Tetarenko et al. 2020).\nThe spectral and flux variability for 1E and GRS are similar and, being classified as LMXBs, accrete matter via\nRoche lobe overflow from the companion star. They are in general in the hard state and show few transitions into\nintermediate and dim states. For the hard state, spectra typically consist of a power law component with a photon\nindex around 1.6 and exponential cut-off <50−100 keV. The soft and intermediate state spectra are characterized by\na disk component and a power law with photon index > 2.\nSeveral previous works have reported on relatively short ISGRI observations of GRS or 1E. For example, Pottschmidt\net al. (2006) studied the hard to soft transition in 2003 and 2004 with RXTE/PCA and ISGRI while del Santo et al.\n(2005) investigated the spectral variability of 1E during the same period also with PCA and ISGRI. Later analyses\nof 1E by Castro et al. (2014) looked at spectral variability during brief periods in 2003, 2005, and 2012 with XMM-\narXiv:2502.16952v1  [astro-ph.HE]  24 Feb 2025\n\n2\nRodi et al.\nNewton, INTEGRAL/JEM-X, and ISGRI, and Natalucci et al. (2014) investigated the spectral and timing properties\nof 1E in the hard state with ISGRI and NuSTAR observations from 2012. Hereafter we report about the long-term\ncharacteristics of the two sources with high energy broad band results from ISGRI.\n2. INSTRUMENTS AND OBSERVATIONS\nIn October 2002 the INTErnational Gamma-Ray Astrophysics Laboratory (INTEGRAL) satellite was launched from\nBaikonur, Kazachstan (Jensen et al. 2003). The satellite is outside Earth’s radiation belts for ∼85% of the 2.5−3 day\norbit. We utilized the IBIS/ISGRI (Imager on Board INTEGRAL/INTEGRAL Soft Gamma-Ray Imager (Ubertini et\nal. 2003; Lebrun et al. 2003)) data in the 30−900 keV energy range.\nGRS and 1E have been frequently monitored throughout the INTEGRAL mission with observations during Galactic\nCenter and Bulge programs. The observations used in the subsequent analyses of GRS are within 10◦of the spacecraft\npointing direction during revolutions 46−2495 (MJD 52699−59693, 2003-03-01 to 2022-04-25 UTC). The same angular\nand temporal constraints were applied in selecting observations of 1E. This results in 18 422 pointings, or science\nwindows (scw), for GRS and 18 457 scws for 1E resulting in 26.00 Ms of total exposure time for GRS and 24.65 Ms\nof exposure time for 1E.\nData reduction was performed using the standard INTEGRAL Offline Science Analysis (OSA) software version 11.2.\nThe light curve analysis was performed in 5 energy bins from 30−900 keV while the spectral analysis used 62 energy\nbins in the same energy range. A systematic error of 1.5% was added to the spectral fitting.\n3. RESULTS\n3.1. Temporal Variability\n3.1.1. GRS 1758−258\nAs discussed above, GRS is a persistent source at hard X-rays/soft gamma-rays. Figure 1 shows the ISGRI light\ncurves on a revolution timescale (∼2.5 −3 d) in the 30−50, 50−100, 100−300, and 300−600 keV energy bands. The\naverage count rate is overplotted as a red dashed line, and a black solid line is overplotted at a count rate of 0 ct/s.\nThe source was significantly detected in the first four energy bands at 1081.8σ, 770.6σ, 191.3σ, and 5.1σ. There was\nno detection in the highest energy band (1.1σ). The coloring for the different revolutions is based on the spectral state\nanalysis performed in Sec. 3.2.1.\n3.1.2. 1E 1740.7−2942\n1E is also a persistent source at hard X-ray/soft gamma-rays, though it displays larger flux variability between\nobserving periods with numerous times where the source count rate is marginally detected, or below the ISGRI\ndetection limit. The ISGRI revolution timescale light curves are shown in Figure 2. As in the case of GRS, the 30−50,\n50−100, 100−300, and 300−600 keV energy bands are plotted. 1E was significantly detected in the first four energy\nbands at 710.3σ, 467.3σ, 108.0σ, and 6.6σ, respectively, but it is not detected in the last energy channel (1.7σ). The\ncoloring for the different revolutions is based on the spectral state analysis performed in Sec. 3.2.2.\n3.2. Spectral Variability\n3.2.1. GRS 1758−258\nTo search for spectral variability, initially data were fit to a power-law model in the 30−90 keV energy range on a\nrevolution timescale. However, the photon indexes were poorly constrained. Thus spectra from revolutions close in\ncount rate and close in time were averaged to maximize statistics when fitting. The average photon indexes and the\nnormalizations at 50 keV are plotted in Figure 3a.\nThough the normalization varies by a factor of roughly 7 (excluding the very low count rate periods), the photon\nindex does not show any clear correlation. For spectra with Γ < 1.8, the photon index is roughly constant at Γ = 1.7\nfor normalizations from ∼8 × 10−5 −2.8 × 10−4 ph/cm2/s. These spectral parameters are shown as blue asterisks\nin Figure 3a. At a normalization of approximately 3×10−4 ph/cm2/s, the photon indices have a value of roughly\n1.75 −1.8, which are plotted as red circles. These two spectral groupings are subsequently referred to as the “hard\nmedium” and “hard high” states.\nThe vertical dashed line at Γ = 1.8 separates the “hard” and “soft” states. In contrast to the hard states, the soft\nstates show a clearer relationship between photon index and normalization with Γ decreasing as the normalization\nincreases. The soft spectra were grouped into four normalization levels: below 1×10−4 ph/cm2/s (soft low, plotted as\n\nGRS 1758 & 1E 1740 with INTEGRAL\n3\nFigure 1. ISGRI long-term light curves of GRS in the 30−50, 50−100, 100−300, and 300−600 keV energy bands. Black\nsolid line denotes 0 ct/s. The different colors in the 30−50 keV light curve correspond to different spectral states discussed in\nSec. 3.2.1.\nblack diamonds), 1×10−4 to 1.45×10−4 ph/cm2/s (soft medium 1, plotted as green triangles), 1.45×10−4 to 2.05×10−4\nph/cm2/s (soft medium 2, plotted as magenta squares), and greater than 2.05 ×10−4 ph/cm2/s (soft high, plotted as\ncyan plus signs).\nThe spectra within each spectral grouping were averaged together for six spectra. First, the spectra were fitted to a\npower law in the 30−150 keV energy range. The fit parameters for each spectrum are listed in Table 1. Only the soft\nlow spectrum was acceptably described by a power law, which has a best-fit photon index of 2.06±0.03. The residuals\nfor the other spectra suggest the presence of a high-energy cutoff. Thus we fitted them using a cutoff power-law model\n(cutoffpl), and each spectrum is well described, though with significantly different Γ and cutoff energy (Ecut) values.\nThe soft medium 1, soft medium 2, and soft high spectra have decreasing photon indices from Γ ∼1.7 to 1.4 and\ndecreasing Ecut from ∼240 keV to 110 keV. The hard medium and hard high spectra show comparable photon indices\n\n4\nRodi et al.\nFigure 2. ISGRI long-term light curve of 1E in the 30−50, 50−100, 100−300, and 300−600 keV energy bands. Black solid line\ndenotes 0 ct/s. The different colors in the 30−50 keV light curve correspond to different spectral states discussed in Sec. 3.2.2.\n(1.25 ± 0.03 and 1.36 ± 0.09, respectively) and cutoff energies (137 ± 8 keV and 120 ± 16 keV, respectively). However,\nthe parameters are not an acceptable for the hard medium spectrum (χ2/ν = 51.80/26 = 1.99).\nSubsequently, we fitted all the non-low state spectra to the thermal Comptonization model CompTT assuming a disk\naccretion geometry. For each, the photon seed temperature (kT0) was fixed to 0.5 keV. As with the cutoff power-law\nmodel, the electron temperature (kTe) decreases as flux increases from ∼70 keV for the soft medium 1 spectrum to\n34 keV for the soft high spectrum, though medium 1 spectrum is poorly constrained (±68 keV). On the other hand,\nthe optical depth (τ) increases as flux increases, going from 0.7 to 1.5. The hard spectra have similar kTe values (38.8\nand 35, for the medium and high spectra, respectively), but they have significantly different τ values (1.73 and 1.6, for\nthe medium and high spectra, respectively). The average spectra with their CompTT model are plotted in Figure 4a.\nDue to the large amount of exposure time, and very stable instrumental background level, GRS is significantly\ndetected above 150 keV in the hard medium state. Thus we extended the spectral fits up to 610 keV. For the CompTT\n\nGRS 1758 & 1E 1740 with INTEGRAL\n5\n(a)\n(b)\nFigure 3. GRS and 1E photon index versus 50 keV normalization for average spectral groups in panels (a) and (b), respectively.\nFor GRS, the vertical dashed line at Γ = 1.8 marks the separation between the “hard” and “soft” groupings. For 1E, the low\nflux state corresponds to periods with normalization less than 4.5×10−5 ph/cm2/s . The medium flux state corresponds to\nnormalization between 4.5×10−5 and 1.45×10−4 ph/cm2/s. The high flux state corresponds to normalization between above\n1.45×10−4 ph/cm2/s.\nmodel kTe is 44.0 ± 0.8 keV, larger than the fit up to 150 keV, and τ decreases from 1.73 to 1.54 (χ2/ν = 61.90/36 =\n1.72). The fit parameters for this model and subsequent models are listed in Table 2. However, above ∼200 keV the\nresiduals are all above the model, suggesting the presence of a possible high-energy component. Therefore we added\na power-law model to fit the spectrum above 200 keV. The χ2/ν improved to 36.82/34 = 1.08 with kTe = 36 keV,\nτ =1.9, and Γ = 1.8. Thus a high-energy component is needed to acceptably fit the spectrum above 150 keV. To test\nthe significance of the power-law component, we performed an F-test and found an F-statistic of 17.62 and probability\nof 5.61 × 10−6 (∼4.5σ). The spectrum with the CompTT+powerlaw model is plotted in Figure 5 as black diamonds.\nThe medium and high spectra for 1E are also shown as red squares and blue triangles, respectively.\nSimilar high-energy excesses have been observed in other accreting black holes (e.g. GX 339−4 (Johnson et al.\n1993), Cyg X-1 (McConnell et al. 2000), GRS 1915+105 (Zdziarski et al. 2001)), which has largely been confirmed\nwith INTEGRAL. (See Motta et al. (2021)).\nThe origin of the emission is debated.\nPolarization results of the\nhigh-energy spectrum of Cyg X-1 from INTEGRAL (Laurent et al. 2011; Jourdain et al. 2012) suggest that the\nemission associated with the jet observed at radio wavelengths. However, the excess can also be explained by a hybrid\nthermal/non-thermal population of electrons in the corona (Coppi 1999). Thus we fit the spectrum to the Eqpair\nmodel. Following Gierli´nski et al. (1999), Del Santo et al. (2008), and Bassi et al. (2020), we left the lh/ls (the ratio\nof the hard to soft compactness), lnt/ln (the fraction of power going to the energetic particles that accelerates the\nnon-thermal particles), and τp (the Thomson scattering depth) parameters free while lbb (the soft photon compactness)\nwas fixed to 10 and Ginj (the index of the electron distribution) was fixed to 2.5. Additionally, kTbb (the temperature\n\n6\nRodi et al.\n(a)\n(b)\nFigure 4. GRS (a) and 1E(b) average state spectra in the 30−150 keV energy range with CompTT model fits overplotted for\neach spectrum, except for the low state spectra, which are shown with power-law models.\nof the inner edge of the accretion disk) was fixed to 0.5 keV, the ionization parameter of the reflector (ξ) and the\nreflection fraction were fixed to 0. The best-fit parameters are lh/ls = 6.7±0.1, lnt/lh = 0.58±0.07, and τp = 1.1±0.2\nwith χ2/ν = 30.05/35 = 0.86. Thus the model also well describes the data.\n3.2.2. 1E 1740.7−2942\nThe same search for spectral variability was performed for 1E. Figure 3b shows the photon index and normalization\nbehavior. In contrast to GRS, 1E exhibits a more straight forward relationship between the 50 keV flux and photon\nindex. Groupings with normalizations below 4.5×10−5 ph/cm2/s (low state, plotted as black diamonds) have Γ ∼\n2.2, though many of the photon indices are poorly constrained. For normalizations from 4.5×10−5 to 1.45×10−4\nph/cm2/s (medium state, plotted as red squares), groupings have an average Γ of roughly 1.9. Finally, the high state\n(> 1.45 × 10−4 ph/cm2/s, plotted as blue triangles) have an average photon index of approximately 1.75.\nAs with GRS, we averaged the spectral groupings together and fitted them with a power-law model. Again, the low\nflux state is consistent with a power law Γ = 2.21±0.07 while the medium and high flux state spectra are suggestive of a\nhigh-energy cutoff. The fit parameters for all the models are shown in Table 1. We fitted the medium and high spectra\nto a cutoff power-law model. The medium spectrum fit improves, but is still not acceptable (χ2/ν = 34.29/26 = 1.32)\nfor Γ = 1.59 ± 0.04 and Ecut = 168 ± 20 keV. Also, the χ2/ν for the high state is still unacceptable (35.52/26 = 1.37)\nwith Γ = 1.32 ± 0.03 and Ecut = 130 ± 8 keV.\nNext, we fitted both spectra to a CompTT model. In this case, the model describes the data well χ2/ν = 27.97/26 =\n1.04 for the medium state and 17.56/26 = 0.68 for the high state. The medium spectrum has a kTe of 44 keV and τ\nof 1.2 compared to kTe of 38 keV and τ of 1.61 for the high spectrum.\nThe medium and high flux spectra show significant emission above 150 keV. Thus we again investigated the presence\nof a high-energy tail by fitting the spectrum up to 610 keV. For the medium spectrum, the CompTT fit has an increased\n\nGRS 1758 & 1E 1740 with INTEGRAL\n7\nTable 1. Average Spectra Parameters\nGRS 1758−258\nPower-Law\nCutoff Power-Law\nCompTT\nExp. Time\nΓ\nχ2/ν\nΓ\nEcut\nχ2/ν\nkTe\nτ\nχ2/ν\n(Ms)\n( keV)\n(keV)\nSoft Low\n2.06 ± 0.03\n35.50/27 = 1.31\n−\n−\n−\n−\n−\n−\n1.04\nSoft Medium 1\n1.93 ± 0.01\n43.87/27 = 1.32\n1.69 ± 0.06\n242 ± 63\n28.14/26 = 1.08\n70 ± 68\n0.7 ± 0.8\n28.89/26 = 1.11\n1.44\nSoft Medium 2\n1.97 ± 0.01\n78.98/27 = 2.93\n1.52 ± 0.08\n139 ± 21\n28.68/26 = 1.10\n48 ± 8\n1.1 ± 0.2\n30.68/26 = 1.18\n0.97\nSoft High\n1.95 ± 0.02\n90.58/27 = 3.36\n1.42 ± 0.08\n110 ± 16\n35.18/27 = 1.35\n34 ± 3\n1.5 ± 0.1\n31.72/26 = 1.22\n0.45\nHard Medium\n1.739 ± 0.007\n359.14/27 = 13.19\n1.25 ± 0.03\n137 ± 8\n51.80/26 = 1.99\n38.8 ± 1.0\n1.73 ± 0.04\n21.49/26 = 0.83\n20.43\nHard High\n1.85 ± 0.01\n90.58/32 = 3.36\n1.36 ± 0.09\n120 ± 16\n25.38/26 = 0.98\n35 ± 2\n1.6 ± 0.1\n22.51/26 = 0.87\n0.35\n1E 1740.7−2942\nPower-Law\nCutoff Power-Law\nCompTT\nExp. Time\nΓ\nχ2/ν\nΓ\nEcut\nχ2/ν\nkTe\nτ\nχ2/ν\n( keV)\n(keV)\nLow\n2.21 ± 0.07\n33.33/27 = 1.23\n−\n−\n−\n−\n−\n−\n4.55\nMedium\n1.953 ± 0.009\n115.49/27 = 4.28\n1.59 ± 0.04\n168 ± 20\n34.29/26 = 1.32\n44 ± 4\n1.2 ± 0.1\n27.97/26 = 1.04\n10.62\nHigh\n1.829 ± 0.007\n304.72/27 = 11.29\n1.32 ± 0.03\n130 ± 8\n35.52/26 = 1.37\n38 ± 1\n1.61 ± 0.05\n17.56/26 = 0.68\n10.83\nkTe from 44 keV to 57 keV and a decreasing τ from 1.2 to 0.9. The χ2/ν is acceptable (1.25), but again the high-energy\nresiduals are all above the model and suggest the presence of an additional spectral component. The fit parameters\nare listed for this fit and subsequent fits in Table 2. Including a power-law at high energies with Γ = 1.3 reduces\nthe electron temperature (35 keV) and increases the optical depth (1.3) and reduces the χ2 to 33.37 for ν = 34\n(χ2/ν = 0.98). Results of an F-test found an F-statistic of 5.99 and probability of 0.0059 (∼2.8σ), and thus the\nadditional component is not significant.\nFigure 5. Average state spectra for GRS hard medium (black\ndiamonds) and 1E medium (red squares) and high (blue trian-\ngles) in the 30−610 keV energy range. The CompTT+powerlaw\nmodel is overplotted as a solid line for each while the CompTT\nmodel is overplotted as a dashed line.\nNonetheless, we fitted the spectrum with the\nEqpair model.\nThe fit parameters are lh/ls =\n3.8±0.2, lnt/lh = 0.84±0.08, and τp = 1.2±0.1 with\nχ2/ν = 30.35/35 = 0.87. The τp values are similar\nto GRS while the lnt/lh and lh/ls are significantly\ndifferent (3.8 compared to 6.7 and 0.58 compared to\n0.84, respectively).\nWe performed the same analysis for the high state.\nIn this case the CompTT model is a poor fit to the\nmodel (χ2/ν = 68.67/36 = 1.91) due to the excess\nat high energies.\nAdding a power-law component\nsignificantly improves the quality of the fit (χ2/ν =\n33.72/34 = 0.99) with kTe = 34 keV, τ = 1.7, and\nΓ = 1.5. An F-test analysis finds an F-statistic of\n17.62 and a probability of 5.61 × 10−6 (∼4.5σ).\nAn Eqpair model fit also acceptably fits the data\n(χ2/ν = 31.36/35 = 0.90) with lh/ls = 5.9 ± 0.2,\nlnt/lh = 0.87 ± 0.09, and τp = 1.1 ± 0.2. The τp val-\nues are comparable to GRS 1758, but lnt/lh is sig-\nnificantly higher. The lh/ls value of GRS is higher\nthan both those for 1E. As before, the medium and\nhigh spectra are also shown as red squares and blue\ntriangles, respectively, in Figure 5.\n4. DISCUSSION\n4.1. Comparison with Previous Works\n4.1.1. GRS 1758−258\n\n8\nRodi et al.\nTable 2. 30−610 keV Fit Spectral Parameters\nGRS 1758−258\nCompTT\nCompTT+po\nEqpair\nkTe\nτ\nχ2/ν\nkTe\nτ\nΓ\nχ2/ν\nlh/ls\nlnt/lh\nτp\nχ2/ν\n(keV)\n(keV)\nMedium\n44.0 ± 0.8\n1.54 ± 0.08\n61.90/36 = 1.72\n36 ± 3\n1.9 ± 0.3\n1.8 ± 0.2\n36.82/34 = 1.08\n6.7 ± 0.1\n0.58 ± 0.07\n1.1 ± 0.2\n30.05/35 = 0.86\n1E 1740.7−2942\nMedium\n57 ± 6\n0.9 ± 0.1\n45.13/36 = 1.25\n35 ± 6\n1.3 ± 0.2\n1.3 ± 1.0\n33.37/34 = 0.98\n3.8 ± 0.2\n0.84 ± 0.08\n1.2 ± 0.1\n30.35/35 = 0.87\nHigh\n43 ± 4\n1.44 ± 0.04\n68.67/36 = 1.91\n34 ± 4\n1.7 ± 0.3\n1.5 ± 0.8\n33.72/34 = 0.99\n5.9 ± 0.2\n0.87 ± 0.09\n1.1 ± 0.2\n31.36/35 = 0.90\nThere have been several works studying the long-term behavior of GRS up to roughly a couple hundred keV to\ncompare with our INTEGRAL observations. GRANAT/SIGMA monitored GRS (and 1E) in the 40−200 keV energy\nrange from 1990−1998. Kuznetsov et al. (1999) found cutoff spectral parameters of Γ = 1.0 ± 0.3 and Ecut = 89+40\n−20\nkeV and CompTT parameters of kTe = 41+7\n−5 keV and τ = 1.2 ± 0.2. These values are most similar to the 30−150\nkeV hard medium spectrum. Γ and kTe are comparable to the ISGRI values (Γ = 1.25 and kTe = 38.8 keV), but the\nEcut and τ values are significantly different (137 keV and 1.73), suggesting that the spectral curvature in the SIGMA\nspectrum is different from the ISGRI one.\nBeppoSAX observed GRS on 10−11 April, 1997 in the 0.1 −200 keV energy range. The continuum spectrum was\nwell described by an absorbed power law with a high-energy cutoff (powerlaw*highecut) with Γ = 1.65, Ecut = 73\nkeV, and Efold = 180 keV (Sidoli & Mereghetti 2002). We fitted our hard medium spectrum with the same model\nwithout the low-energy absorption in the 30−210 keV energy range and found comparable parameters (Γ = 1.60,\nEcut = 85 keV, and Efold = 185 keV). The authors also fit the spectrum to a CompTT model, but assuming a spherical\naccretion geometry. Thus we refitted the hard medium spectrum using the same assumption. Again the fit resulted\nin similar parameters (ISGRI: kTe = 42 keV, τ = 3.8 and BeppoSAX: kTe = 44 keV, τ = 3.6).\nPottschmidt et al. (2008) analyzed the INTEGRAL/SPI and IBIS data from early in the mission (2003−2007) and\nreported the presence of a hard tail above ∼300 keV. Their best fit CompTT+po model had kTe = 41 keV, τ = 1.4, and\nΓ = 1.4, though they found that it is possible to get an equally good fit with Γ = 2.0, comparable to the photon index\nthat we report (1.8). However, we tested our spectrum with Γ = 1.4, and the fit is comparable (38.56/35 = 1.10 vs\n36.82/34 = 1.08) with kTe = 38 keV and τ = 1.70.\n4.1.2. 1E 1740.7−2942\nAs mentioned in the previous section, SIGMA observed 1E from 1990−1998. Its average spectrum was well fit by\na cutoff spectrum with Γ = 1.2 ± 0.02 and Ecut = 110+26\n−23 keV (Kuznetsov et al. 1999), similar to the high state\nspectrum (Γ = 1.32, Ecut = 130 keV), though with a lower Γ. For the CompTT fit, the kTe values are not similar (44\nkeV for SIGMA and 35 keV for ISGRI) while the optical depths are (1.63 compared to 1.60 for SIGMA and ISGRI,\nrespectively). Thus it is unclear which spectral state the SIGMA observations correspond to compared to the ISGRI\nspectrum.\nBouchet et al. (2009) analyzed the ISGRI and INTEGRAL/SPI observations from 2003−2005 in the 18−600 keV\nenergy range. They found a significant excess above 200 keV. Thus their spectrum more closely matches our high state\nspectrum, which has a similar 30 keV flux. Including a power law for the high-energy component to the CompTT model\nresulted in an acceptable fit with kTe = 27 ± 2.2 keV, τ = 1.9 ± 0.25, and Γ = 1.9 ± 0.1 compared to (kTe = 35 ± 6\nkeV, τ = 1.3 ± 0.2, Γ = 1.3 ± 1.0) for our spectrum. Fixing kTe and Γ to the values from Bouchet et al. (2009), we\nfind τ = 2.56 ± 0.03, significantly higher.\nThey also tested a scenario where the high-energy emission is due to a second thermal Comptonization component\nfor a CompTT+CompTT model with best-fit parameters kTe1 = 29.4±3.1 keV, τ1 = 1.6±0.1, kTe2 = 100 keV (fixed), and\nτ2 = 2.2±0.8. The seed photon temperature for the second CompTT component was tied to kTe1. We fitted our spectrum\nto this scenario with comparable parameters for the CompTT component (kTe1 = 25 ± 3 keV and τ = 1.77 ± 0.06), but\nthe optical depth for the second component is significantly different (1.0 ± 0.3).\n4.2. Origin of the High-energy Emission\nAs mentioned above, the physical mechanism that produces the high-energy excess, or hard tail, remains unclear. A\npossible explanation is that the photons are produced by a hybrid thermal/non-thermal Comptonizing plasma (Coppi\n\nGRS 1758 & 1E 1740 with INTEGRAL\n9\n1999). This model has been used to explain the hard tails in Cyg X-1 in the soft state (Gierli´nski et al. 1999; Cangemi\net al. 2021), GX339-4 (Del Santo et al. 2008), GRS 1716-249 (Bassi et al. 2020), among other sources.\nAnother suggested interpretation is that the hard tail is due to a second thermal Comptonizing component. Bouchet\net al. (2009) applied this interpretation to 1E, as seen in the previous section.\nA third possibility is that the excess is non-thermal emission related to the radio jet.\nObservations since the\nearly 2000s have found steady, compact jets in radio observations of numerous black hole binaries in the hard state\n(Fender & Belloni 2004). During the soft state, the jet is either not present or extremely faint (Russell et al. 2019;\nMaccarone et al. 2020). During the hard to soft state transition, the jet becomes unstable and flares are seen at radio\nwavelengths (Fender (2006) and references within. Polarization detections by INTEGRAL of Cyg X-1 (Laurent et al.\n2011; Jourdain et al. 2012), MAXI J1348−630 (Cangemi et al. 2023), and Swift J1727.8−1613 (Bouchet et al. 2024)\nsupport this interpretation, at least in some sources.\nGRS and 1E radio observations have long reported the existence of persistent jets (e.g. Rodriguez et al. (1992);\nMirabel & Rodr´ıguez (1999); Mart´ı et al. (2017); Tetarenko et al. (2020)). A study of the spectral states in GRS with\nRXTE/PCA and VLA during 2001-2003 found behavior consistent with the standard hard/soft paradigm Soria et al.\n(2011) presented above. For 1E multi-wavelength analysis during July 2007 show only upper limits from ATCA radio\nobservations during our soft state (Dickey et al. 2023), suggesting that 1E also follows the expected behavior.\nIn the jet interpretation, the soft gamma-ray photons are produced at the base of the jet (Zdziarski\n2012). In\ncontrast, the emission is connected to the corona in the hybrid thermal/non-thermal plasma and second thermal\nCompontionzing component interpretations. In the hybrid thermal/non-thermal model, the thermal and non-thermal\nelectrons come from the accretion flow (Poutanen & Veledina 2014). The non-thermal electrons are possibly produced\nby shock acceleration (Fragile & Blaes 2008; Das et al. 2009; Henisey et al. 2012) or magnetic reconnection (Ding et\nal. 2010; Riquelme et al. 2012; Hoshino 2013). Thus any changes in the accretion flow that effect the population of\nthermal electrons are expected to also effect the non-thermal electron population, resulting in a correlation between\nthe two components. Thus a possible way to differentiate between the corona and jet interpretations is to investigate\nthe correlations between the hard X-rays and the soft gamma-rays.\nTherefore, we looked for correlations in count rates between four broad energy bands in the GRS hard medium state\nand the 1E medium and high states. Figure 6a shows the 30 −50 keV count rate versus the 50 −100 keV count rate\n(first panel), 100 −300 keV (second panel), and 300 −600 keV (third and fourth panels). The bottoms panels show\nthe same data as the third panel, but the data were rebinned to 1 counts/sec bins. Figure 6b shows the same plots\nfor 1E with the medium state plotted as red squares and the high state plotted as blue triangles. For each panel, we\ncalculated the Spearman correlation coefficient and the standard deviation from a null correlation.\nIn the case of GRS, the Spearman coefficients (and standard deviations) are 0.98 (-7.63), 0.86 (-6.65), and -0.07\n(0.58) for the 50−100, 100−300, and 300−600 keV energy bands, respectively. There are strong correlations between\nthe 30−50 keV band count rate and the count rates in the next two higher energy bands. However, there is no strong\ncorrelation between the 30−50 keV and 300−600 keV count rates. The lack of correlation may be due to large errors\nin the 300 −600 keV count rates so we rebinned the data in 1 counts/sec bins based on the 30−50 keV count rate.\nEven with higher statistics, there is still no significant correlation between the two energy bands with a coefficient of\n-0.57 (1.51), though there is a weak anti-correlation between the two energy bands, which is biased by the highest and\nlowest count rate points. If they are excluded, the coefficient (and standard deviation) are 0.02 (-0.06).\nFor 1E, the medium state correlations (and standard deviations) are 0.92 (-4.96), 0.84 (-4.51), and -0.04 (0.23) for\nthe 50−100, 100−300, and 300−600 keV energy bands, respectively. For the high state the values are 0.95 (-5.84),\n0.85 (-5.27), and 0.21 (-1.27) for the same energy bands as the medium state. Thus in both states the there are strong\ncorrelations between the 30−50 keV count rates and the count rates in the next two higher bands, but no significant\ncorrelation between with the 300−600 keV count rates. Again, the 300−600 keV count rates are low so we rebinned\nthe data as was done for GRS and calculated the correlations (and standard deviations). There is still no strong\ncorrelation with coefficients of -0.10 (0.20) and -0.29 (0.70) for the medium and high states, respectively. The scatter\nbetween the points was still large so we combined the data in 2 counts/s bins and across spectral states (shown in the\nbottom panel with black diamonds). In this case, there is a weak positive correlation of 0.40 (-0.80). As with GRS,\nthe lowest and highest count-rate values heavily influence the results. Excluding the lowest point, the correlation is\n-0.20 (0.35) while excluding the highest point the corelation is 1.00 (-1.73). However, the 300 −600 count rates are\n\n10\nRodi et al.\n(a)\n(b)\nFigure 6. The 50 −100 keV (first), 100 −300 keV (second), and 300 −600 (third and fourth) keV count rates versus 30 −50\nkeV count rate for the GRS hard medium state (a) and the 1E medium and high states (b), which are plotted as red squares\nand blue triangles, respectively. The bottom panel shows the 300 −600 versus 30 −50 keV count rates with the data rebinned\nin 1 ct/s bins and the 2 counts/s bins plotted as black diamonds with the best-fit constant value overplotted as a black dotted\nline.\nconsistent with a constant value of 0.017 ± 0.003 ct/s (χ2/ν = 1.79/4 = 0.45), which is plotted as a black dashed line\nin the bottom panel of Figure 6b.\nThe strong correlation between the count rates below 300 keV suggest that those photons originate from the same\nmechanism. This is consistent with the spectral fitting, which finds that thermal Comptonization dominates up to\n∼200 keV. However, a lack of strong correlation between the hard X-rays (30−50 keV) and the soft gamma-rays\n(300−600 keV) suggests that the high-energy photons arise from a different mechanism. These results then favor\nthe jet interpretation over the corona interpretation for the origin of the high-energy excess in GRS. For 1E, the\ninterpretation is less clear. The results when rebinning in 2 counts/s intervals are suggestive of a correlation when\nincluding all the points (0.40), but the correlation coefficient is heavily depenent on the lowest count rate value, and\nthe count rates are consistent with a constant value. Detections of polarization in the sources could help determine\nthe origin of the hard tails. However, the 300−600 keV fluxes for the sources are quite low compared to previous\nsource with polarization detections from IBIS or SPI. The GRS hard medium flux is roughly 50 mCrab compared to\nthe Crab spectrum reported in Jourdain & Roques (2020). The 1E medium and high fluxes are approximately 33 and\n60 mCrab, respectively. The hard-tail fluxes are roughly an order of magnitude lower than those of Cyg X-1 (Laurent\net al. 2011), making the detection of polarization difficult (Motta et al. 2021).\n5. CONCLUSION\nINTEGRAL’s extensive monitoring of GRS and 1E for over 20 years has enabled an in-depth study of the spectral\nbehavior of the two sources from hard X-rays to soft gamma-rays, and we investigated their characteristics up to 600\nkeV. In the case of GRS, we found it to be predominately in a spectral state with a Comptonized spectrum that\ndoes not vary with flux (∼20/25 Ms). For comparatively brief periods during our observations, the source displayed\na flux dependent spectral behavior where the 30−90 keV photon index decreased as the 50 keV flux increased. In\ncontrast, 1E exhibited a more straight forward spectral-flux relationship where the 30−90 keV spectrum hardens are\nthe the 50 keV flux increases, though the spectrum is relatively stable in the flux ranges: < 4.5 × 10−5 ph/cm2/s,\n4.5 × 10−5 −1.45 × 10−4 ph/cm2/s, > 1.45 × 10−4 ph/cm2/s.\n\nGRS 1758 & 1E 1740 with INTEGRAL\n11\nThree of the spectra showed significant emission up to ∼600 keV (GRS hard medium, 1E medium and high).\nSubsequently, we fitted the 30−610 keV energy range to a CompTT model. The residuals of each spectrum showed an\nexcess above roughly 200 keV. For the GRS hard medium and 1E high state spectra the χ2/ν values are unacceptable,\nwhile the fit to the 1E medium state is still acceptable. The residuals in each fit showed and excess above ∼200 keV.\nThus we fitted the spectra with a CompTT+powerlaw model. The χ2/ν improves in each case, but the improvement\nwas not significant for the 1E medium state (∼2.8σ). For the GRS hard medium and 1E high state, the fits become\nacceptable (χ2/ν = 1.08 and = 0.99, respectively).\nAs the nature of the high-energy excess remains unclear, we tested a scenario where those photons are from a hybrid\nthermal/non-thermal corona using the Eqpair model. In each fit, the fraction of power devoted to energetic particle\naccelerating the non-thermal particles is > 0.58 and statistically significant (> 8σ), supporting the presence of a\nhigh-energy excess in each spectrum.\nHowever, the hard tails may also be associated with the radio jet, as has been reported for Cyg X-1, MAXI\nJ1348−630, and Swift J1728.8−1613, based on polarization measurements. To differentiate between the two scenarios\nwe investigated the energy dependent correlations for each. We found that the 30−50 keV count rates are strongly\ncorrelated with the count rates below 300 keV. However, above 300 keV the behavior changes. For GRS and the 1E\nmedium and hard states there are weak anti-correlations (-0.57, -0.10, and -0.29, respectively) between the 30−50 keV\nand 300 −600 keV energy bands when rebinning the data for higher statistics.\nThe lack of a positive correlation between the 30−50 keV and 300−600 keV count rates suggest that photons for\nthe two energy bands are produced in different locations, or by different physical processes, which would be in tension\nwith the hybrid thermal/non-thermal Comptonization scenario. Thus these results seem to support a jet origin for the\nhigh-energy photons at least in the case of GRS, but due to the low count rate in the 300−600 keV energy band, the\nanti-correlations and lack of correlation are not significant enough to exclude the possibility of a positive correlation.\nFor 1E, the interpretation is more complicated due to the large scatter in the 300 −600 keV count rates, even when\nrebinned. Further rebinning results in a positive, but weak, correlation, though with few bins and combining different\nspectral states. However, the 300−600 keV count rate is consistent with a constant value, supporting a jet origin\ninterpretation, but not excluding a corona origin interpretation.\nThe authors thank the referee for their comments and suggestions to improve the paper. The authors thank the\nItalian Space Agency for the financial support under the “INTEGRAL ASI-INAF” agreement n◦2019-35-HH.0. The\nresearch leading to these results has received funding from the European Union’s Horizon 2020 Programme under the\nAHEAD2020 project (grant agreement n. 871158). Based on observations with INTEGRAL, an ESA project with\ninstruments and science data centre funded by ESA member states (especially the PI countries: Denmark, France,\nGermany, Italy, Switzerland, Spain) and with the participation of Russia and the USA.\nREFERENCES\nBassi, T., Malzac, J., Del Santo, M., et al. 2020, MNRAS,\n494, 571. doi:10.1093/mnras/staa739\nBouchet, L., Del Santo, M., Jourdain, E. et al. 2009, ApJ,\n693, 1871\nBouchet, T., Rodriguez, J., Cangemi, F., et al. 2024, A&A,\n688, L5. doi:10.1051/0004-6361/202450826\nCangemi, F., Beuchert, T., Siegert, T., et al. 2021, A&A,\n650, A93. doi:10.1051/0004-6361/202038604\nCangemi, F., Rodriguez, J., Belloni, T., et al. 2023, A&A,\n669, A65. doi:10.1051/0004-6361/202243564\nCastro, M., D’Amico, F., Braga, J., et al. 2014, A&A, 569,\nA82. doi:10.1051/0004-6361/201323290\nCoppi, P. S. 1999, High Energy Processes in Accreting\nBlack Holes, 161, 375\nDas, S., Becker, P. A., & Le, T. 2009, ApJ, 702, 649.\ndoi:10.1088/0004-637X/702/1/649\nDel Santo, M., Bazzano, A., Zdziarski, A. A., et al. 2005,\nA&A, 433, 613. doi:10.1051/0004-6361:20042058\nDel Santo, M., Malzac, J., Jourdain, E., et al. 2008,\nMNRAS, 390, 227. doi:10.1111/j.1365-2966.2008.13672.x\nDickey, J. M., Vrtilek, S. D., McCollough, M., et al. 2023,\nApJS, 268, 35. doi:10.3847/1538-4365/ace4b9\nDing, J., Yuan, F., & Liang, E. 2010, ApJ, 708, 1545.\ndoi:10.1088/0004-637X/708/2/1545\nFender, R. 2006, Compact stellar X-ray sources, 381.\ndoi:10.48550/arXiv.astro-ph/0303339\nFender, R. & Belloni, T. 2004, ARA&A, 42, 317.\ndoi:10.1146/annurev.astro.42.053102.134031\n\n12\nRodi et al.\nFragile, P. C. & Blaes, O. M. 2008, ApJ, 687, 757.\ndoi:10.1086/591936\nGierli´nski, M., Zdziarski, A. A., Poutanen, J., et al. 1999,\nMNRAS, 309, 496. doi:10.1046/j.1365-8711.1999.02875.x\nHenisey, K. B., Blaes, O. M., & Fragile, P. C. 2012, ApJ,\n761, 18. doi:10.1088/0004-637X/761/1/18\nHirsch, M., Pottschmidt, K., Smith, D. M., et al. 2020,\nA&A, 636, A51. doi:10.1051/0004-6361/201834647\nHoshino, M. 2013, ApJ, 773, 118.\ndoi:10.1088/0004-637X/773/2/118\nJensen, P. L., Clausen, K., Cassi, C. et al. 2003, A&A, 411,\nL7\nJohnson, W. N., Kurfess, J. D., Purcell, W. R., et al. 1993,\nA&AS, 97, 21\nJourdain, E., Roques, J. P., Chauvin, M., & Clark, D. J.\n2012, ApJ, 761, 27J\nJourdain, E. & Roques, J. P. 2020, ApJ, 899, 131.\ndoi:10.3847/1538-4357/aba8a4\nKuznetsov, S. I., Gilfanov, M. R., Churazov, E. M., et al.\n1999, Astronomy Letters, 25, 351.\ndoi:10.48550/arXiv.astro-ph/9903212\nLaurent, P., Rodriguez, J., Wilms, J., Cadolle Bel, M.,\nPottschmidt, K., & Grinberg, V. 2011. Science, 332, 438L\nLebrun, F., Leray, J. P., Lavocat, P., et al. 2003, A&A, 411,\nL141. doi:10.1051/0004-6361:20031367\nMaccarone, T. J., Osler, A., Miller-Jones, J. C. A., et al.\n2020, MNRAS, 498, L40. doi:10.1093/mnrasl/slaa120\nMart´ı, J., Luque-Escamilla, P. L., Bosch-Ramon, V., et al.\n2017, Nature Communications, 8, 1757.\ndoi:10.1038/s41467-017-01976-5\nMcConnell, M. L., Ryan, J. M., Collmar, W., et al. 2000,\nApJ, 543, 928. doi:10.1086/317128\nMirabel, I. F. & Rodr´ıguez, L. F. 1999, ARA&A, 37, 409.\ndoi:10.1146/annurev.astro.37.1.409\nMotta, S. E., Rodriguez, J., Jourdain, E., et al. 2021,\nNewAR, 93, 101618. doi:10.1016/j.newar.2021.101618\nNatalucci, L., Tomsick, J. A., Bazzano, A., et al. 2014,\nApJ, 780, 63. doi:10.1088/0004-637X/780/1/63\nPottschmidt, K., Chernyakova, M., Zdziarski, A. A., et al.\n2006, A&A, 452, 285. doi:10.1051/0004-6361:20054077\nPottschmidt, K., Chernyakova, M., Lubi´nski, P., et al. 2008,\nThe 7th INTEGRAL Workshop, 98.\ndoi:10.22323/1.067.0098\nPoutanen, J. & Veledina, A. 2014, SSRv, 183, 61.\ndoi:10.1007/s11214-013-0033-3\nRiquelme, M. A., Quataert, E., Sharma, P., et al. 2012,\nApJ, 755, 50. doi:10.1088/0004-637X/755/1/50\nRodriguez, L. F., Mirabel, I. F., & Marti, J. 1992, ApJL,\n401, L15. doi:10.1086/186659\nRussell, T. D., Tetarenko, A. J., Miller-Jones, J. C. A., et\nal. 2019, ApJ, 883, 198. doi:10.3847/1538-4357/ab3d36\nSidoli, L. & Mereghetti, S. 2002, A&A, 388, 293.\ndoi:10.1051/0004-6361:20020546\nSmith, D. M., Heindl, W. A., & Swank, J. H. 2002, ApJL,\n578, L129. doi:10.1086/344701\nSoria, R., Broderick, J. W., Hao, J., et al. 2011, MNRAS,\n415, 410. doi:10.1111/j.1365-2966.2011.18714.x\nTetarenko, A. J., Rosolowsky, E. W., Miller-Jones, J. C. A.,\net al. 2020, MNRAS, 497, 3504.\ndoi:10.1093/mnras/staa2175\nUbertini, P., Lebrun, F., Di Cocco, G., et al. 2003, A&A,\n411, L131. doi:10.1051/0004-6361:20031224\nVedrenne, G., Roques, J.-P., Sch¨onfelder, V., et al. 2003,\nA&A, 411, L63. doi:10.1051/0004-6361:20031482\nZdziarski, A. A., Grove, J. E., Poutanen, J., et al. 2001,\nApJL, 554, L45. doi:10.1086/320932\nZdziarski, A. A 2012, MNRAS, 422, 1750\n",
  "metadata": {
    "source_path": "papers/arxiv/High_Energy_Jet_Emission_from_GRS_1758-258__1E_17407-2942_with\n__INTEGRAL_0e8bb139d2494c55.pdf",
    "content_hash": "0e8bb139d2494c558a244f1cb2ac8d697d3f3703dea1aaee06db0ab2e6e771c5",
    "arxiv_id": null,
    "title": "High_Energy_Jet_Emission_from_GRS_1758-258__1E_17407-2942_with\n__INTEGRAL_0e8bb139d2494c55",
    "author": "",
    "creation_date": "D:20250225023244Z",
    "published": "2025-02-25T02:32:44",
    "pages": 12,
    "size": 983816,
    "file_mtime": 1740470202.5522814
  }
}