{
  "text": "Astronomy & Astrophysics manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\n©ESO 2025\nFebruary 25, 2025\nA Pristine-UNIONS view on the Galaxy: Kinematics of the distant\nspur feature of the Sagittarius stream traced by Blue Horizontal\nBranch stars\nM. Bayer1, E. Starkenburg1, G. F. Thomas2, 3, N. Martin4, 5, A. Helmi1, A. Byström6, T. de Boer7, E. Fernández\nAlvar2, 3, S. Gwyn8, R. Ibata4, P. Jablonka9, G. Kordopatis10, T. Matsuno11, A. W. McConnachie8, G. E. Medina12, 13,\nR. Sánchez-Janssen14, and F. Sestito15\n1 Kapteyn Astronomical Institute, University of Groningen, Landleven 12, NL-9747AD Groningen, the Netherlands\ne-mail: mbayer@astro.rug.nl\n2 Instituto de Astrofísica de Canarias, E-38205 La Laguna, Tenerife, Spain\n3 Universidad de La Laguna, Dpto. Astrofísica, E-38206 La Laguna, Tenerife, Spain\n4 Université de Strasbourg, Observatoire astronomique de Strasbourg, UMR 7550, F-67000 Strasbourg, France\n5 Max-Planck-Institut für Astronomie, Königstuhl 17, D-69117 Heidelberg, Germany\n6 Institute for Astronomy, University of Edinburgh, Royal Observatory, Blackford Hill, Edinburgh EH9 3HJ, UK\n7 Institute for Astronomy, University of Hawaii, 2680 Woodlawn Drive, Honolulu HI 96822, USA\n8 NRC Herzberg Astronomy and Astrophysics, 5071 West Saanich Road, Victoria, BC, V9E2E7, Canada\n9 Laboratoire d’astrophysique, École Polytechnique Fédérale de Lausanne (EPFL), CH-1290 Sauverny, Switzerland\n10 Université Côte d’Azur, Observatoire de la Côte d’Azur, CNRS, Laboratoire Lagrange, 06000 Nice, France\n11 Astronomisches Rechen-Institut, Zentrum für Astronomie der Universität Heidelberg, Mönchhofstraße 12–14, 69120 Heidelberg,\nGermany\n12 David A. Dunlap Department of Astronomy & Astrophysics, University of Toronto, 50 St George Street, Toronto ON M5S 3H4,\nCanada\n13 Dunlap Institute for Astronomy & Astrophysics, University of Toronto, 50 St George Street, Toronto, ON M5S 3H4, Canada\n14 STFC UK Astronomy Technology Centre, Royal Observatory, Blackford Hill, Edinburgh, EH9 3HJ, UK\n15 Centre for Astrophysics Research, Department of Physics, Astronomy and Mathematics, University of Hertfordshire, Hatfield,\nAL10 9AB, UK\nReceived - XX, XXXX; accepted - XX, XXXX\nABSTRACT\nContext. Providing a detailed picture of the Sagittarius (Sgr) stream offers important constraints on the build-up of the Galactic halo\nas well as its gravitational potential at large radii. While several attempts have been made to model the structure of the Sgr stream,\nno model has yet been able to match all the features observed for the stream. Moreover, for several of these features, observational\ncharacterisation of their properties is rather limited, particularly at large distances.\nAims. The aim of this work is to investigate the kinematics of the Sgr stream outermost spur feature using blue horizontal branch\n(BHB) stars.\nMethods. Candidate BHB stars were selected by combining two approaches; one capitalising on Pan-STARRS1 3Π griz and u\nphotometry taken as part of UNIONS, the other using Pristine Survey CaHK and SDSS ugr photometry. Follow-up optical spectra\nare obtained using ESO/VLT/FORS2 to confirm their BHB nature and obtain line-of-sight (LOS) velocities.\nResults. Of our 25 candidates, 20 stars can be confirmed as bona fide BHB stars. Their LOS velocities, together with the 3D positions\nof these stars qualitatively match well with Sgr model predictions and trace the outer apocentre of the trailing arm and its spur feature\nvery nicely. The quantitative offsets that are found between our data and the different models can be used to provide information about\nthe Galactic gravitational potential at large distances. We present a first, tentative, analysis in this direction, showing that the model\nof Vasiliev et al. (2021) would provide better agreement with our observations if the enclosed mass of the Milky Way within 100 kpc\nwere lowered to (5.3±0.4)×1011 M⊙\n\u0010\nversus (5.6±0.4)×1011 M⊙\n\u0011\n.\nConclusions. Our selection of BHB stars provides a new view on the outermost structure in 3D positions and LOS velocities of the\nSgr debris.\nKey words. Galaxy: halo – stars: horizontal branch – techniques: spectroscopic – line: profiles – stars: kinematics and dynamics –\ntechniques: radial velocities\n1. Introduction\nThe Sagittarius dwarf spheroidal galaxy is one of the largest\nbuilding blocks of the Milky Way (MW) halo (e. g., Majewski\net al. 2003; Read & Erkal 2019; Naidu et al. 2020) with an esti-\nmated, present, total mass inside the remnant of at least 109 M⊙\n(Ibata et al. 1997). Over the past 30 years since its original dis-\ncovery (Ibata et al. 1994), it became clear that the stellar stream\nproduced by the infall of this dwarf galaxy onto the MW is wrap-\nping around the Galaxy fully and it is a major component of\nthe Galactic halo (e. g., Ibata et al. 2001; Majewski et al. 2003;\nArticle number, page 1 of 21\narXiv:2502.17319v1  [astro-ph.GA]  24 Feb 2025\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nHelmi 2004; Johnston et al. 2005; Belokurov et al. 2006, 2014;\nSesar et al. 2017a; Antoja et al. 2020; Ibata et al. 2020; Ramos\net al. 2020; Naidu et al. 2020; Ramos et al. 2022). Specifically,\nthe stellar stream is believed to dominate the outer Galactic halo\nat galactocentric radii beyond 25 kpc (Naidu et al. 2020).\nMany intricate features can be seen in the arms of the Sagit-\ntarius debris. With the onset of large-area deep photometric sur-\nveys as the Sloan Digital Sky Survey (SDSS, York et al. 2000),\npositional and photometric data of giant stars with relatively pre-\ncise distances, including stars on the horizontal branch (HB),\nwere used to map the streams. It was established that the apoc-\nentres of the leading and trailing arm are significantly different\n(47.8 ± 0.5 and 102.5 ± 2.5 kpc, respectively, Belokurov et al.\n2014). Belokurov et al. (2014) furthermore reported i) a confir-\nmation of the bifurcation of the southern trailing tail (Koposov\net al. 2012) from the double-peaked profile of blue HB (BHB)\nstars across the stream at longitude 145◦<ΛSgr <170◦in stream\ncoordinates1, (ii) a gentle precession of the orbital plane, and (iii)\na potentially differing evolution across the sky of the brighter and\nfainter tails.\nFurther insight in the 3D structure of the Sagittarius debris,\nout to large distances, can be provided by variable RR Lyrae stars\n(e. g., Vivas et al. 2005). These tracers can be uncovered in time-\ndomain photometry, as for instance provided by the Panoramic\nSurvey Telescope and Rapid Response System 1 (Pan-STARRS\n1, hereafter PS1, Chambers et al. 2016), or currently with much\nlarger coverage and precison by Gaia DR3 (Gaia Collaboration\net al. 2023; Clementini et al. 2023; Li et al. 2023b; Muraveva\net al. 2024). The PS1 dataset resulted in the remarkably clean\nand complete catalogue of RR Lyrae stars by Sesar et al. (2017b)\nand Hernitschek et al. (2017). Sesar et al. (2017a) use this sample\nwithin 13◦of the Sagittarius orbital plane to study the Sagittar-\nius debris, resulting in a selection of 19,000 candidate RR Lyrae\nstars. With their catalogue sensitivity out to larger distances, they\nreveal an extra arm at heliocentric distances of 120 kpc in the\ntrailing stream at ΛSgr =172◦called the “spur” feature. Starken-\nburg et al. (2019) subsequently note that their sample of pho-\ntometrically selected candidate BHB stars also shows the same\nfeature, confirming that indeed the most distant features of the\nSagittarius stream are equally complex, with many intricate fea-\ntures.\nMany studies have demonstrated they can model the multiple\nwraps of the Sagittarius debris (e. g., Ibata & Lewis 1998; Helmi\n& White 2001; Law & Majewski 2010; Dierickx & Loeb 2017;\nThomas et al. 2017; Fardal et al. 2019; Vasiliev et al. 2021; Oria\net al. 2022; Davies et al. 2024). However, only a few studies have\nmade predictions for the spur feature under study. For instance,\nboth Dierickx & Loeb (2017) and Fardal et al. (2019) show that\nusing N-body simulations one can reproduce the multiple wraps\nas well as the spur feature. As the data are consistent with a wide\nrange of models, the authors mention several tests for their mod-\nels, including the velocity structure of the spur feature. Fardal\net al. (2019) provide a number of important model predictions\nto separate stars dynamically in the spur feature from the main\ntrailing arm. These authors predict that line-of-sight (LOS) ve-\nlocity measurements for a sample of bright spur feature members\nreaching an uncertainty of about 10 km s−1 would be sufficient\nfor this purpose.\nAn additional study to predict the stream feature, and further-\nmore also model the influence of the LMC on the merger as first\nsuggested by Vera-Ciro & Helmi (2013), is presented by Vasiliev\n1 See appendix of Belokurov et al. (2014) for this coordinate transfor-\nmation\net al. (2021). Their N-body simulations of the interaction of the\nLMC, Galaxy, and Sagittarius produce a spur feature composed\nof stars stripped about 2.5 billion years ago at the penultimate\npericentre passage of the Sagittarius galaxy. Subsequently, Oria\net al. (2022) re-explore the idea that the progenitor of Sagittarius\nwas a disc galaxy, with the disc roughly perpendicular to both\nthe MW disc and Sagittarius dwarf galaxy orbital plane. Their\nmodel results in the observed bifurcation of both the leading and\ntrailing part of the Sagittarius tidal arm (as observed in more de-\ntail by, e. g., Ramos et al. 2022), but it seems not to significantly\naffect the Sagittarius spur region.\nIn this work, we use updated photometric catalogues and se-\nlection techniques (Thomas et al. 2018; Starkenburg et al. 2019)\nto select the best candidate BHB member stars of the outermost\ntrailing arm apocenter and spur feature and follow these stars\nup spectroscopically to determine their LOS velocities and con-\nstrain this feature kinematically for the first time. The most lumi-\nnous standard candles observable with sufficient signal-to-noise\nratio are outside of the limits of current spectroscopic surveys.\nTherefore, there is little published data on LOS velocities of\nbright stars in this outer realm of the Galaxy.\nThis work has two primary aims: firstly, we aim to in-\nvestigate, using spectroscopic data, the effectiveness of se-\nlecting BHB stars using narrow and/or broad-band photome-\ntry, especially at the faint-end magnitudes, corresponding to\nBHB stars located in the outermost region of the MW stel-\nlar halo at distances above 50 kpc. To this end, we employ the\nESO/VLT/FORS2 spectrograph with the 600B+22 grating cov-\nering the Balmer lines of the stars from which their discrimi-\nnatory surface gravity can be determined, separating BHB stars\nfrom contaminants.2 Secondly, we wish to ascertain whether the\nLOS velocities derived from the optical VLT/FORS2 spectra of\nthe confirmed BHB stars can provide further observational con-\nstraints on the MW gravitational potential at large distance.\nThe structure of this study is as follows. In Sect. 2 we lay out\nthe characteristics of the sample of candidate BHB stars in the\nSagittarius stream spur feature, describe the methodology used\nfor the data reduction, spectral analysis, and stellar classifica-\ntion, and present the data on the kinematics of the classified BHB\nstars. We present and discuss the results in comparison to sim-\nulations and its implications for the Galactic potential at large\ndistances (Sect. 3.2) and to the MW globular cluster NGC 2419\n(Sect. 3.3) in Sect. 3, and summarise in Sect. 4.\n2. Data\n2.1. Sample selection of candidate Blue Horizontal Branch\nstars\nIn order to cleanly select BHB stars, one needs to discrimi-\nnate them from contamination sources with similar broad-band\ncolours, such as white dwarfs, quasars, and – most importantly\nat the magnitudes of our study – blue straggler stars. Previous\nresearch has established that there are various ways to deselect\nspectroscopically and/or photometrically the mentioned contam-\ninants (e. g., Xue et al. 2008, 2011; Vickers et al. 2012; Barbosa\net al. 2022; Yu et al. 2024; Amarante et al. 2024; Fukushima\net al. 2024; Byström et al. 2024).\nRegarding quasars as contamination, analysis of the dered-\ndened (u−g)SDSS,0 versus (g−r)SDSS,0 diagram of stellar-like ob-\njects by Yanny et al. (2000) showed that A-type stars have similar\n2 Based on observations collected at the European Southern Observa-\ntory under ESO programmes 106.21L8.001 and 106.21L8.002 (PI: E.\nStarkenburg).\nArticle number, page 2 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\n(g−r)SDSS,0 colour index values as quasars but are about 1 mag\nredder in (u−g)SDSS,0. Using this or a similar colour space, previ-\nous works have been able to select out quasars as well as white\ndwarfs (e. g., Xue et al. 2008, 2011; Deason et al. 2011, 2014;\nIbata et al. 2017; Starkenburg et al. 2019; Fantin et al. 2019;\nBarbosa et al. 2022).\nOther works have looked at colour spaces using the near-\ninfra-red instead of the near-ultraviolet in combination with op-\ntical photometry and report also success in filtering out quasars\nand white dwarfs from (candidate) A-type stars (e. g., Vickers\net al. 2012; Deason et al. 2018; Fukushima et al. 2018, 2019; Yu\net al. 2024; Amarante et al. 2024; Fukushima et al. 2024). A key\nstudy of Vickers et al. (2012) comparing SDSS (i−z)0,SDSS and\n(g−r)0,SDSS of stellar-like objects with spectroscopic data found\nthat quasars and white dwarfs are on average the reddest and\nbluest, respectively, in (i−z)0,SDSS of all contaminants.To further\ndistinguish BHB stars from quasars, Vickers et al. (2012), in turn\nbased on the results of Lenz et al. (1998), also use (g−r)SDSS,0,\nsince quasars tend to have higher values for this colour index\n(especially at higher redshifts) due to more uniform emission in\nthese bands, in contrast to blue stars. Most studies investigating\nthe photometric selection of (candidate) BHB stars since have in-\ndeed been based on such a combination of optical and near-infra-\nred filters using either data from the Subaru Telescope/Hyper\nSuprime-Cam (e. g., Deason et al. 2018; Fukushima et al. 2018,\n2019, 2024) or the Dark Energy Survey (e. g., Yu et al. 2024).\nTo tackle the contamination from blue straggler stars at sim-\nilar magnitudes, mainly three ways are suggested in the litera-\nture. Firstly, some studies have used typically low-resolution op-\ntical spectra of A-type stars to use the measured widths of\nBalmer lines as discriminator between BHB and more com-\npact blue straggler stars. Due to their higher surface gravity and\nthus stronger pressure broadening, the Balmer lines are broader\nfor blue straggler stars than for BHB stars (see, e. g., Clewley\net al. 2002; Xue et al. 2008, 2011). A discrimination based on\nthe widths of Balmer lines can be expressed in these measured\nwidths directly, but also in resulting effective temperatures and\nsurface gravities estimated from (these same lines in the) spectra\n(e. g., Barbosa et al. 2022; Byström et al. 2024). Vickers et al.\n(2021) demonstrate that also a classifier trained on Large Sky\nArea Multi-Object Fiber Spectroscopic Telescope (LAMOST,\nCui et al. 2012) spectra of BHB and non-BHB stars with suf-\nficient signal-to-noise ratio can yield a selection of (candidate)\nBHB stars with a purity of 86 per cent.\nSecondly, as suggested by Lenz et al. (1998) a near-\nultraviolet band as SDSS u that captures the Balmer break in\nhot stars can also be used to differentiate between BHB and blue\nstraggler stars since the strength of the Balmer break in hot stars\nis dependent on the surface gravity (see works by, e. g., Ruh-\nland et al. 2011; Deason et al. 2011, 2014; Thomas et al. 2018;\nStarkenburg et al. 2019).\nThirdly, it is now well established from a variety of studies\nthat also near-infra-red filters around the Paschen lines in com-\nbination with optical photometry also separates blue straggler\nfrom BHB stars when the signal-to-noise ratio is high enough\n(e. g., Vickers et al. 2012; Deason et al. 2018; Fukushima et al.\n2018, 2019; Thomas et al. 2018; Yu et al. 2024; Amarante et al.\n2024; Fukushima et al. 2024).\nIn summary, it has been shown that even photometric selec-\ntions of candidate BHB stars can provide high purities between\n80 and 90 per cent. The approach we follow in this work for pho-\ntometric selection of candidate BHB stars in the spur feature of\nthe Sagittarius stream uses this technique as well.\nFollowing the approach of Thomas et al. (2018), we ini-\ntially select 974 candidate BHB stars in the Galactic halo. These\ncandidate BHB stars were originally isolated from contaminat-\ning candidate blue straggler stars in a photometric sample that\ncombined PS1 griz data taken as part of the 3Π survey with u-\nband data taken with CFHT/MegaCam. The latter observations\nwere taken as part of the Canada-France Imaging Survey (CFIS,\nIbata et al. 2017), that has since been absorbed into the Ultra-\nviolet Near Infrared Optical Northern Survey (UNIONS; Gwyn\net al. 2025, in prep). In addition to CFIS, UNIONS consists of\nmembers of the Pan-STARRS team, and the Wide Imaging with\nSubaru HyperSuprime-Cam of the Euclid Sky (WISHES) team.\nCFHT/CFIS is obtaining deep u and r bands; Pan-STARRS is\nobtaining deep i and moderate-deep z band imaging, and Sub-\naru is obtaining deep z-band imaging through WISHES and g-\nband imaging through the Waterloo-Hawaii IfA g-band Survey\n(WHIGS). These independent efforts are directed, in part, to\nsecuring optical imaging to complement the Euclid space mis-\nsion (Euclid Collaboration et al. 2024), although UNIONS is a\nseparate collaboration aimed at maximizing the science return\nof these large and deep surveys of the northern skies. We note\nthat with the advent of these deeper bands using other facili-\nties, the analysis of Thomas et al. (2018) could be redone using\ndeeper data. However, here we use the existing BHB catalog and\ndemonstrate it is more than sufficient to meet our science goals.\nThe colour spaces, and the location of spectroscopically con-\nfirmed BHB and blue straggler stars (taken from the studies\nof Xue et al. 2008, 2011) are shown in the upper panels of\nFig. 1. From the original 974 stars, 29 candidate BHB stars\nwere identified to be possibly associated to the spur feature due\nto their proximity in terms of declination (25–40 deg) and dis-\ntance (∼80–150 kpc) to this distant arm of the Sagittarius tidal\nstream. An additional 40 BHB candidates could be added in\nthe same region from the sample of Starkenburg et al. (2019).\nWhile Thomas et al. (2018) focuses on the photometric selec-\ntion of candidate BHB stars based on CFIS-u0 and PS1 g0r0i0z0,\nStarkenburg et al. (2019) demonstrated the efficacy of employ-\ning a combination of broad-band SDSS ugr0 and narrow-band\nPristine Survey CaHK0 photometry (Starkenburg et al. 2017)\nto identify candidate BHB stars in the Galactic halo and iso-\nlate them from contaminating samples. The high efficiency of\nthe combination of the two blue u and CaHK bands is illustrated\nin the lower left and middle panel of Fig. 1. Taken together, the\nu and CaHK band demarcate the Balmer break and are therefore\nhighly effective to measure the higher surface gravity of blue\nstraggler compared to BHB stars.\nFigure 1 illustrates the power of the combined colour selec-\ntion from photometry of DR2 of the PS1 3Π survey (Chambers\net al. 2016), CFIS (Ibata et al. 2017), SDSS DR18 (Almeida\net al. 2023), and the Pristine Survey (Starkenburg et al. 2017).\nFor the estimation of interstellar extinction we used the inte-\ngrated colour excess values along the LOS of each star from\nSchlegel et al. (1998) in combination with the tabulated values\nAX/E(B−V)SFD from Schlafly & Finkbeiner (2011) assuming\nRV = 3.1 and APristine CaHK/E(B−V)SFD = 3.918 (Martin et al.\n2024), where we assume that extinction in CFIS-u is roughly the\nsame as in Sloan-u following Ibata et al. (2017), Thomas et al.\n(2018, 2019, 2020), and Jensen et al. (2021).\nOut of these 69 candidate BHB stars, 25 were followed up\nspectroscopically using FORS2. These were selected on the ba-\nsis of a combination of their proximity to the stream on the sky\ndeclination (25–40 deg where the spur feature is likely located),\ncombined with their colour information. For the remainder of the\nArticle number, page 3 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\n−0.4\n−0.2\n0.0\n(g−r)0,PS [AB mag]\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n(uCFIS−gPS)0 [AB mag]\nTarget stars\n−0.4\n−0.3\n−0.2\n−0.1\n(r−i)0,PS [AB mag]\n−0.4\n−0.2\n0.0\n0.2\n(i−z)0,PS [AB mag]\n1\n2\n3\n(u−g)0,SDSS [AB mag]\n−0.4\n−0.3\n−0.2\n−0.1\n0.0\n(g−r)0,SDSS [AB mag]\n0.25\n0.50\n0.75\n1.00\n1.25\n(uSDSS−Pristine CaHK)0 [AB mag]\n0.0\n0.2\n0.4\n0.6\n0.8\n(uCFIS−Pristine CaHK)0 [AB mag]\n25\n24\n23\n22\n21\n20\n19\n18\n17\n16\n15\n14\n13\n12\n11\n10\n9\n8\n7\n6\n5\n4\n3\n2\n1\nFig. 1. An overview of the target stars in multiple colour-colour spaces is shown. Data were gathered from multiple sources. These are: the\nPanoramic Survey Telescope and Rapid Response System 1 3Π survey Data Release 2 (Chambers et al. 2016; Magnier et al. 2020), the Canada-\nFrance Imaging Survey, the Sloan Digital Sky Survey Data Release 18 (Almeida et al. 2023), and the Pristine Survey (Starkenburg et al. 2017).\nThe candidate BHB stars in our sample are colour-coded according to the number of their id given in Table 1. The background stars come from\ntwo samples. The pink markers are blue straggler stars from the Xue et al. (2008) set while the brown symbols represent BHB stars from the Xue\net al. (2011) dataset.\npaper, we will refer to them with their internal IDs for this study\n(second column in Table 1).\nFigure 1 shows the location of the 25 chosen targets in the\nvarious colour-colour spaces that were used for their selection on\ntop of the spectroscopically identified samples. Because of the\npilot-programme nature of this observational campaign, it was\nnot enforced that the stars were the best BHB-candidates in all\npossible colour spaces. The programme was deliberately leav-\ning the option open that one of the colour spaces would deliver\nan inferior classification. Additionally, we note that updates in\nthe PS1, Pristine survey, and CFIS-u more recent (internal) data\nreleases are affecting the colours with respect to the original se-\nlection. For Pristine the main updates have been a re-calibration\nof the narrow-band CaHK photometry and updates to the data\nreduction pipeline (Martin et al. 2024) and for CFIS the changes\nbetween the original catalogue used by Thomas et al. (2018) and\nthe latest data reduction are due to a change of the photometric\nreduction pipeline and a better estimation of the zero point. The\nchanges in colour for the targets due to these updates are typi-\ncally small, as can be appreciated from the fact that in Fig. 1 still\nmost targets lie in the regions covered by BHB stars.\nMost strikingly, we see that candBHB25 is very discrepant\nin the colour-colour diagrams of the lower and upper left panels\ncompared to where (candidate) BHB stars are to be expected in\nthese projected colour spaces. By contrast, we can also see that\nthe same star is significantly closer to the sequence of (candi-\ndate) BHB stars in the upper middle panel of Fig. 1. Moreover,\ncandBHB24 and candBHB5 are outliers in the top left panel,\nbut fall nicely on the sequence of candidate BHB stars in sev-\neral other panels. Similarly, many more sample stars are off the\nrange of candidate BHB stars in one of the shown colour spaces,\nwhereas follow the expectations in the other projections illus-\ntrated in Fig. 1.\nWe note that the majority of candidate BHB stars in the sam-\nple have very faint PS1 g magnitudes for their Data Release 2,\ngoing well beyond 20 (up to 21.6 AB mag). A consequence of\nthis faint selection is the limited overlap of the target stars in\nGaia DR 3, due to incompleteness beyond Gaia G ≃21 mag\n(Gaia Collaboration et al. 2023) (see also Sect. 3.3).\n2.2. VLT/FORS2 spectroscopic setup\nWe collected VLT/FORS2 data in the wavelength range 3,300–\n6,210 Å using the low spectral resolution (R = 780 at 4,627 Å\nwith a 1 arcsec that corresponds to a velocity resolution of σ =\nc/(2.35×R) = 177 km s−1) 600B+22 grism for the candidate BHB\nstars listed in Table 1. The slit width was 1 arcsec, exposure\ntimes are close to 2300 s, and observational epochs are listed\nin Table 1 (Period 106, PI: E. Starkenburg; ESO programmes\n106.21L8.001 and 106.21L8.002).\nArticle number, page 4 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nTable 1. Basic properties of the candidate BHB stars in the sample.\nDesignation\nId\nR.A.\nDecl.\nGaia source id\nObservation time\nSource\nJ2000\nJ2000\nJulian Date-UTC\n144511105510814456\ncandBHB1\n7h22m12.24s\n30◦25′40.8′′\n885923969299049856\n2459145.820359\nC\n2459193.744190\nJ072805.06+254349.2\ncandBHB2\n7h28m05.04s\n25◦43′48′′\n...\n2459200.699201\nP\n141301122397717196\ncandBHB3\n7h28m57.6s\n27◦45′21.6′′\n873208357842184448\n2459177.726597\nC\n147381140874742260\ncandBHB4\n7h36m20.88s\n32◦49′04.8′′\n...\n2459193.787593\nC\nJ074315.57+331906.5\ncandBHB5\n7h43m15.6s\n33◦19′04.8′′\n...\n2459196.707963\nP\nJ075310.18+271300.1\ncandBHB6\n7h53m10.08s\n27◦13′01.2′′\n...\n2459202.715949\nP\n148711185503191921\ncandBHB7\n7h54m12s\n33◦55′33.6′′\n...\n2459197.740104\nC\nJ075724.50+330505.6\ncandBHB8\n7h57m24.48s\n33◦05′06′′\n881458199742504832\n2459225.660648\nP\nJ075815.87+364537.2\ncandBHB9\n7h58m15.84s\n36◦45′36′′\n906891484241931264\n2459196.753993\nP\nJ075922.63+265611.1\ncandBHB10\n7h59m22.56s\n26◦56′09.6′′\n874378478731783424\n2459192.777477\nP\nJ080051.99+361303.2\ncandBHB11\n8h00m52.08s\n36◦13′04.8′′\n906624234198306816\n2459200.766829\nP\nJ080146.11+343120.7\ncandBHB12\n8h01m46.08s\n34◦31′19.2′′\n905620380080032768\n2459199.732419\nP\nJ080152.47+253951.0\ncandBHB13\n8h01m52.56s\n25◦39′50.4′′\n682026890911273088\n2459176.742639\nP\n145911206860680542\ncandBHB14\n8h02m44.64s\n31◦35′31.2′′\n...\n2459198.756331\nC\n142131209582933555\ncandBHB15\n8h03m49.92s\n28◦26′38.4′′\n876085642331737984\n2459192.730613\nC\nJ080408.41+355917.0\ncandBHB16\n8h04m08.4s\n35◦59′16.8′′\n906925603461957248\n2459202.755405\nP\nJ080712.26+300447.1\ncandBHB17\n8h07m12.24s\n30◦04′48′′\n876855197392497024\n2459201.713171\nP\nJ080757.78+350947.9\ncandBHB18\n8h07m57.84s\n35◦09′46.8′′\n905889932227653888\n2459224.701400\nP\nJ080827.57+301532.4\ncandBHB19\n8h08m27.6s\n30◦15′32.4′′\n876954290877415424\n2459203.723565\nP\nJ080943.83+300352.5\ncandBHB20\n8h09m43.92s\n30◦03′54′′\n876748269886574720\n2459207.693669\nP\nJ081027.60+315155.4\ncandBHB21\n8h10m27.6s\n31◦51′54′′\n901885613958625152\n2459177.769769\nP\nJ081507.72+294705.5\ncandBHB22\n8h15m07.68s\n29◦47′06′′\n...\n2459199.792697\nP\n142731243370082351\ncandBHB23\n8h17m20.88s\n28◦56′34.8′′\n...\n2459176.782975\nC\nJ084934.60+375926.5\ncandBHB24\n8h49m34.56s\n37◦59′27.6′′\n...\n2459196.797465\nP\n2459197.792465\n2459195.808785\nJ090045.36+371809.1\ncandBHB25\n9h00m45.36s\n37◦18′10.8′′\n...\n2459198.799965\nP\n2459225.707431\nNotes. It provides the data on equatorial coordinates in the International Celestial Reference System from PS1 DR2 (Chambers et al. 2016; Magnier\net al. 2020). We use the SDSS and PS1 designation in the first column if the star came from the Pristine Survey (‘P’ in last column) (Starkenburg\net al. 2019) or CFIS catalogue (‘C’ in last column) (Thomas et al. 2018), respectively.\nA key ingredient for reliable and accurate LOS velocity de-\nterminations is the quality of the wavelength calibration. In the\nFORS2 spectrograph, the wavelength calibration is based on the\nlines in spectra of arc-lamps taken at daytime and at zenith. How-\never, for spectra of stars with significant zenith distance (such as\nat high air masses as in our sample), there is a potential for bias\nin the wavelength calibrations due to instrument flexure under\ngravity (Anderson 2020). Strong levels of instrument flexure can\ngive rise to second order effects in the wavelength solution.\nMany researchers have utilised night sky emission lines\nand/or telluric lines to measure these second order effects in the\ndispersion solution that are gathered together with the science\nspectra in the same setup and under the same influence of instru-\nment flexure (e. g., Southworth et al. 2006; Yanny et al. 2009;\nDeason et al. 2012; Caffau et al. 2020). However, in the wave-\nlength range of our study, only a few suitable lines are avail-\nable. Deason et al. (2012) investigated the differential impact\nof these second order effects using strong night sky emission\nlines in FORS2 spectra of 48 candidate BHB stars in a similar\nsetup as in this programme. This study found these effects lead\nto uncertainties in the LOS velocities on the level of 6 km s−1. A\nmore recent study by Caffau et al. (2020) involved also a similar\nFORS2 setup as in this programme and reported more variation\nof the LOS velocities of their stars with reference values, after a\nshift to the dispersion axis of their FORS2 spectra based on the\nmeasured positions of eight unblended night sky emission lines.\nFollowing this result, we refrain from this approach.\nInstead, to establish whether instrument flexure had a signif-\nicant impact on the wavelength solution derived from arc-lamps\ntaken at daytime and at zenith, we additionally gathered data\nwith the same spectral setup (except a smaller slit of 0.4 arcsec)\nfor ten standard stars. Each observing block of our observing\nprogramme would typically have a BHB candidate target, im-\nmediately followed or preceded by the observation of a velocity\nstandard star as close in the sky as possible. The list of velocity\nstandards, and their LOS velocity measurements from literature,\nare presented in Table 2 and taken from Soubiran et al. (2013,\n2018). This approach provides us with a second avenue to test\nthe accuracy and precision of the measured LOS velocities.\n2.3. Spectroscopic reduction\nStandard two-dimensional, CCD data reduction and calibration\nwere performed using the FORS2 pipeline 5.5.7 (2021) within\nthe esoreflex 2.11.3 (2021) environment (Freudling et al. 2013).\nDetails are given in Appendix A3.\n3 Data of the first observation of candBHB1 was sourced from the\nESO archive later as part of the open stream release FOR S2-SPEC.\nBased on data obtained from the ESO Science Archive Facility with\nDOI: https://doi.eso.org/10.18727/archive/77.\nArticle number, page 5 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nTable 2. Key characteristics of the velocity standard stars.\nDesignation\nR.A.\nDecl.\nSpectral type\nBarycentric LOS velocity\nJ2016\nh\nkm s−1i\nBD +24 1843\n8h04m42.70936675s\n24◦19′49.47351216′′\nG\n25.168\n±0.004\nBD +31 1781\n8h18m10.42693323s\n30◦35′49.7809604′′\nK\n13.457\n±0.019\nBD +34 1955\n9h12m37.57008557s\n33◦36′01.09932489′′\nK\n1.539\n±0.004\nWDS J07277+2420A\n7h27m39.94289657s\n24◦20′09.97879538′′\nK\n-18.559\n±0.208\nBD +26 1647\n7h46m58.48254722s\n26◦01′28.79033441′′\nG\n13.109\n±0.008\nBD +31 1684\n7h53m33.99666092s\n30◦35′48.89008376′′\nG\n-234.195\n±0.013\nBD +30 1501\n7h26m19.81197854s\n29◦58′07.98205929′′\nK\n-36.684\n±0.044\nTYC 2461-988-1\n7h32m44.21719125s\n33◦50′06.07594227′′\nF\n23.187\n±0.020\nBD +36 1823\n8h27m18.62972372s\n35◦49′01.65250699′′\nF\n9.282\n±0.043\nBD +35 1801\n8h19m27.87619964s\n35◦01′21.76871662′′\nF\n-23.908\n±0.013\nNotes. The data are sourced from Gaia Collaboration et al. (2023) except the barycentric LOS velocities that come from Soubiran et al. (2018).\nWe used the same approach for the designations as noted in Table 1. The equatorial coordinates are also in the International Celestial Reference\nSystem. Spectral types come from the Extended Stellar Parametrizer for Hot Stars module as part of Gaia DR3 Astrophysical parameters inference\nsystem (Creevey et al. 2023).\n10−2\n10−1\ncandBHB18\nH ζ H δ H γ\nH β\n10−1\nFlux\nh\n10−16 erg ˚A−1 s−1 cm−2i\ncandBHB19\n3500\n4000\n4500\n5000\n5500\nWavelength\nh ˚A\ni\n10−1\ncandBHB15\nFig. 2. The example spectra of three candidate BHB stars listed in Ta-\nble 1 are shown where the wavelength scale is relative to the spectro-\ngraph’s reference frame at the time of each observation. Background\nshaded areas represent the uncertainties of the spectra. Solid red lines\nindicate best-fitting models. The labels at the top annotate some of the\nstrong Balmer lines visible in the spectra. We choose to show the spec-\ntrum of the star with the lowest, median of, and highest median signal-\nto-noise ratio of all spectra across the dispersion axis considered for the\nfitting in the top, middle, bottom panel, respectively.\nThe results of the reduction and calibration are set out in\nFig. 2 for three example spectra of candidate BHB stars in our\nsample. While most of the targets were observed with one sin-\ngle exposure, our faintest programme targets have multiple ex-\nposures. The spectra have signal-to-noise ratios in the range 7-\n25. This figure depicts the general pattern of a prominent blue\ncontinuum and Balmer lines of most of the shown spectra of the\ncandidate BHB stars, as we would expect for these types of stars.\nThe strong and narrow peaks at various wavelengths in the\ntop two shown spectra in Fig. 2 are caused by pixels in the CCD\ndata in the area of the spectra affected by cosmic rays. While it\nwould have been an option to include a removal of the effects\nof cosmic rays in the FORS2 pipeline in a fore- and background\nsubtraction based on a global sky spectrum, a global sky subtrac-\ntion does not take into account variability of the spectral resolu-\ntion across the slit axis. In addition, given that the cosmic rays\npresent in the spectra of some candidate BHB stars do not af-\nfect all the Balmer lines that will be used to identify true BHB\nstars and misclassified BHB stars, we choose to keep them in the\nspectra.\nThe calibrated fluxes rise and fall steeply around 5570–\n5580 Å for the shown spectra in Fig. 2. This is probably due\nto the non-optimal performance of the sky subtraction in that\nwavelength region where the strong [O i] night sky emission line\nis located.\nIn Fig. 2 there is a clear trend of decreasing signal-to-noise\nnoise blueward of around 3,800Å. This could be attributed to the\nfollowing factors. Firstly, it is known that the blue flat field lamp\nis unstable below 3,800Å leading to variations of the spectral\nenergy distribution of 20 per cent and systematic distortions in\nthe calibrated flux given that flat fields are obtained separately\nfor science and flux standard star observations (Anderson 2020).\nSecondly, extrapolation of the wavelength solution for the blue\nend due to a lack of spectral lines in the arc-lamps at the blue\nedge results in significant residuals in this part of the spectrum.\nThis does not affect the central regions of the spectra where most\nof the Balmer lines are located. It can therefore be assumed that\nthe noise-dominated, blue part of the spectrum has no impact on\nour analysis. In the remainder of this work, we considered only\n3,900Å to 5,990Å to be the reliable range of the spectrum.\n2.4. Spectral fitting\nWe used rvspecfit (Koposov et al. 2011; Koposov 2019)4, to\nanalyse the spectra. A major advantage of spectral fitting with\nrvspecfit is that it provides both estimates of the LOS veloc-\nity and of effective temperature and surface gravity from each\nspectrum. Whereas the first parameter provides us the data to\nconstrain the velocity structure of the spur feature of the Sagit-\ntarius stream, the latter makes it possible to classify our sample\nof candidate BHB stars into bona fide BHB, blue straggler stars,\n4 version 0.4.0.240116+dev at github.com/segasai/rvspecfit\nArticle number, page 6 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nor other contaminants in a similar way as done by Barbosa et al.\n(2022) and Byström et al. (2024) (Byström et al. (2024) also uses\nresults from rvspecfit).\nTo estimate the LOS velocity, effective temperature, and sur-\nface gravity of a star from a spectrum, rvspecfit determines the\nbest-fitting synthetic spectrum from a set of interpolated syn-\nthetic stellar spectra from the PHOENIX library (Husser et al.\n2013), version 2. The shift results in a measured apparent LOS\nvelocity of the star. Any remaining imprecision in the data\nis taken into account by a multiplicative, normalizing polyno-\nmial. In more detail, rvspecfit maximises a multivariate Gaus-\nsian likelihood that describes a stellar spectrum given the effec-\ntive temperature, log10(g), [Fe/H], and [α/Fe] as parameters of\nPHOENIX library of templates and LOS velocity5 that results\nafter marginalising over the cofficients of the normalising poly-\nnomial given in the initial χ2 of the spectroscopic data given a\ntemplate of the prepared and interpolated PHOENIX grid.\nTo begin the process of spectral fitting with rvspecfit, we had\nto prepare the set of synthetic stellar spectra from the PHOENIX\nlibrary, in the three instrumental setups that we use and interpo-\nlate between the grid parameters. The three instrumental setups\nthat we use are connected to the spectra of the candidate BHB\nstars in our sample taken with the slit with a width of 1.0 arcsec,\nthe spectra of the velocity standard stars taken with the 0.4 arcsec\nslit, and Sloan Digital Sky Survey DR17 spectra (Abdurro’uf\net al. 2022) of a set of reference BHB and blue straggler stars\nthat we use to classify our target stars in the effective tempera-\nture versus surface gravity space.\nThe process of parameter estimation was carried out given\nthe observed spectra and priors for each parameters. By de-\nfault, rvspecfit assumes uniform priors of effective temperature,\nlog10(g), [Fe/H], and [α/Fe] over the entire PHOENIX grid al-\nthough Gaussian priors can be custom defined. As detailed be-\nlow, we use this option for parameters we have prior information\nfor. We additionally adopt a broad uniform prior of the LOS ve-\nlocity between −500 km s−1 and 500 km s−1 throughout all per-\nformed fitting with rvspecfit to make no strong prior assump-\ntions for the most important parameter of interest in this study.\nFor the spectra of the velocity standard stars, Table 3 lists the\ndefinitions of the normally-distributed priors of effective temper-\nature, log10(g), [Fe/H], and [α/Fe] that we adopted for the pos-\nterior calculation given within rvspecfit. These utilise estimates\nof effective temperature, log10(g), [Fe/H], and [α/Fe] from Gaia\nDR3 the Gaia General Stellar Parametriser for Spectra catalogue\n(Gaia Collaboration et al. 2023; Recio-Blanco et al. 2023) and\nsample statistics for the velocity standard stars for which no es-\ntimates of [Fe/H] and [α/Fe] was available in this catalogue.\nAs shown in Table 4, we do not set priors on log10(g) for our\nprogramme stars as we measure this value to make the BHB/blue\nstraggler distinction. We have information on Teff from their\ncolours (see Appendix B) and adopt a (conservative) prior based\non this information.\nFinally, we set the priors included in the posterior calcu-\nlation when fitting the SDSS spectra of BHB and (candidate)\nblue straggler stars in the Barbosa et al. (2022) and Xue et al.\n(2008) catalogues, respectively, with rvspecfit. The normally-\n5 While rvspecfit includes the capability to estimate the stellar rotation\nparameter v sin i, in section 6 about the known limitations of the Dark\nEnergy Spectroscopic Instrument Early DR based also on results from\nrvspecfit Koposov et al. (2024) recommend not to use estimates v sin i\nfrom the current version of rvspecfit due to several issues as mentioned\nin Koposov et al. (2024). Because of this and also the irrelevance of this\nparameter for the scope of this work, we will not consider the output\nv sin i by rvspecfit.\ndistributed priors used here were synthesised using the same\nmethod detailed for the spectra of the candidate BHB stars,\nwith effective temperature values sourced from two sources, de-\npending on whether it is a BHB or (candidate) blue straggler\nstar, from the Barbosa et al. (2022) or Xue et al. (2008) sets,\nrespectively. These are the results of the Sloan Extension of\nGalactic Understanding and Exploration (SEGUE) Stellar Pa-\nrameter Pipeline, as presented by Lee et al. (2008a,a) and based\non SEGUE data (Yanny et al. 2009) for the BHB stars. In the\nXue et al. (2008) sample, we adopt the effective temperature of\nthe model star with the ELODIE template Prugniel & Soubiran\n(2001) that best describes the SDSS spectrum of each (candi-\ndate) blue straggler star. The latter values are stored as metadata\nin the SDSS spectral data. In contrast to the former source, the\nmetadata only have the effective temperatures without uncertain-\nties. Consequently, we assumed a uniform, conservative standard\ndeviation of 1,000 K for all normally-distributed priors of effec-\ntive temperature when fitting SDSS spectra of the (candidate)\nblue straggler stars with rvspecfit.\nAnother significant aspect of the spectral fitting with rvspec-\nfit is the set of radial basis functions used to describe the normal-\nising polynomial. A set of ten radial basis functions was used,\nfollowing the procedure described in Cooper et al. (2023) used\nby the MW survey pipeline of the Dark Energy Spectroscopic\nInstrument (DESI-MWS).\nrvspecfit for all our targets outputs a maximum a posteri-\nori estimation of the LOS velocity while also computing higher\nmoments of the projection of the posterior across the velocity\naxis (including standard deviation). The estimates of the uncer-\ntainty of the maximum a posteriori values of Teff and log10(g)\nshow standard deviations of a Gaussian that was used to approx-\nimate the four-dimensional posterior of (effective temperature,\nlog10(g), [Fe/H], [α/Fe]) around the mode. This approximation\nis equivalent to evaluating the Hessian matrix of the posterior at\nthe mode to obtain the covariance matrix of the Gaussian (Bailer-\nJones 2017) as done in rvspecfit.\n2.5. Line-of-sight velocities and assessment of accuracy of\ntheir measurement\nAs our data reduction does not include any heliocentric correc-\ntion and conversion to the Local Standard of Rest, they are in the\nobserver’s reference frame. Heliocentric velocity corrections and\nconversion to the Local Standard of Rest were calculated using\nnoao.rv.rvcorrect in the Image Reduction and Analysis Facility\n(iraf, Tody 1986, 1993; National Optical Astronomy Observato-\nries 1999). All these calculations were carried out using pyraf,\nthat is, a command language for iraf based on python. The cor-\nrections were computed using the coordinates of the stars in Ta-\nble 1 and Table 2, mid-observation times calculated from the data\nin Table 1, and total magnitude of the cartesian Galactic velocity\n(11.1, 12.24, 7.25) km s−1 of the Sun with respect to the Local\nStandard of Rest as found by Schönrich et al. (2010).\nThe main source of error in our heliocentric LOS velocity\nestimates is a potential for bias resulting from the telescope’s\nexposure to flexure under gravity during observation of high air\nmass target stars with the FORS2 instrument. This bias is not\naccounted for in the wavelength solution of the spectra, which\nis derived based on reference spectra of arc lamps obtained with\nthe telescope pointing towards zenith. In order to assess whether\nand how the maximum a posteriori estimates of the heliocen-\ntric LOS velocities (hereafter LOS velocities) are affected, we\nmeasured LOS velocities from the fitting of the spectra of the\nvelocity standard stars listed in Table 2 with rvspecfit and com-\nArticle number, page 7 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nTable 3. Summary of normally-distributed priors of RVSpecFit rvspecfit (Koposov et al. 2011; Koposov 2019) stellar parameters used for the\ninference of the LOS velocities from the VLT/FORS2/600B+22 grism spectra taken in the slit with width=0.4 arcsec of the velocity standard stars\nwith rvspecfit.\nDesignation\nTeff\nlog10 g\n[Fe/H]\n[α/Fe]\nSource [Fe/H]\nSource [α/Fe]\n[K]\n[K]\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\n(9)\n(10)\n(11)\n(12)\n(13)\nBD +24 1843\n5570\n33\n4.17\n0.11\n-0.1\n0.2\n-0.01\n0.0\nGSPS\nGSPS\nGSPS\nGSPS\nBD +31 1781\n4532\n36\n4.37\n0.05\n-0.1\n0.3\n0.03\n0.0\nGSPS\nGSPS\nGSPS\nGSPS\nBD +34 1955\n5235\n36\n3.69\n0.07\n-0.4\n0.3\n0.04\n0.0\nGSPS\nGSPS\nGSPS\nGSPS\nWDS J07277+2420A\n4201\n150\n4.24\n0.20\n-0.2\n1.4\n-0.2\n0.1\nmed\nmax\nGSPS\nGSPS\nBD +26 1647\n5894\n510\n4.89\n2.55\n-0.2\n1.4\n0.07\n0.2\nmed\nmax\nGSPS\nGSPS\nBD +31 1684\n4250\n1500\n1.89\n2.84\n-0.2\n1.4\n0.04\n0.4\nmed\nmax\nmed\nmax\nBD +30 1501\n4540\n33\n2.11\n0.08\n-0.4\n0.3\n0.03\n0.0\nGSPS\nGSPS\nGSPS\nGSPS\nTYC 2461-988-1\n6475\n180\n4.19\n0.29\n-0.2\n1.4\n0.2\n0.4\nGSPS\nGSPS\nGSPS\nGSPS\nBD +36 1823\n6041\n45\n3.98\n0.05\n-0.2\n0.3\n0.06\n0.0\nGSPS\nGSPS\nGSPS\nGSPS\nBD +35 1801\n5972\n66\n4.09\n0.11\n-0.1\n0.3\n0.07\n0.1\nGSPS\nGSPS\nGSPS\nGSPS\nNotes. The mean of the Gaussian priors of the effective temperature (Col. (2)) are the estimates from the Gaia DR3 Gaia General Stellar\nParametriser for Spectra (GSP-Spec) catalogue (Gaia Collaboration et al. 2023; Recio-Blanco et al. 2023) that includes measurements from\nthe Gaia Radial Velocity Spectrometer (Cropper et al. 2018). In Col. (3) the uncertainties of the GSP-Spec estimates of the effective temperature\nwere scaled by the factor 3 to generate a broad Gaussian that mimics to some degree an uniform prior. In the same vein, we apply the same scaling\nfor the other columns that give the standard deviations of the Gaussian priors (Cols. (5), (7), and (9)). Similarly, the data in Cols. (4) and (5)\nwere derived from the GSP-Spec catalogue, using the calibration as recommended in Recio-Blanco et al. (2023) (equation 1 with polynomical\ncoefficients in Recio-Blanco et al. 2023) to correct the bias for their estimates. The means and standard deviations of the broad Gaussian priors\nof [Fe/H] (Cols. (6) and (7)) and [α/Fe] (Cols. (8) and (9)) are based on calibrated values from the GSP-Spec catalogue if available following the\nrecommendations in Recio-Blanco et al. (2023), that is, in case of [M/H] using equation 2 with polynomial coefficients given in second row of\ntable 3 in Recio-Blanco et al. (2023) to calculate [Fe/H] = [Fe/M] + [M/H] and with respect to [α/Fe] using equation 3 with coefficients of the\nfourth order polynomial in table 4 in Recio-Blanco et al. (2023) (second [α/Fe] of table 4). For some of the velocity standard stars, no GSP-Spec\nestimates of [M/H] and/or [α/Fe] were available. For these stars we took the median of all the other means of [Fe/H] and [α/Fe] as the mean of\nthe Gaussian prior and the maximum of the other standard deviation entries regarding the standard deviation of the Gaussian prior. In the last four\ncolumns GSPS is used here to refer to estimates from the GSP-Spec catalogue, ‘med’ indicates that for the entry of the mean of the Gaussian\nprior of [Fe/H] or [α/Fe] we used the median approach as explained above, and ‘max’ labels an entry where we adopted the maximum standard\ndeviation of all Gaussian priors of [Fe/H] or [α/Fe] as also noted above.\npared them to the fiducial values in Table 2 from Soubiran et al.\n(2018). As shown in Fig. 3, the observed LOS velocities of the\nvelocity standard stars here are offset from the data given in the\ncatalogue of Soubiran et al. (2018) on average by 10–25 km s−1.\nOf interest here is the increase in the discrepancy between\nthe estimates of the LOS velocities of the velocity standard stars\nand the fiducial values with decreasing air mass. This result is\nsomewhat counterintuitive, as the expectation would be that with\nrising air mass stronger possible second order residuals would\naffect the wavelength calibration of the spectra more as a result\nof variations caused by telescope flexure under gravity.\nA possible explanation for the behaviour in Fig. 3 described\nabove is that it is a linear trend superimposed on a systematic\noffset of the order of 10–25 km s−1 (mean and standard devia-\ntion of −15.6 km s−1 and 11.7 km s−1, respectively). A 10–25\nkm s−1 offset in this study corroborates earlier findings by Caf-\nfau et al. (2020). Caffau et al. (2020) found that as measured LOS\nvelocities for four stars from data in a similar instrumental setup\nas in our work are compared to reference (fiducial) values they\nare on average offset by 17 km s−1 with a standard deviation =\n15 km s−1. However, other studies suggested that such an effect\ncould be also lower (around 6 km s−1, Deason et al. 2012).\nQuantification of a trend with air mass must be approached\nwith some caution because the strength of the variations of the\ndispersion axis of the spectra against some reference depends\nalso on how the telescope was positioned before the observations\nof the velocity standard stars, that is, how much zenith distance\nit moved when targeting the stars. It is beyond the scope of this\npaper to examine in detail the effect of telescope motion across\nthe sky (between observations) on our velocity measurements.\nWe investigated the relation between our derived LOS ve-\nlocity and the reference value with observing time and S/N but\nfound no clear trend (see Appendix C). Because a velocity stan-\ndard is observed for each programme star, we use for our results\nboth the uncorrected LOS velocity as well as corrected LOS ve-\nlocity by the offset of the velocity standard closest in time to\neach BHB star.\n2.6. Classification of candidate Blue Horizontal Branch stars\nin sample\nWe classify the candidate BHB stars in our sample into bona\nfida BHB stars and other contaminants by comparing the posi-\ntions of the target stars in effective temperature versus log10(g).\nTo establish the relevant parameter space we reference fitting re-\nsults of SDSS DR17 spectra of a set of BHB and (candidate)\nblue straggler stars from the Barbosa et al. (2022) and Xue et al.\n(2008) catalogues through the same method (rvspecfit). A major\nadvantage of using effective temperature and surface gravity in-\nferred from spectral fitting in contrast to utilising the Balmer line\nwidths (see, e. g., Clewley et al. 2002; Xue et al. 2008, 2011) is\nthat it encapsulates all the information from the spectrum instead\nof only individual lines. Barbosa et al. (2022) and Byström et al.\n(2024) identified BHB stars in SEGUE (Yanny et al. 2009) and\nDESI (DESI Collaboration et al. 2016), respectively, in a similar\nway.\nFigure 4 shows reference results versus our sample of target\nstars in a Kiel diagram. We highlight the low number of contami-\nnants in our sample. Of the study population, 21 target stars have\n(exposure-averaged, maximum a posteriori) estimates of effec-\nArticle number, page 8 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nTable 4. Definitions of normally-distributed priors of effective tempera-\nture used for the inference of the LOS velocities from the FORS2 spec-\ntra taken in the slit with width = 1.0 arcsec of the candidate blue hori-\nzontal branch stars with rvspecfit (Koposov et al. 2011; Koposov 2019).\nId\nTeff\n∆Teff\n[K]\n[K]\ncandBHB1\n8423\n562\ncandBHB2\n8376\n842\ncandBHB3\n8140\n594\ncandBHB4\n8361\n1362\ncandBHB5\n8317\n1447\ncandBHB6\n8354\n994\ncandBHB7\n8144\n854\ncandBHB8\n8002\n429\ncandBHB9\n8624\n773\ncandBHB10\n8192\n463\ncandBHB11\n8009\n889\ncandBHB12\n7729\n1129\ncandBHB13\n8119\n401\ncandBHB14\n8006\n975\ncandBHB15\n8030\n655\ncandBHB16\n8502\n421\ncandBHB17\n8817\n440\ncandBHB18\n8420\n856\ncandBHB19\n8072\n676\ncandBHB20\n7878\n281\ncandBHB21\n8140\n704\ncandBHB22\n7821\n627\ncandBHB23\n8567\n1097\ncandBHB24\n9756\n1409\ncandBHB25\n8735\n1372\nNotes. A relation was approximated from set of BHB stars from Bar-\nbosa et al. (2022) that have both PS1 DR2 (Chambers et al. 2016)\ngr photometry and effective temperature values from SEGUE (Ap-\npendix B). In the third column uncertainties of effective temperatures\nresulting from propagation of uncertainties in gPS and rPS and the re-\nlation including quoted residual variance were scaled by the factor 3 to\ngenerate a broad Gaussian that mimics to some degree an uniform prior.\ntive temperature and log10(g) consistent with the trend in Fig. 4\nof spectroscopically classified BHB stars. The results indicate\nthat candBHB6 could be also in the area of the Kiel diagram\nwhere we expect blue straggler stars given its relatively large\nuncertainties.\nTable 5 shows the proportion of different categories of stel-\nlar classification of the target stars according to their positions\nin the two-dimensional space spanned by Teff and log10(g). The\nbona fide BHB stars are indicated by ‘BHB’ in the ‘Class’ col-\numn in Table 5. The contaminants in our sample classified as\nblue straggler stars (candBHB15, candBHB20, and candBHB3\nalthough with less certainty due to proximity to the sequence\nof BHB stars in Fig. 4) are marked with ‘Blue straggler’ in the\nlast column in Table 5. One candidate is probably a white dwarf\n(candBHB25). It has unreliable rvspecfit output from the spectra\ngathered from the CCD data of two exposures at different dates\nbecause they are close to the upper limit of the PHOENIX grid\n(labeled with ‘WD’ and represented with an arrow in Fig. 4).\nLess than a third of those candidate BHB stars from the Thomas\net al. (2018) catalogue (28 per cent or two out of the seven tar-\nget stars listed in Table 1 with PS1 ids) are contaminants. This\nis slightly larger than their estimated contamination fraction of\n24 per cent, but this can be attributed to the low-number statistics\n1.5\n1.6\n1.7\n1.8\n1.9\n2.0\nAir mass\n−40\n−30\n−20\n−10\n0\nLOS velocityobs−LOS velocityref\nh\nkm s−1i\nBD +35 1801\nBD +24 1843\nBD +31 1684\nBD +31 1781\nBD +30 1501\nTYC 2461-988-1\nBD +34 1955\nBD +36 1823\nWDS J07277+2420A\nBD +26 1647\nFig. 3. The results obtained from the analysis of the FORS2 spectra of\nthe velocity standard stars that were collected from the data of the ob-\nservations in connection with the entries in Table 2 compared to the ref-\nerence barycentric LOS velocity values by Soubiran et al. (2018) (also\ngiven in Table 2). We plot the estimates of the difference of heliocen-\ntric/barycentric LOS velocities against the air mass of the star at the\ntime of observation.\nof our sample. For the subset of 18 candidate BHB stars in our\nsample selected from the Starkenburg et al. (2019) catalogue,\nonly 11.1 per cent are flagged as contamination.\nThe findings indicate that the purity of the sample in question\n(80 per cent) corresponds to the anticipated range for the photo-\nmetric selection of candidate BHB stars, as outlined in Starken-\nburg et al. (2019). This is evident in the middle panel of figure\n5 in Starkenburg et al. (2019), which assumes a one-to-one ratio\nof BHB to blue straggler stars in the outer halo.\n2.7. Blue Horizontal Branch stars in Sagittarius spur region\nIn the following, we will present the kinematics of the stars clas-\nsified as BHB stars. Figure 5 presents a map of the Sagittarius\nstream according to a sample of candidate members in sample of\nvariable RR Lyrae stars by Hernitschek et al. (2017) in one pro-\njection across longitude of Sagittarius stream coordinate system\nas defined by Vasiliev et al. (2021) and heliocentric distance. We\nalso show the BHB stars in the Sagittarius spur region in Fig. 5.\nTo estimate the heliocentric distances of the BHB stars, numer-\nous studies of the Galactic stellar halo traced by BHB stars have\nutilised the fourth-order polynomial absolute magnitude relation\nderived from the SDSS DR6 photometry of BHB stars in ten star\nclusters, as presented by An et al. (2008). Unlike Deason et al.\n(2011), Barbosa et al. (2022) argue that\nMgSDSS,0,BHB\n\u0000(g−r)SDSS,0\n\u0001=\n0.178\n0.537+(g−r)SDSS,0\n(1)\nresults in smaller uncertainties for the absolute magnitude of\nBHB stars in Sloan g0 when revisiting the approximation by\nDeason et al. (2011) with more data of BHB stars in star clus-\nters and better constraints on the distances of the star clusters. In\nboth Deason et al. (2011) and Barbosa et al. (2022), the intrinsic\nspread in the absolute magnitude/colour relation is of 0.1 mag.\nArticle number, page 9 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nTable 5. Spectroscopic parameters (effective temperature, log10(g), LOS velocity) of candidate BHB stars obtained with rvspecfit.\nId\nTime of observation\nMAP Teff\nMAP log10(g)\nMAP heliocentric LOS velocity\nClass\nJulian Date-UTC\n[K]\nh\nkm s−1i\ncandBHB1\n2459145.83062068\n8245\n±253\n3.080\n±0.132\n35.2\n±11.5\nBHB\n2459193.75057956\n8611\n±213\n3.005\n±0.104\n9.5\n±13.6\nBHB\ncandBHB2\n2459200.70756284\n8611\n±219\n3.229\n±0.108\n35.4\n±11.2\nBHB\ncandBHB3\n2459177.73637395\n7691\n±121\n3.649\n±0.405\n78.1\n±19.8\nBlue straggler\ncandBHB4\n2459193.79570399\n8361\n±238\n2.947\n±0.104\n−30.8\n±13.6\nBHB\ncandBHB5\n2459196.71811152\n7628\n±85\n2.766\n±0.133\n50.4\n±12.3\nBHB\ncandBHB6\n2459202.72217166\n7957\n±110\n3.284\n±0.403\n54.4\n±16.6\nBHB?\ncandBHB7\n2459197.75325985\n8341\n±221\n3.091\n±0.109\n38.9\n±12.4\nBHB\ncandBHB8\n2459225.66818141\n7737\n±59\n3.007\n±0.195\n27.3\n±9.0\nBHB\ncandBHB9\n2459196.76229864\n9068\n±278\n3.340\n±0.129\n122.3\n±8.6\nBHB\ncandBHB10\n2459192.7836271\n7828\n±82\n2.852\n±0.083\n136.3\n±8.1\nBHB\ncandBHB11\n2459200.77374853\n8975\n±240\n3.255\n±0.128\n31.2\n±8.7\nBHB\ncandBHB12\n2459199.74059709\n7843\n±92\n2.973\n±0.112\n36.7\n±11.7\nBHB\ncandBHB13\n2459176.74878673\n8121\n±121\n2.990\n±0.077\n8.9\n±8.9\nBHB\ncandBHB14\n2459198.76587412\n8553\n±206\n3.267\n±0.136\n71.3\n±12.4\nBHB\ncandBHB15\n2459192.73447173\n8467\n±52\n4.125\n±0.109\n−48.3\n±7.9\nBlue straggler\ncandBHB16\n2459202.76099233\n9007\n±256\n3.216\n±0.134\n42.7\n±12.0\nBHB\ncandBHB17\n2459201.72140548\n8616\n±180\n3.221\n±0.042\n45.0\n±13.2\nBHB\ncandBHB18\n2459224.71022079\n8158\n±98\n3.200\n±0.089\n87.1\n±8.2\nBHB\ncandBHB19\n2459203.73253058\n8104\n±99\n3.226\n±0.108\n16.4\n±9.8\nBHB\ncandBHB20\n2459207.70610055\n7760\n±83\n5.089\n±0.216\n57.2\n±31.0\nBlue straggler\ncandBHB21\n2459177.77718009\n8350\n±159\n3.063\n±0.091\n67.8\n±9.2\nBHB\ncandBHB22\n2459199.8012333\n7513\n±59\n2.855\n±0.270\n53.7\n±11.5\nBHB\ncandBHB23\n2459176.79133185\n8752\n±354\n3.027\n±0.161\n55.1\n±12.4\nBHB\ncandBHB24\n2459196.80650984\n8583\n±262\n3.380\n±0.105\n72.9\n±15.3\nBHB\n2459195.81788969\n8935\n±358\n3.329\n±0.211\n69.9\n±14.2\nBHB\n2459197.8023447\n10415\n±852\n3.873\n±0.367\n75.7\n±15.2\nBHB\ncandBHB25\n2459198.81629641\n11118\n±2\n6.465\n±0.002\n124.3\n±29.1\nWD\n2459225.71684968\n10787\n±nan\n6.456\n±nan\n99.6\n±28.5\nWD\nNotes. A small subset of the returned parameters was chosen because of the expected difficulty in obtaining reliable estimates of [Fe/H], [α/Fe],\nand v sin i from low-resolution optical spectra of hot stars with strong Balmer lines that blend some of the metallicity-sensitive lines (see also\nnoted limitations of rvspecfit in Koposov et al. 2024). ‘MAP’ is used here to refer to the maximum a posteriori estimations of the quantities\nwithin rvspecfit.\nThis spread takes into account the metallicity-dependence of\nthe colour-absolute magnitude relation in case of Deason et al.\n(2011). In contrast, Barbosa et al. (2022) find that Equation 1\ndoes not have any significant metallicity-dependence.\nWe adopt Equation 1 to calculate the heliocentric distances\nof the BHB stars while noting that the output obtained from the\nDeason et al. (2011) polynomial are consistent with the distances\nresulting from Equation 1 within their uncertainties. It is im-\nportant to stress here that not all the stars used here have an\nSDSS photometric measurement, in particular for the stars se-\nlected from the Thomas et al. (2018) catalogue. In that case, the\ncolour in the SDSS photometric system is computed from the\nPS1 measurement using the equation 6 of Thomas et al. (2018).\nTo enable the computation of SDSS g0 −MSDSS g0,BHB, gSDSS,0\nwere approximated with gPS,0. The uncertainties on the distances\nwere computed by adding in quadrature the uncertainties due to\nthe photometric uncertainties in the g and r bands to the intrinsic\nscatter of the colour-absolute magnitude relation. This results in\nuncertainties of typically 5 per cent.\n3. Results\n3.1. Comparison between observations and N-body\nsimulations of stars in the distant part of the Sagittarius\ntidal stream\nWe explore the relationship between heliocentric distance and\n(corrected) LOS velocity for the BHB stars in our sample rela-\ntive to predictions of N-body simulations of the formation and\nevolution of the Sagittarius stream.\n3.1.1. Radial velocity structure of Blue Horizontal Branch\nstars\nFigure 6 examines the radial velocity structure (stars and dia-\nmonds for results that are velocity-corrected and not, respec-\ntively) of the apocenter of the trailing arm and spur feature of\nthe Sagittarius stream as traced by our sample of BHB stars6.\n6 For the purpose of Galactic Standard of Rest LOS velocity calcu-\nlation, we adopted the definition of the Galactocentric coordinate sys-\ntem as also used in Vasiliev et al. (2021) that is the standard in as-\ntropy (Astropy Collaboration et al. 2013, 2018, 2022). This definition\nuses the J2000 International Celestial Reference System coordinates\n(R.A. = 17h45m37s.224, Decl. = −28◦56′10′′.23) of the Galactic centre\nnoted in Reid & Brunthaler (2004), a distance = 8.122 kpc between\nArticle number, page 10 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\n8000\n9000\n10000\n11000\nTeﬀ[K]\n3.0\n3.5\n4.0\n4.5\n5.0\nlog10\n\u0010\ng cm−1 s2\u0011\nBlue straggler stars (Xue+2008)\nBHB stars (Barbosa+2022)\n(Average) estimates of target stars\n20\n15\n6\n3\n25\n24\n23\n22\n21\n20\n19\n18\n17\n16\n15\n14\n13\n12\n11\n10\n9\n8\n7\n6\n5\n4\n3\n2\n1\nFig. 4. The trends identified in one projection of the stellar parameter\nspace for the group of target stars in the spur feature of the Sagittarius\nstream with FORS2 spectra. A large majority of the estimations of effec-\ntive temperature and surface gravity for the target stars from rvspecfit\n(Koposov et al. 2011; Koposov 2019) (open star markers show estimates\nfrom fitting spectra obtained from each exposure for candBHB1 and\ncandBHB24 for which several exposures exist) are in the range expected\nfrom bona fide BHB stars (see circles). A few outliers are marked with\nthe numbers and match better the cross symbols that represent a refer-\nence dataset of blue straggler stars in Xue et al. 2008 sample. Another\noutlier, candBHB25, is a likely white dwarf candidate highlighted just\nwith an arrow because the best-fitting Teff and log10 g for both spectra\nare close to the upper edge of the PHOENIX grid, and are therefore not\nreliable. The grey marker in the upper left corner provides an estimate\nof the average uncertainties of the reference dataset.\nThe constraints on the kinematics of the distant part of the trail-\ning arm of the Sagittarius stream that is traced by our sample of\nBHB stars are compared to the present-day data of stellar par-\nticles in three simulations of the infall of the Sagittarius dwarf\ngalaxy.\nThe three simulations we consider are by Dierickx & Loeb\n(2017, predictions in Fig. 6 are shown with grey points)7 and\nVasiliev et al. (2021, one takes into account the effects of the\nLMC and the other does not). Data of the stellar particles in the\nN-body simulations by Vasiliev et al. (2021) are represented by\norange and dark-greyish points in Fig. 6 for the case of the sim-\nulation without and with the LMC, respectively8. The main dif-\nferences between these simulations are as follows:\nthe Sun and Galactic centre as constrained by GRAVITY Collaboration\net al. (2018), height = 20.8 pc of the Sun above the Galactic mid-plane,\nand (12.9, 245.6, 7.78) km s−1 (Drimmel & Poggio 2018) as the 3D So-\nlar velocity relative to the Galactic centre.\n7 The data was gathered from mdierick.github.io/Sgr_stars_\nkin_data.csv. The LOS velocities of the particles in their simulation\nare already in the Galactic Standard of Rest with a slightly different\ndefinition of the Galactocentric coordinate system.\n8 We use the same procedure for the computation of the LOS velocities\nin the Galactic Standard of Rest for the stellar particles in the Vasiliev\net al. (2021) model as for the BHB stars.\n0°\n45°\n90°\n135°\n180°\n225°\n270°\n315°\n20 40 60 80 100120140160\n153°\n158°\n162°\n166°\n171°\n176°\n180°\n80\n90\n100\n110\n120\n130\n140\n150\n160\n−8\n−6\n−4\n−2\n0\n2\n4\n6\n8\nBSgr [deg]\n1\n2\n4\n5\n6\n7\n8\n9 10 11 12 13 14 16 17 18 19 21 22 23 24\nFig. 5. Sagittarius stream according to a sample of candidate members\nin sample of (candidate) variable RR Lyrae stars by Hernitschek et al.\n(2017) in one projection across longitude of the Sagittarius stream coor-\ndinate system as defined by Vasiliev et al. (2021) (implemented in gala\nPrice-Whelan 2017), and heliocentric distance. For each (candidate) RR\nLyrae we colour-code the marker by the latitude in the same Sagittar-\nius stream coordinate system. The top half of the mapped Sagittarius\nstream at between 135◦and 180◦longitude (see lower panel for enlarged\nplot of this part), includes the BHB stars in our sample plotted with dis-\ntinct colours based on their id (in the label of the color scheme we only\nshow the number at the end of id).\n– no LMC perturbations in Dierickx & Loeb (2017) simula-\ntion.\n– Hernquist (1990) model for gravitational potential of Galac-\ntic bulge with total mass of 1.25×1010 M⊙in Dierickx & Loeb\n(2017) versus a exponentially-truncated, spheroidal power\nArticle number, page 11 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nlaw model with total mass of 1.2×1010 M⊙in Vasiliev et al.\n(2021) for the bulge density.\n– exponentially declining gravitational potential of disk with\ntotal mass of 8.125 × 1010 M⊙in Dierickx & Loeb (2017)\nversus isothermal sheet with exponential radial variation for\nthe disk density and total mass of 5×1010 M⊙in Vasiliev et al.\n(2021).\n– spherical Hernquist (1990) model for gravitational poten-\ntial of Galactic halo with total mass of 1.25 × 1012 M⊙in\nDierickx & Loeb (2017) versus a exponentially-truncated,\nZhao (1996) model with varying flattening and orientation\nin Vasiliev et al. (2021) for halo density.\n– Dierickx & Loeb (2017) adopt the same models assumed to\ndescribe the gravitational potential of the Milky Way for the\nSagittarius progenitor where bulge, disk, and halo have to-\ntal masses of 5.2×108 M⊙, 7.8×108 M⊙, and 1.3×1010 M⊙\nwhile Vasiliev et al. (2021) assume the King model for the\nstellar density of the Sagittarius progenitor and a more ex-\ntended, spherical, cored dark matter (DM) halo of mass of\n3.6×109 M⊙that is gradually tidally disrupted with a mass\nloss described by a piecewise linear function.\nIn Fig. 6 there is a clear trend of decreasing Galactic Stan-\ndard of Rest LOS velocities beyond heliocentric distance D⊙≃\n120 kpc for the data of the final (present-day) snapshot of the Di-\nerickx & Loeb (2017) and Vasiliev et al. (2021) N-body simula-\ntions of the formation and evolution of the Sagittarius stream. To\na lesser extent we see a similar trend in the BHB stars (both the\nestimates of the LOS velocity without and with shifts to correct\nthe systematics outlined in Sect. 2.5 in the left and right panel,\nrespectively). The correlation between heliocentric distance and\nGalactic Standard of Rest LOS velocity for D⊙≳120 kpc is in-\nteresting because these are the stars expected in the spur feature\nof the trailing arm of the Sagittarius stream and the fact that the\nBHB stars trace such a feature qualitatively confirms its exis-\ntence. The models shown in Fig. 6 and also Fardal et al. (2019)9\nhave significant different predictions for the velocity structure of\nthis feature.\nIn both panels of Fig. 6, the trend for the spur feature as\ntraced by the BHB stars follows the models from Vasiliev et al.\n(2021) more closely. Depending on whether the tentative correc-\ntion is applied (right panel), it follows more the Vasiliev et al.\n(2021) model with the LMC. However, we also note that in both\ncases (without and with the correction) the apocentre data points\nfit better with the Vasiliev et al. (2021) model without the LMC.\nIn Fig. 6, we note that the shifts applied to the LOS veloc-\nities of the BHB stars based on the values in Fig. 3 (from the\nleft to the right panel) are not significant compared to the large\nvelocity range that we study. Second order variations in the LOS\nvelocity measurements such as due to the flexure therefore re-\nassuringly do not affect our conclusions. Over half of the BHB\nstars surveyed in our sample could be part of the apocentre of\nthe trailing arm which is visible in Fig. 6 below 120 kpc as the\narc charactertistic of the apocentres where stars turn around and\nhave smaller and smaller absolute LOS velocities. Interestingly,\nthe position of the apocentre of the trailing arm according to our\ndata was observed to be systematically off of any the models\npresented in Fig. 6. In summary, the constrained LOS velocity\nstructure of the apocentre of the trailing arm and the spur be-\nyond it of the Sagittarius stream with our sample of BHB stars is\ninformative to constrain current models of the Sagittarius stream\nand also in turn the Galactic gravitational potential at these dis-\ntances.\n9 The data for this model is not publicly available.\nWe note that Li et al. (2023a) present a set of (candidate) M-\ntype giant stars that also reaches the spur region of the distant\nSagittarius stream trailing arm but with very limited accuracy in\ntheir distances (the uncertainties of the photometric, heliocentric\ndistances ∆D⊙≳30 kpc at D⊙≳70 kpc, hence 3-7 times larger\nthan we find for the BHB stars, see also Appendix D). Our sam-\nple traces this region combining accurate distances and velocity\nspace for the first time. In the next two sections we discuss more\nquantitatively how we can constrain models of the formation and\nevolution of the Sagittarius stream and the shape of the Galactic\ngravitational potential at the radii that our stars cover.\n3.1.2. Distance rescaling of Sagittarius apocentre and spur\nin Vasiliev et al. (2021) simulations\nAs discussed above, we find there is a difference in the mapped\nvelocity structure of the BHB stars in the most distant part of\nthe trailing arm of the Sagittarius stream and predictions from\nthe Dierickx & Loeb (2017) and Vasiliev et al. (2021) mod-\nels (see Fig. 6). Of the two models, the latter resembles the\ntrend expressed by our data in this study more. This model\nis also a bit closer to the observed position of the apocentre\nof the trailing arm of the Sagittarius stream in the 2D projec-\ntion of heliocentric distance and LOS velocity. Nonetheless,\nthis apocentre turn-around seems somewhat offset in distance\nin the model predictions compared to our data points. A pos-\nsible explanation for this might be that the enclosed Galactic\nmass at the apocentre of the trailing arm (here 100 kpc) found\nby Vasiliev et al. (2021) of (5.6 ± 0.4) × 1011 M⊙is lower. In\nconsideration of the fact that the Vasiliev et al. (2021) model\naccurately reproduces the majority of the Sagittarius stream at\ncloser Galactic distances, it is also proposed that the assumed\nouter slope β of the halo density profile by Vasiliev et al. (2021,\nρ∝(R/rscale)−γ (1+(R/rscale)α)(γ−−β)/α exp\n\u0010\n−(R/200 kpc)2\u0011\nand\nR ≡(pq)1/3 p\nX2+(Y/p)2+(Z/q)2 ) is not an accurate description\nof the true potential at these (relatively unconstrained) distances.\nTo investigate how β and in turn the enclosed mass of the\nMW within 100 kpc has to be adapted to match our constraints,\nwe rescale across heliocentric distance the data of the stellar\nparticles associated to the trailing arm region of the Sagittarius\nstream in the presented N-body simulations by Vasiliev et al.\n(2021) without and with the LMC (cf. with Fig. 6). Average\ntracks were generated for all data of the Vasiliev et al. (2021)\nmodels in Fig. 6 (stellar particles at −230 ◦< ΛSgr < −160 ◦in\nfinal, present-day snapshots of the N-body simulations). These\ntracks are shown in Fig. 7, where the top panel points were ob-\ntained by grouping the 500 closest data points together in helio-\ncentric distance and velocity space using K-means clustering as\nimplemented in scikit-learn (Pedregosa et al. 2011) and finding\nthe standard deviations that describe each group/cluster of data\npoints.\nChi-square tests were used to compare the average tracks to\nfour considered cases of some representation of the data in Figs.\n6 and 7 excluding outlier candBHB410. These four cases are:\n– (B22, Heliocentric) with heliocentric distance of BHB stars\nestimated from Equation 1 and LOS velocities of BHB stars\n(data represented in the left panel of Fig. 6).\n10 No significant difference were found between results from these tests\nwith and without the data of candBHB4. Its classification is uncertain\n(see Table 5).\nArticle number, page 12 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\n80\n100\n120\n140\n160\n−100\n0\n100\n200\nLine-of-sight velocity\nh\nkm s−1i\nGalactic Standard of Rest\nTrailing arm region of Sagittarius stream\nDierickx & Loeb 2017\nVasiliev+2021 (without LMC)\nVasiliev+2021 (with LMC)\nLine-of-sight velocity\nNGC 2419\n80\n100\n120\n140\n160\nShifted line-of-sight velocity\n24\n23\n22\n21\n19\n18\n17\n16\n14\n13\n12\n11\n10\n98765421\nHeliocentric distance [kpc]\nFig. 6. Comparison of the observational data on the LOS velocities in the Galactic Standard of Rest of the BHB stars (diamonds and stars) and\npredictions from the Dierickx & Loeb (2017) (lightgreyish points) and Vasiliev et al. (2021) without (darkgreyish points) and with LMC (orange\npoints) models in the same angular range across the stream. Left panel: big diamond markers indicate LOS velocities in Galactic Standard of Rest\nof BHB stars estimated with rvspecfit from the FORS2 spectra. Right panel: stars represent the same velocities with an applied shift as reported in\nFigs. 3 and C.1. The plot shows also the position of globular cluster NGC 2419 (filled circle) in this projection of phase space. The LOS velocity\nof NGC 2419 comes from Vasiliev & Baumgardt (2021) assuming also the right ascension and declination provided in the Vasiliev & Baumgardt\n(2021) catalogue while we use the heliocentric distance of NGC 2419 from Baumgardt & Vasiliev (2021).\n−100\n0\n100\n200 (a)\nTrailing arm region of Sagittarius\nstream\nBefore rescaling\nAverage track (without LMC)\nAverage track (with LMC)\n80\n100\n120\n140\n160\nHeliocentric distance [kpc]\n−100\n0\n100\n200 (b)\nAfter rescaling\nVasiliev+2021 (without LMC)\nVasiliev+2021 (with LMC)\nShifted line-of-sight velocity\n24\n23\n22\n21\n19\n18\n17\n16\n14\n13\n12\n11\n10\n9\n8\n7\n6\n5\n4\n2\n1\nHeliocentric line-of-sight velocity\nh\nkm s−1i\nFig. 7. Rescaling of the average track of stellar particles in heliocentric\ndistance and LOS velocity in final (present-day) snapshots of N-body\nsimulations of Sagittarius stream by Vasiliev et al. (2021) without and\nwith perturbations by the LMC across heliocentric distance. (a) Copy of\nright panel of Fig. 6 except replacing Galactic Standard of Rest by helio-\ncentric LOS velocities, plotting data of BHB stars as shown in the right\npanel of Fig. 6, removing data of the particles in the Dierickx & Loeb\n(2017) model, and adding average tracks of the data of the stellar parti-\ncles in the Vasiliev et al. (2021) N-body simulations. (b) heliocentric 2D\nphase space data of stellar particles of N-body simulations presented in\nVasiliev et al. (2021) after rescaling to match it to the shown constraints\nfrom the BHB stars.\n– (B22, Corrected) with heliocentric distance of BHB stars es-\ntimated from Equation 1 and corrected LOS velocities of\nBHB stars (data represented in the right panel of Fig. 6).\n– (D11, Heliocentric) heliocentric distance of BHB stars esti-\nmated from Deason et al. (2011) relation and LOS velocities\nof BHB stars.\n– (D11, Corrected) with heliocentric distance of BHB stars\nestimated from Deason et al. (2011) relation and corrected\nLOS velocities of BHB stars.\nSubsequently, we sample the natural logarithm of the poste-\nrior of the rescaling factor f given the data that we calculated\nfrom the natural logarithm of a Gaussian likelihood (equivalent\nto approximately χ2) of the difference between the data of the\nBHB stars and the average tracks to find the optimal value of\nf. The uncertainties of the average tracks and observational data\nwere added in quadrature, and we adopt a uniform prior for f\nover 0.1 and 10.0. This sampling across Markov chains with a\nMonte Carlo algorithm and optimisation was achieved with em-\ncee (Foreman-Mackey et al. 2013) using ten walkers and 1,000\nsteps. Table 6 lists the results of the rescaling (median and 16\nand 84 quantiles of sampled posterior distribution of f). We note\nthat none of the rescaling experiments within the group of cases\nincluding the LMC influence (‘E’, ‘F’, ‘G’, and ‘H’) as well as\nwithin the group of cases without the LMC influence (‘A’, ‘B’,\n‘C’, and ‘D’) resulted in differences that were statistically sig-\nnificant. This illustrates again that - considering the main results\npresented in this paper - the possible flexure corrections of the\nradial velocities are not that influential and, moreover, that the\nchoice of distance calibration for the BHB stars does not alter\nthe results significantly. However, as maybe expected, the differ-\nence for f between the two groups (with and without the LMC\nperturbation) is statistically significant. For the remainder of this\nwork, case ‘D’ (B22, Corrected, No) and ‘H’ (B22, Corrected,\nYes) are labeled as our fiducial cases with and without the LMC.\nPanel (b) of Fig. 7 compares the rescaling of the 2D helio-\ncentric phase space (distance, LOS velocity) data of the stellar\nparticles at −230 ◦< ΛSgr < −160 ◦along the Sagittarius stream\nin the present-day snapshots of the N-body simulations without\n( f =1.05+0.02\n−0.02 for fiducial case) and with the LMC (f =1.11+0.02\n−0.02\nfor fiducial case) as performed by Vasiliev et al. (2021) for the\nArticle number, page 13 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nTable 6. Differences between the data of the velocity structure of the\nBHB stars at the apocenter and spur feature of the trailing arm of the\nSagittarius stream to which the data of the final (present-day) snapshots\nof the N-body simulations of the formation and evolution of the Sagit-\ntarius stream in the pre- or absence of the LMC by Vasiliev et al. (2021)\nwere scaled along heliocentric distance to match it.\nLabel\nDistance\nLOS velocity\nLMC\nf\n(1)\n(2)\n(3)\n(4)\n(5)\nA\nD11\nHeliocentric\nNo\n1.04+0.02\n−0.04\nB\nB22\nHeliocentric\nNo\n1.05+0.02\n−0.03\nC\nD11\nCorrected\nNo\n1.03+0.02\n−0.02\nD\nB22\nCorrected\nNo\n1.05+0.02\n−0.02\nE\nD11\nHeliocentric\nYes\n1.12+0.02\n−0.02\nF\nB22\nHeliocentric\nYes\n1.15+0.02\n−0.02\nG\nD11\nCorrected\nYes\n1.10+0.02\n−0.02\nH\nB22\nCorrected\nYes\n1.11+0.02\n−0.02\nNotes. The second column is the abbreviation for the equation that we\nuse to calculate the absolute magnitude in Sloan gSDSS of the sample\nBHB stars and as a result distance modulus and heliocentric distance\nof the stars. Wheras ‘D11’ refers to Deason et al. (2011), ‘B22’ refers\nto Barbosa et al. (2022). (3) abbreviates which LOS velocity of each\nBHB star in the set that we study we consider for the rescaling. Firstly,\nthe term ‘Heliocentric’ refers to the heliocentric LOS velocity without\na shift to correct for systematics as estimated from the velocity standard\nstars (see Fig. 3 or Fig. C.1 and left panel of Fig. 6). Secondly, ‘Cor-\nrected’ refers to the corrected (heliocentric) LOS velocities (see right\npanel of Fig. 6). (4) indicates whether this is the data from the N-body\nsimulation by Vasiliev et al. (2021) with (‘Yes’) or without (‘No’) per-\nturbations by the LMC.\nfiducial cases. The results indicate that the rescaled Vasiliev\net al. (2021) model with the LMC fits the data very well. In-\ndeed, this supports a number of previous works that demonstrate\nthe effects of the LMC on the MW and the overdensities in it\n(e. g., Erkal et al. 2019; Garavito-Camargo et al. 2019; Shipp\net al. 2019; Petersen & Peñarrubia 2021; Vasiliev et al. 2021;\nGaravito-Camargo et al. 2021; Lilleengen et al. 2023; Koposov\net al. 2023; Chandra et al. 2024; Byström et al. 2024)\n3.2. Milky Way mass profile\nGiven the similarities between the rescaled Vasiliev et al. (2021)\nmodel with the LMC and the observed Sagittarius stream, it is\npossible to use this model to re-evaluate the MW’s mass within\nthe Sagittarius apocentre radius (≃100 kpc). In this section, we\npresent a first analysis in this direction to provide an estimate of\nthe (magnitude of) change in mass implied, but we note that a\nfull and detailed re-modeling is beyond the scope of this work.\nThe rescaling factor derived in subsubsection 3.1.2 is com-\nputed such that the heliocentric LOS velocities in the model\nmatch the observed, heliocentric velocities at the rescaled Galac-\ntocentric positions11. In this analysis, we exclusively utilise the\nLOS velocity. Note that proper motions are not considered be-\ncause they are not available for all stars.\nIn our approach, we assume that the Sagittarius stream model\nfrom Vasiliev et al. (2021) provides a good representation of the\ntotal energy distribution at every position along the stream. How-\n11 While the rescaling results presented in subsubsection 3.1.2 are\nacross heliocentric distances, we use here the effect of the rescaling\nof the heliocentric distances on the Galactocentric positions and fur-\nthermore note that rescaling in Galactocentric distances instead yields\nconsistent results compared to the entries in Table 6\never, as shown in Fig. 7, we have seen that the model needs to be\nstretched to match the distance and velocity distribution of the\ndata. Therefore, we stretch the Galactocentric coordinates of the\nSagittarius stream model of Vasiliev et al. (2021) (with the LMC)\naccording to the rescaling factor found in subsubsection 3.1.2,\nbut leave the 3D velocities of the particles unchanged. Adjusting\nthe particles in the Vasiliev et al. (2021) simulation according\nto this rescaling factor provides direct access to the gravitational\npotential (Φ) of each star given that E ≡Φ + 0.5 V2, where E is\nthe total energy and V the Galactocentric velocity of the star.\nConsequently, we adjust the MW DM halo profile such that\nthe gravitational potential with the new profile, ΦMW,new(R), of\na star at the rescaled Galactocentric position R′ matches the po-\ntential of the Vasiliev et al. (2021) model, ΦMW,Vasiliev+2021, at\nGalactocentric position R before rescaling.\nMoreover, given that the original (non-rescaled) Vasiliev\net al. (2021) model accurately reproduces most of the Sagit-\ntarius stream at shorter Galactic distances, we only adjust the\nouter slope of the MW DM halo. Specifically, we assume that\nthe triaxiality, twisting, and baryonic distribution remain un-\nchanged compared to the MW model proposed by Vasiliev et al.\n(2021)12. In particular, we note that we thereby assume that the\ngravitational perturbation of the LMC remains unchanged at the\nrescaled position. This assumption is not entirely correct, as for\na same fixed mass of the LMC as found by Vasiliev et al. (2021),\nits perturbation on the apocentre of the Sagittarius stream in the\nrescaled model should be less important than at the original po-\nsitions of the Vasiliev et al. (2021) model, given that the rescaled\nposition are further away from the LMC than the original posi-\ntion. At the same time, the mass ratio of the LMC and MW will\nbe more comparable with a lower mass MW. Properly account-\ning for these perturbations would require rerunning the simula-\ntion of Vasiliev et al. (2021), as the LMC directly exerts a grav-\nitational force on the Sagittarius stream but also modifies the\nshape of the DM halo (Garavito-Camargo et al. 2019; Petersen\n& Peñarrubia 2021). However, we stress this will be a secondary\neffect due to the relatively small changes in distance compared\nto the original model.\nWe impose the boundary condition on the gravitional po-\ntential that the gravitational potential at the Galactocentric loca-\ntion of the Sagittarius dwarf spheroidal galaxy remnant, RSgr =\n(17.9, 2.6, −6.6) kpc, should be the same between the original\nVasiliev et al. (2021) model and the adjusted DM profile:\nΦMW,new\n\u0010\nRSgr\n\u0011\n=ΦMW,Vasiliev+2021\n\u0010\nRSgr\n\u0011\n.\nThus, revising the enclosed Galactic mass within 100 kpc\nand by extension exploring the changes in the outer slope β of the\nMW DM halo involves minimising the following least-squares\nfunction:\nχ2 =\nN\nX\ni=1\n\u0002ΦMW,new\n\u0000R′\ni\n\u0001−ΦMW,Vasiliev+2021 (Ri)−norm\u00032 ,\n(2)\nwhere R′i represents the rescaled, Galactocentric positions along\nthe stream and norm accounts for normalisation adjustments.\nThe subscript i represents the N particles in the distant trail-\ning arm region of the Sagittarius stream\n\u0010\n−230 ◦<ΛSgr <−160 ◦\u0011\nfrom the Vasiliev et al. (2021) simulation. In the region of the\nSagittarius stream with the data of the BHB stars, the positional,\nGalactocentric vector (Xi, Yi, Zi) is represented by Ri for the ith\n12 Our adjustment of the MW DM profile incorporates uncertainties in\nthese parameters.\nArticle number, page 14 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nparticle. ΦMW,new is calculated using the stretched, Galactocen-\ntric X′\ni, Y′\ni , and Z′\ni positions found from the rescaling described in\nSect. 3.1 to yield the potential in R′\ni =\n\u0010\nX′\ni, Y′\ni , Z′\ni\n\u0011\nfor the ith par-\nticle. All potentials are computed with the Action-based Galaxy\nModelling Architecture code (agama, Vasiliev 2018, 2019a) ver-\nsion 1.0.\nWe employ a Monte Carlo technique to sample from the un-\nknown distribution of the enclosed MW mass within 100 kpc\nand β by repeating the minimisation of Equation 2 to find the\noptimal value of the mass and β with 1,000 realisations of f\nand thus R′\ni and the other parameters of the halo density pro-\nfile model by Vasiliev et al. (2021). In the Monte Carlo method,\nfor each realisation we vary the rescaling factor f = 1.11±0.02,\nscale radius rscale, inner slope γ, and transition steepness α of\nthe halo density profile model by Vasiliev et al. (2021) (Eugene\nVasiliev, private communication) and the other parameters of the\nmodel by Vasiliev et al. (2021) that quantify the triaxiality and\ntwisting of the halo (see figure 14 in Vasiliev et al. 2021) within\ntheir uncertainties. We use split normal distributions to approxi-\nmate the distributions of the parameters of the halo density pro-\nfile model by Vasiliev et al. (2021). We do not take into account\nhere that some of the parameters of the Vasiliev et al. (2021)\nmodel are correlated with β, but treat them as independent. The\nmethodology employed here is relatively straightforward and, it\nmust be acknowledged, somewhat simplistic. It is assumed that\nthe energy distribution for the Sagittarius progenitor provided\nby the Vasiliev et al. (2021) model is reliable, given that it al-\nready closely matches the majority of the stream. However, it is\nour contention that it can provide a satisfactory initial approx-\nimation of the local potential before undertaking further, more\ncomprehensive simulations in future work.\nThe results of the sampling show that β = 2.47+0.26\n−0.21 can lead\nto a position of the apocentre of the trailing arm of the Sagit-\ntarius stream in the Vasiliev et al. (2021) that is in line with our\nconstraints based on the BHB stars. This value of β is slightly\nhigher, but within the uncertainties of the β value reported by\nVasiliev et al. (2021, β=2.43+0.16\n−0.13; Eugene Vasiliev, private com-\nmunication). Consequently, the enclosed mass at the apocentre\nof the trailing arm (here ∼100 kpc) by Vasiliev et al. (2021) is\nlowered to (5.3±0.4)×1011 M⊙, again consistent within the un-\ncertainties of Vasiliev et al. (2021) who report M(< 100 kpc) =\n(5.6±0.4)×1011 M⊙.\nFigure 8 shows our new estimate of the enclosed mass of the\nMilky Way within 100 kpc in comparison to other estimates of\nthe enclosed mass at various radii between 10 kpc and 270 kpc.\nOur results are in line with the general trend of the literature.\n3.3. NGC 2419\nFinally, we use our new dataset to investigate more closely\nthe proposed connection between the trailing arm of Sagittar-\nius stream and the globular cluster NGC 2419 (e. g., Irwin 1999;\nNewberg et al. 2003; Ruhland et al. 2011; Belokurov et al. 2014;\nSohn et al. 2018; Massari et al. 2019; Bellazzini et al. 2020;\nDavies et al. 2024; Chen & Gnedin 2024; Rostami Shirazi et al.\n2024). The (mean) position of NGC 2419 in Fig. 6 was found\nto be consistent with the approaching group of BHB stars at the\napocentre of the trailing arm.\nAdditionally, a subsample of BHB stars with estimates\nof proper motion in Gaia DR3 was prepared. Here, we\nadapt the procedure suggested by Fabricius et al. (2021) and\ndeselect spurious astrometric solutions in Gaia DR3 with\nIPD_GOF_HARMONIC_AMPLITUDE ≥0.1. This excludes\n50\n100\n150\n200\n250\nRadius [kpc]\n0.5\n1.0\n1.5\nEnclosed mass [M⊙]\n×1012\n32\n33\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12 13\n14\n1516\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\nFig. 8. Adapted from Bobylev & Baykova (2023) showing estimates of\nenclosed mass of Milky Way at different radii together with our con-\nstraints with the (blue) star symbol at 100 kpc. As in the diagram in\nBobylev & Baykova (2023) that we adapted here, with the exceptions\nof 32 and 33 that are new estimates by Ibata et al. (2024) and are high-\nlighted here, the annotated numbers for each data point correspond to 1–\nKüpper et al. (2015), 2–Malhan & Ibata (2019), 3–Prudil et al. (2022),\n4–Posti & Helmi (2019), 5–Williams et al. (2017), 6–Ablimit & Zhao\n(2017), 7–Williams & Evans (2015), 8–Xue et al. (2008), 9–Gnedin\net al. (2010), 10–Gibbons et al. (2014), 11–Vasiliev et al. (2021), 12–\nShen et al. (2022), 13–Correa Magnus & Vasiliev (2022), 14–Eadie &\nJuri´c (2019), 15–McMillan (2017), 16–Vasiliev (2019b), 17–Battaglia\net al. (2005), 18–Eadie et al. (2017), 19–Eadie & Harris (2016), 20–\nDeason et al. (2012), 21–Ablimit et al. (2020), 22–Bird et al. (2022)\n(from data of K-type giants), 23–Zhou et al. (2023), 24–Bhattacharjee\net al. (2014), 25–Wang et al. (2022), 26–Bird et al. (2022) (from data\nof BHB stars), 27–Sun et al. (2023), 28–Bajkova & Bobylev (2016),\n29–Huang et al. (2016), 30–Eadie et al. (2015), 31–Patel et al. (2018),\n32–Ibata et al. (2024) (within 50 kpc), and 33–Ibata et al. (2024) (esti-\nmate of virial mass within 200 kpc).\ncandBHB8 and candBHB16. Fig. 9 shows that the remaining\ntargets with Gaia DR3 proper motions across right ascension\nand declination (Gaia Collaboration et al. 2023) tentatively agree\nwith data for NGC 2419 by Vasiliev & Baumgardt (2021) as\nwell as with model predictions by Dierickx & Loeb (2017) and\nVasiliev et al. (2021). CandBHB9, candBHB10, candBHB11,\ncandBHB13, candBHB17, candBHB19, and candBHB21 could\ntherefore be linked to the apocentre of the trailing arm of the\nSagittarius stream and its extension, the spur feature, across\nphase space.\n4. Conclusion\nThe objective of this study is twofold: to evaluate the effective-\nness of selecting candidate BHB stars in the outer halo beyond\n∼80 kpc and to constrain the kinematics of the apocentre and\nspur feature of the sparsely studied outer regions of the trailing\narm of the Sagittarius stream. Our ESO/VLFT/FORS2 pilot pro-\ngramme confirmed that 20 out of the 25 candidate BHB stars\nchosen from the samples by Thomas et al. (2018) and Starken-\nburg et al. (2019) are true BHB stars based on the spectroscopi-\ncally estimated effective temperatures and surface gravities from\nfitting with rvspecfit (Fig. 4). As a consequence, we can con-\nfidently push the photometric selection techniques developed in\nThomas et al. (2018) and Starkenburg et al. (2019) to stars fainter\nthan the limits of Gaia (G ≃21 mag, Gaia Collaboration et al.\n2023). The present study has been one of the first attempts to\nexamine the performance of photometric selections of candi-\nArticle number, page 15 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\n−4\n−2\n0\n2\nR.A. proper motion\nh\nmas.yr−1i\n−2\n−1\n0\n1\n2\nDecl. proper motion\nh\nmas.yr−1i\nDierickx & Loeb 2017\nVasiliev+2021 (w/o LMC)\nVasiliev+2021 (w/ LMC)\nBlue horizontal branch stars\nNGC 2419\n21\n19\n17\n13\n11\n10\n9\nFig. 9. Proper motion of the identified BHB stars (stars) in compari-\nson to the simulation data by Dierickx & Loeb (2017) (point markers)\nand Vasiliev et al. (2021) (square and plus markers showing rescaled\nproper motions by 1/ f where f is the same factor used to rescale the\nheliocentric distances of the simulation data, that is, 1.11±0.02, and we\nnote that the uncertainties in the rescaled proper motions resulting from\nthe uncertainty in f are smaller than the symbol size) and the globular\ncluster NGC 2419 (filled circle). We show the predicted motion along\nright ascension and declination in the simulations across the same an-\ngular range of the stream as the BHB strars cover. The proper motion\nestimate of NGC 2419 correspond to the values provided by Vasiliev &\nBaumgardt (2021).\ndate BHB stars at these distances with a dedicated, spectroscopic\nfollow-up program.\nDespite its exploratory nature, this study offers also some in-\nsight into the behaviour on the VLT/FORS2 instrument and the\n600B+22 grism we used when observing stars at high air mass\n(above 1.5) where second order effects in the mapping from pixel\nto wavelength space across the detector are expected due to tele-\nscope flexure under gravity. Although the current study is based\non a small sample of candidate BHB and velocity standard stars\nto assess and quantify the above-mentioned variation(s), the find-\nings from adopting the same methodology to estimate heliocen-\ntric LOS velocities of the velocity standard stars as employed\nfor the target stars suggest systematic offsets from reference val-\nues on the order of at least 10–25 km s−1. These expected and\ncorrected systematics in the LOS velocity measurements of the\ntarget stars in our observational setup made no significant differ-\nence to the overall conclusions that we draw from the available\nphase space data of the BHB stars (Sects. 2.5 and 6)\nThe FORS2 spectra of the confirmed BHB stars provide fur-\nther observational constraints on the current Milky Way and\nSagittarius stream models (e. g., Dierickx & Loeb 2017; Fardal\net al. 2019; Vasiliev et al. 2021), using the selected data on the\nspur feature of the Sagittarius debris. The velocity structure of\nthe apocenter of the trailing arm of the Sagittarius stream, at\nheliocentric distances of D⊙≃100 kpc, as traced by the iden-\ntified BHB stars, is offset from the model predictions by Dier-\nickx & Loeb (2017) and Vasiliev et al. (2021, Fig. 6). The in-\nvestigation of heliocentric distance and LOS velocity in the N-\nbody simulation of the disruption of the Sagittarius dwarf galaxy\nin the presence of the LMC by Vasiliev et al. (2021) in com-\nparison to the data of the BHB stars has shown that the ob-\nservations can be described well by the model predictions by\nVasiliev et al. (2021), including the spur feature, if the helio-\ncentric distances of the simulation data are rescaled by a fac-\ntor f = 1.11+0.02\n−0.02. This would correspond to a change in the\nouter slope of β = 2.47+0.26\n−0.21\n\u0010\nversus 2.43+0.16\n−0.13\n\u0011\nand in turn leads\nto a refined estimate of the enclosed Milky Way mass within the\napocentre of the trailing arm slightly lower than the estimate by\nVasiliev et al. (2021) at (5.3±0.4)×1011 M⊙.\nA limitation of this study is that the use of BHB stars as\ntracers of the metal-poor Milky Way halo does not permit the\ninvestigation of metallicities. This is due to the difficulty of con-\nstraining the metallicities of hot stars in general through opti-\ncal spectroscopy, and in particular in the cases of low spectral\nresolution, due to the blending of metallicity-sensitive lines by\nstrong Balmer lines. Future studies combining different stellar\ntracers where also estimates of metallicity can be obtained, will\nshed more light on not only the kinematics but also chemistry of\ndistant substructure in the Galactic halo.\nThe current data highlight the importance of providing a\nmore detailed view of the outer Galactic halo through various\nstandard candle stars that also serve as good kinematic tracers.\nThe findings of this research provide first insights on the kine-\nmatics of the one of the most distant extensions of the Sagittarius\nstream currently known, the spur feature. We expect that the in-\nsights gained from this study will provide helpful constraints to\nmodellers of the Sagittarius stream and the Galactic potential.\nAcknowledgements. We want to express our gratitude to Eugene Vasiliev for\nproviding us the uncertainties of the scale radius, inner and outer slope, and\ntransition steepness of the fiducial model of the halo density profile in Vasiliev\net al. (2021). MB would also like to thank Sergey E. Koposov for their help\nin understanding and using some of the new features in rvspecfit (Koposov\net al. 2011; Koposov 2019). MB would like to extend his thanks to Samuel\nRusterucci for their help in proofreading the paper draft. MB and ES ac-\nknowledge funding through VIDI grant “Pushing Galactic Archaeology to its\nlimits\" (with project number VI.Vidi.193.093) which is funded by the Dutch\nResearch Council (NWO). This research has been partially funded from a\nSpinoza award by NWO (SPI 78-411). GFT and EFA acknowledge support\nfrom the Agencia Estatal de Investigación del Ministerio de Ciencia en Inno-\nvación (AEI-MICIN) and the European Regional Development Fund (ERDF)\nunder grant number PID2020-118778GB-I00/10.13039/501100011033 and the\nAEI under grant number CEX2019-000920-S. EFA acknowledges support from\nHORIZON TMA MSCA Postdoctoral Fellowships Project TEMPOS, number\n101066193, call HORIZON-MSCA-2021-PF-01, by the European Research Ex-\necutive Agency. AB acknowledges the Edinburgh Doctoral College Scholarship\nthat funded her work. GEM acknowledges financial support from Natural Sci-\nences and Engineering Research Council of Canada (NSERC) through grant\nRGPIN-2022-04794, and from an Arts & Sciences Postdoctoral Fellowship at\nthe University of Toronto. This research has made use of the VizieR catalogue\naccess tool, CDS, Strasbourg, France (DOI : 10.26093/cds/vizier). The origi-\nnal description of the VizieR service was published in 2000, A&AS 143, 23.\nThis work is based on data obtained as part of the Canada-France Imaging Sur-\nvey, a CFHT large programme of the National Research Council of Canada and\nthe French Centre National de la Recherche Scientifique. Based on observa-\ntions obtained with MegaPrime/MegaCam, a joint project of CFHT and CEA\nSaclay, at the Canada-France-Hawaii Telescope (CFHT) which is operated by\nthe National Research Council (NRC) of Canada, the Institut National des Sci-\nence de l’Univers (INSU) of the Centre National de la Recherche Scientifique\n(CNRS) of France, and the University of Hawaii. This research was supported\nby the International Space Science Institute (ISSI) in Bern, through ISSI Inter-\nnational Team project 540 (The Early Milky Way). We additionally made use\nof adjusttext, version 1.2.0 (Flyamer et al. 2024), Action-based Galaxy Mod-\nelling Architecture code (agama, Vasiliev 2018, 2019a), astroquery (Ginsburg\net al. 2019), astropy (Astropy Collaboration et al. 2013, 2018, 2022), dustmaps\n(Green 2018), emcee (Foreman-Mackey et al. 2013), esoreflex (Freudling et al.\n2013), gala (Price-Whelan 2017), Image Reduction and Analysis Facility (iraf,\nTody 1986, 1993; National Optical Astronomy Observatories 1999), matplotlib\n(Hunter 2007), numpy (Harris et al. 2020), rvspecfit (Koposov et al. 2011; Ko-\nposov 2019), scikit-learn (Pedregosa et al. 2011), scipy (Virtanen et al. 2020),\nseaborn (Waskom 2021), and vaex (Breddels & Veljanoski 2018). We would like\nto acknowledge the use of DeepL Write, a artificial intelligence writing assistant\ndeveloped by DeepL, which was employed to enhance the readability and style\nof this article.\nArticle number, page 16 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nReferences\nAbdurro’uf, Accetta, K., Aerts, C., et al. 2022, ApJS, 259, 35\nAblimit, I. & Zhao, G. 2017, ApJ, 846, 10\nAblimit, I., Zhao, G., Flynn, C., & Bird, S. A. 2020, ApJ, 895, L12\nAlmeida, A., Anderson, S. F., Argudo-Fernández, M., et al. 2023, Astrophysical\nJournal, Supplement, 267, 44\nAmarante, J. A. S., Koposov, S. E., & Laporte, C. F. P. 2024, arXiv e-prints,\narXiv:2404.09825\nAn, D., Johnson, J. A., Clem, J. L., et al. 2008, ApJS, 179, 326\nAnderson, J. 2020, Very Large Telescope, European Southern Observatory\nAntoja, T., Ramos, P., Mateu, C., et al. 2020, A&A, 635, L3\nAstropy Collaboration, Price-Whelan, A. M., Lim, P. L., et al. 2022, ApJ, 935,\n167\nAstropy Collaboration, Price-Whelan, A. M., Sip˝ocz, B. M., et al. 2018, AJ, 156,\n123\nAstropy Collaboration, Robitaille, T. P., Tollerud, E. J., et al. 2013, A&A, 558,\nA33\nBailer-Jones, C. A. L. 2017, Practical Bayesian Inference, 142–144\nBailer-Jones, C. A. L., Rybizki, J., Fouesneau, M., Demleitner, M., & Andrae,\nR. 2021, AJ, 161, 147\nBajkova, A. T. & Bobylev, V. V. 2016, Astronomy Letters, 42, 567\nBarbosa, F. O., Santucci, R. M., Rossi, S., et al. 2022, ApJ, 940, 30\nBattaglia, G., Helmi, A., Morrison, H., et al. 2005, MNRAS, 364, 433\nBaumgardt, H. & Vasiliev, E. 2021, MNRAS, 505, 5957\nBellazzini, M., Ibata, R., Malhan, K., et al. 2020, A&A, 636, A107\nBelokurov, V., Koposov, S. E., Evans, N. W., et al. 2014, MNRAS, 437, 116\nBelokurov, V., Zucker, D. B., Evans, N. W., et al. 2006, ApJ, 642, L137\nBhattacharjee, P., Chaudhury, S., & Kundu, S. 2014, ApJ, 785, 63\nBird, S. A., Xue, X.-X., Liu, C., et al. 2022, MNRAS, 516, 731\nBobylev, V. V. & Baykova, A. T. 2023, Astronomy Reports, 67, 812\nBreddels, M. A. & Veljanoski, J. 2018, A&A, 618, A13\nByström, A., Koposov, S. E., Lilleengen, S., et al. 2024, arXiv e-prints,\narXiv:2410.09149\nCaffau, E., Bonifacio, P., Sbordone, L., et al. 2020, MNRAS, 493, 4677\nChambers, K. C., Magnier, E. A., Metcalfe, N., et al. 2016, arXiv e-prints,\narXiv:1612.05560\nChandra,\nV.,\nNaidu,\nR.\nP.,\nConroy,\nC.,\net\nal.\n2024,\narXiv\ne-prints,\narXiv:2406.01676\nChen, Y. & Gnedin, O. Y. 2024, The Open Journal of Astrophysics, 7, 23\nClementini, G., Ripepi, V., Garofalo, A., et al. 2023, A&A, 674, A18\nClewley, L., Warren, S. J., Hewett, P. C., et al. 2002, MNRAS, 337, 87\nCooper, A. P., Koposov, S. E., Allende Prieto, C., et al. 2023, ApJ, 947, 37\nCorrea Magnus, L. & Vasiliev, E. 2022, MNRAS, 511, 2610\nCreevey, O. L., Sordo, R., Pailler, F., et al. 2023, A&A, 674, A26\nCropper, M., Katz, D., Sartoretti, P., et al. 2018, A&A, 616, A5\nCui, X.-Q., Zhao, Y.-H., Chu, Y.-Q., et al. 2012, Research in Astronomy and\nAstrophysics, 12, 1197\nDavies, E. Y., Belokurov, V., Monty, S., & Evans, N. W. 2024, MNRAS, 529,\nL73\nDeason, A. J., Belokurov, V., & Evans, N. W. 2011, MNRAS, 416, 2903\nDeason, A. J., Belokurov, V., Evans, N. W., et al. 2012, MNRAS, 425, 2840\nDeason, A. J., Belokurov, V., & Koposov, S. E. 2018, ApJ, 852, 118\nDeason, A. J., Belokurov, V., Koposov, S. E., & Rockosi, C. M. 2014, ApJ, 787,\n30\nDESI Collaboration, Aghamousa, A., Aguilar, J., et al. 2016, arXiv e-prints,\narXiv:1611.00036\nDierickx, M. I. P. & Loeb, A. 2017, ApJ, 836, 92\nDrimmel, R. & Poggio, E. 2018, Research Notes of the American Astronomical\nSociety, 2, 210\nEadie, G. & Juri´c, M. 2019, ApJ, 875, 159\nEadie, G. M. & Harris, W. E. 2016, ApJ, 829, 108\nEadie, G. M., Harris, W. E., & Widrow, L. M. 2015, ApJ, 806, 54\nEadie, G. M., Springford, A., & Harris, W. E. 2017, ApJ, 835, 167\nErkal, D., Belokurov, V., Laporte, C. F. P., et al. 2019, MNRAS, 487, 2685\nEuclid Collaboration, Mellier, Y., Abdurro’uf, et al. 2024, arXiv e-prints,\narXiv:2405.13491\nFabricius, C., Luri, X., Arenou, F., et al. 2021, A&A, 649, A5\nFantin, N. J., Côté, P., McConnachie, A. W., et al. 2019, ApJ, 887, 148\nFardal, M. A., van der Marel, R. P., Law, D. R., et al. 2019, MNRAS, 483, 4724\nFlyamer, I., Xue, Z., Colin, et al. 2024, Phlya/adjustText: 1.2.0\nForeman-Mackey, D., Hogg, D. W., Lang, D., & Goodman, J. 2013, PASP, 125,\n306\nFreudling, W., Romaniello, M., Bramich, D. M., et al. 2013, A&A, 559, A96\nFukushima, T., Chiba, M., Homma, D., et al. 2018, PASJ, 70, 69\nFukushima, T., Chiba, M., Tanaka, M., et al. 2019, PASJ, 71, 72\nFukushima,\nT.,\nChiba,\nM.,\nTanaka,\nM.,\net\nal.\n2024,\narXiv\ne-prints,\narXiv:2406.11923\nGaia Collaboration, Brown, A. G. A., Vallenari, A., et al. 2021, A&A, 649, A1\nGaia Collaboration, Vallenari, A., Brown, A. G. A., et al. 2023, A&A, 674, A1\nGaravito-Camargo, N., Besla, G., Laporte, C. F. P., et al. 2019, ApJ, 884, 51\nGaravito-Camargo, N., Besla, G., Laporte, C. F. P., et al. 2021, ApJ, 919, 109\nGibbons, S. L. J., Belokurov, V., & Evans, N. W. 2014, MNRAS, 445, 3788\nGinsburg, A., Sip˝ocz, B. M., Brasseur, C. E., et al. 2019, AJ, 157, 98\nGnedin, O. Y., Brown, W. R., Geller, M. J., & Kenyon, S. J. 2010, ApJ, 720,\nL108\nGRAVITY Collaboration, Abuter, R., Amorim, A., et al. 2018, A&A, 615, L15\nGreen, G. 2018, The Journal of Open Source Software, 3, 695\nHarris, C. R., Millman, K. J., van der Walt, S. J., et al. 2020, Nature, 585, 357\nHelmi, A. 2004, ApJ, 610, L97\nHelmi, A. & White, S. D. M. 2001, MNRAS, 323, 529\nHernitschek, N., Sesar, B., Rix, H.-W., et al. 2017, ApJ, 850, 96\nHernquist, L. 1990, ApJ, 356, 359\nHuang, Y., Liu, X. W., Yuan, H. B., et al. 2016, MNRAS, 463, 2623\nHunter, J. D. 2007, Computing in Science & Engineering, 9, 90\nHusser, T. O., Wende-von Berg, S., Dreizler, S., et al. 2013, A&A, 553, A6\nIbata, R., Bellazzini, M., Thomas, G., et al. 2020, ApJ, 891, L19\nIbata, R., Irwin, M., Lewis, G. F., & Stolte, A. 2001, ApJ, 547, L133\nIbata, R., Malhan, K., Tenachi, W., et al. 2024, ApJ, 967, 89\nIbata, R. A., Gilmore, G., & Irwin, M. J. 1994, Nature, 370, 194\nIbata, R. A. & Lewis, G. F. 1998, ApJ, 500, 575\nIbata, R. A., McConnachie, A., Cuillandre, J.-C., et al. 2017, ApJ, 848, 128\nIbata, R. A., Wyse, R. F. G., Gilmore, G., Irwin, M. J., & Suntzeff, N. B. 1997,\nAJ, 113, 634\nIrwin, M. 1999, in IAU Symposium, Vol. 192, The Stellar Content of Local\nGroup Galaxies, ed. P. Whitelock & R. Cannon, 409\nJensen, J., Thomas, G., McConnachie, A. W., et al. 2021, MNRAS, 507, 1923\nJi, A. P., Koposov, S. E., Li, T. S., et al. 2021, ApJ, 921, 32\nJohnston, K. V., Law, D. R., & Majewski, S. R. 2005, ApJ, 619, 800\nKoposov, S. E. 2019, RVSpecFit: Radial velocity and stellar atmospheric param-\neter fitting, Astrophysics Source Code Library, record ascl:1907.013\nKoposov, S. E., Belokurov, V., Evans, N. W., et al. 2012, ApJ, 750, 80\nKoposov, S. E., Erkal, D., Li, T. S., et al. 2023, MNRAS, 521, 4936\nKoposov, S. E., Gilmore, G., Walker, M. G., et al. 2011, ApJ, 736, 146\nKoposov, S. E., Prieto, C. A., Cooper, A. P., et al. 2024, MNRAS[2407.06280]\nKüpper, A. H. W., Balbinot, E., Bonaca, A., et al. 2015, ApJ, 803, 80\nLaw, D. R. & Majewski, S. R. 2010, ApJ, 714, 229\nLee, Y. S., Beers, T. C., Sivarani, T., et al. 2008a, AJ, 136, 2022\nLee, Y. S., Beers, T. C., Sivarani, T., et al. 2008b, AJ, 136, 2050\nLenz, D. D., Newberg, J., Rosner, R., Richards, G. T., & Stoughton, C. 1998,\nApJS, 119, 121\nLi, J., Long, L., Zhong, J., et al. 2023a, ApJS, 266, 4\nLi, T. S., Koposov, S. E., Zucker, D. B., et al. 2019, MNRAS, 490, 3508\nLi, X.-Y., Huang, Y., Liu, G.-C., Beers, T. C., & Zhang, H.-W. 2023b, ApJ, 944,\n88\nLilleengen, S., Petersen, M. S., Erkal, D., et al. 2023, MNRAS, 518, 774\nMagnier, E. A., Schlafly, E. F., Finkbeiner, D. P., et al. 2020, ApJS, 251, 6\nMajewski, S. R., Skrutskie, M. F., Weinberg, M. D., & Ostheimer, J. C. 2003,\nApJ, 599, 1082\nMalhan, K. & Ibata, R. A. 2019, MNRAS, 486, 2995\nMartin, N. F., Starkenburg, E., Yuan, Z., et al. 2024, Astronomy & Astrophysics,\n692, A115\nMassari, D., Koppelman, H. H., & Helmi, A. 2019, A&A, 630, L4\nMcMillan, P. J. 2017, MNRAS, 465, 76\nMuraveva, T., Giannetti, A., Clementini, G., Garofalo, A., & Monti, L. 2024,\narXiv e-prints, arXiv:2407.05815\nNaidu, R. P., Conroy, C., Bonaca, A., et al. 2020, ApJ, 901, 48\nNational Optical Astronomy Observatories. 1999, IRAF: Image Reduction and\nAnalysis Facility, Astrophysics Source Code Library, record ascl:9911.002\nNewberg, H. J., Yanny, B., Grebel, E. K., et al. 2003, ApJ, 596, L191\nOria, P.-A., Ibata, R., Ramos, P., Famaey, B., & Errani, R. 2022, ApJ, 932, L14\nPatel, E., Besla, G., Mandel, K., & Sohn, S. T. 2018, ApJ, 857, 78\nPedregosa, F., Varoquaux, G., Gramfort, A., et al. 2011, Journal of Machine\nLearning Research, 12, 2825\nPetersen, M. S. & Peñarrubia, J. 2021, Nature Astronomy, 5, 251\nPosti, L. & Helmi, A. 2019, A&A, 621, A56\nPrice-Whelan, A. M. 2017, The Journal of Open Source Software, 2\nPrudil, Z., Koch-Hansen, A. J., Lemasle, B., et al. 2022, A&A, 664, A148\nPrugniel, P. & Soubiran, C. 2001, A&A, 369, 1048\nRamos, P., Antoja, T., Yuan, Z., et al. 2022, A&A, 666, A64\nRamos, P., Mateu, C., Antoja, T., et al. 2020, A&A, 638, A104\nRead, J. I. & Erkal, D. 2019, MNRAS, 487, 5799\nRecio-Blanco, A., de Laverny, P., Palicio, P. A., et al. 2023, A&A, 674, A29\nReid, M. J. & Brunthaler, A. 2004, ApJ, 616, 872\nRostami Shirazi, A., Khalaj, P., & Haghi, H. 2024, MNRAS, 531, 2563\nRuhland, C., Bell, E. F., Rix, H.-W., & Xue, X.-X. 2011, ApJ, 731, 119\nSchlafly, E. F. & Finkbeiner, D. P. 2011, ApJ, 737, 103\nSchlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500, 525\nSchönrich, R., Binney, J., & Dehnen, W. 2010, MNRAS, 403, 1829\nArticle number, page 17 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\nSesar, B., Hernitschek, N., Dierickx, M. I. P., Fardal, M. A., & Rix, H.-W. 2017a,\nApJ, 844, L4\nSesar, B., Hernitschek, N., Mitrovi´c, S., et al. 2017b, AJ, 153, 204\nShen, J., Eadie, G. M., Murray, N., et al. 2022, ApJ, 925, 1\nShipp, N., Li, T. S., Pace, A. B., et al. 2019, ApJ, 885, 3\nSkrutskie, M. F., Cutri, R. M., Stiening, R., et al. 2006, AJ, 131, 1163\nSohn, S. T., Watkins, L. L., Fardal, M. A., et al. 2018, ApJ, 862, 52\nSoubiran, C., Jasniewicz, G., Chemin, L., et al. 2013, A&A, 552, A64\nSoubiran, C., Jasniewicz, G., Chemin, L., et al. 2018, A&A, 616, A7\nSouthworth, J., Gänsicke, B. T., Marsh, T. R., et al. 2006, MNRAS, 373, 687\nStarkenburg, E., Martin, N., Youakim, K., et al. 2017, MNRAS, 471, 2587\nStarkenburg, E., Youakim, K., Martin, N., et al. 2019, MNRAS, 490, 5757\nSun, G., Wang, Y., Liu, C., et al. 2023, Research in Astronomy and Astrophysics,\n23, 015013\nThomas, G. F., Famaey, B., Ibata, R., Lüghausen, F., & Kroupa, P. 2017, A&A,\n603, A65\nThomas, G. F., Jensen, J., McConnachie, A., et al. 2020, ApJ, 902, 89\nThomas, G. F., Laporte, C. F. P., McConnachie, A. W., et al. 2019, MNRAS, 483,\n3119\nThomas, G. F., McConnachie, A. W., Ibata, R. A., et al. 2018, MNRAS, 481,\n5223\nTody, D. 1986, in Society of Photo-Optical Instrumentation Engineers (SPIE)\nConference Series, Vol. 627, Instrumentation in astronomy VI, ed. D. L.\nCrawford, 733\nTody, D. 1993, in Astronomical Society of the Pacific Conference Series, Vol. 52,\nAstronomical Data Analysis Software and Systems II, ed. R. J. Hanisch,\nR. J. V. Brissenden, & J. Barnes, 173\nVasiliev, E. 2018, AGAMA: Action-based galaxy modeling framework, Astro-\nphysics Source Code Library, record ascl:1805.008\nVasiliev, E. 2019a, MNRAS, 482, 1525\nVasiliev, E. 2019b, MNRAS, 484, 2832\nVasiliev, E. & Baumgardt, H. 2021, MNRAS, 505, 5978\nVasiliev, E., Belokurov, V., & Erkal, D. 2021, MNRAS, 501, 2279\nVera-Ciro, C. & Helmi, A. 2013, ApJ, 773, L4\nVickers, J. J., Grebel, E. K., & Huxor, A. P. 2012, AJ, 143, 86\nVickers, J. J., Li, Z.-Y., Smith, M. C., & Shen, J. 2021, ApJ, 912, 32\nVirtanen, P., Gommers, R., Oliphant, T. E., et al. 2020, Nature Methods, 17, 261\nVivas, A. K., Zinn, R., & Gallart, C. 2005, AJ, 129, 189\nWang, J., Hammer, F., & Yang, Y. 2022, MNRAS, 510, 2242\nWaskom, M. L. 2021, Journal of Open Source Software, 6, 3021\nWilliams, A. A., Belokurov, V., Casey, A. R., & Evans, N. W. 2017, MNRAS,\n468, 2359\nWilliams, A. A. & Evans, N. W. 2015, MNRAS, 454, 698\nXue, X.-X., Rix, H.-W., Yanny, B., et al. 2011, ApJ, 738, 79\nXue, X. X., Rix, H. W., Zhao, G., et al. 2008, ApJ, 684, 1143\nYanny, B., Newberg, H. J., Kent, S., et al. 2000, ApJ, 540, 825\nYanny, B., Rockosi, C., Newberg, H. J., et al. 2009, AJ, 137, 4377\nYork, D. G., Adelman, J., Anderson, John E., J., et al. 2000, AJ, 120, 1579\nYu, F., Li, T. S., Speagle, J. S., et al. 2024, arXiv e-prints, arXiv:2402.00104\nZhao, H. 1996, MNRAS, 278, 488\nZhou, Y., Li, X., Huang, Y., & Zhang, H. 2023, ApJ, 946, 73\nArticle number, page 18 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nAppendix A: Reduction and preparation of\nobserved and synthetic data\nThe systematic process of extracting the spectra from the\ntwo-dimensional data recorded by the MIT detector on the\nVLT/FORS2 instrument consists of four elements or compo-\nnents: (1) a basic correction for the artifacts and ‘fingerprints’\nof the two-dimensional chip data, including bias level, flat field\nresponse, bad pixels, and slit illumination based on calibration\ndata gathered at daytime (bias frames, flat fields) (2) a two-\ndimensional mapping (along the slit axis) of the dispersion axis\nto wavelengths with measured lines of known wavelength in arc-\nlamps at daytime and at zenith, (3) a flux calibration and instru-\nment response correction from a response curve estimated from\na measured spectrum in a similar setup as the science observa-\ntions of a flux standard star (usually within ±3 days of the obser-\nvations of the science targets) with known continuum behaviour\nand fluxes, and (4) tracing the science spectrum along the slit in\nthe chip data while adding together the measured pixel values at\neach mapped column within a defined aperture and subtracting\nthe median sky value outside of the aperture along each CCD\ncolumn. The calibration of the two-dimensional wavelength so-\nlution for the FORS2 observations with the 600B+22 grism in-\ncluded fitting a polynomial of fourth order with residuals typ-\nically of the order of 0.25 Å with a few outlier pixels at up to\n1.00 Å, ensuring a wavelength calibration accuracy within typi-\ncally 0.25 Å across the entire detector, allowing for an accurate\nrepresentation of the spectral dispersion across the detector.\nWith respect to the behaviour of the spectral resolution\nacross the detector for the 2D data taken with the slit with width\nof 1.0 arcsec (candidate BHB stars) and 0.4 arcsec (velocity stan-\ndard stars), the version of the FORS2 pipeline within the esore-\nflex that we employed, also provides an estimate of the average\nresolving power across the detector as measured from lines in\nthe spectra of the arc-lamps across the dispersion axis for each\nwavelength pixel. From Fig. A.1 we can see that a line provides\na sufficient description of the trends of the mean resolving power\nacross the detector for each wavelength bin for both datasets and\nalso various observation times together as we do not see any sig-\nnificant discrepancy in the trend between observation times (dif-\nferent markers in Fig. A.1). Utilising a χ2-minimisation using\nnumpy.polyfit (Harris et al. 2020), we found the lines that best fit\nthe observed trends in Fig. A.1 to be\nR=826+0.161 Å−1×λ\n(A.1)\nfor slit width=0.4 arcsec (left half of Fig. A.1) and\nR=293+0.119 Å−1×λ\n(A.2)\nas a function of wavelength λ in Å for slit width = 1.0 arcsec\n(right half of Fig. A.1).\nFor the first observation of candBHB1 listed in Table 1 some\ncalibration data–such as a normalised flat-field image in connec-\ntion with the observations of a standard star to calibrate the flux\nof the spectrum of candBHB1–were missing and we were there-\nfore not able to run the full data reduction and calibration of\nthis observation with the pipeline. However, the first spectrum\nof candBHB1 was automatically reduced and calibrated by the\nESO Science Data Quality Group in a very similar setup as we\nadopted using the FORS2 pipeline 5.6.4 and we have adopted\ntheir results for this observation.\nRegarding the synthetic spectra that we use to model the\nFORS2 spectra with rvspecfit, for the first instrumental setup\nconnected to the spectra of the candidate BHB stars the syn-\nthetic stellar spectra of the PHOENIX library are re-binned to the\ndispersion axis of the FORS2 spectra between 3,900.94 Å and\n5,989.18 Å (the wavelengths of the first and last wavelength bin\nafter 3,900 Å and before 5,990 Å respectively, that we consider\nto be the reliable range of the spectra) with a linear dispersion=\n1.32 Å and the spectral resolution was degraded from the initial\nR = 100000 to Equation A.2. All wavelengths are measured in\nair in this setup.\nLikewise, the library of synthetic stellar spectra that are used\nto fit the spectra of the velocity standard stars are prepared in\nthe same way as the spectra of the candidate BHB stars with\nlower resolution except we have to adopt the synthetic spectra in\na higher spectral resolution that behaves as Equation A.1.\nFinally, the third grid of prepared synthetic stellar spectra\nthat we use for the SDSS spectra have a linear dispersion of\n1 Å across 3,500–9,500 Å and have a uniform resolving power\nof 2,000 across the dispersion axis (wavelengths are in vacuum).\nFor all three sets of synthetic spectra we peform an initial\ninterpolation to produce a finer grid by using 0.2 dex as step size\nfor both [Fe/H] and [α/Fe] while preserving the 0.5 dex sampling\nin log10(g) and non-unform sampling in effective temperature.\nSimilar interpolations have been used in the past in studies that\nalso employ rvspecfit (e. g., Li et al. 2019; Ji et al. 2021; Cooper\net al. 2023). After the first interpolation, the second interpola-\ntion is only performed during the fitting stage for each likelihood\nevaluation (cf. with comments in Li et al. 2019).\nAppendix B: Pan-STARRS1 (g−r)0–effective\ntemperature relation of (candidate) Blue\nHorizontal Branch stars\nGaussian priors of effective temperature were selected for the\nposterior calculation given the spectra of the candidate BHB\nstars in the sample. For the estimation of effective temperature\nof each candidate BHB star in the sample, a relation between\nPS1 (g−r)0 and effective temperature for the BHB stars in the\nBarbosa et al. (2022) sample (probability of being BHB star of\n100 per cent) was derived. We adopt PS1 DR2 mean forced pho-\ntometry (Chambers et al. 2016). Estimates of effective tempera-\nture from Sloan Extension of Galactic Understanding and Explo-\nration (SEGUE) Stellar Parameter Pipeline (Lee et al. 2008a,b)\nbased on SEGUE data (Yanny et al. 2009) of BHB stars were\nchosen because data on these estimates are already included in\nthe Barbosa et al. (2022) catalogue. An orthogonal distance re-\ngression was used to find the best-fitting linear relation between\nPS1 (g−r)0 and effective temperature for the BHB stars in the\nset released by Barbosa et al. (2022) and also allow to take into\naccount uncertainties for both quantities in fitting. For the fit-\nting we used the scipy.odr package (Virtanen et al. 2020). The\nresults of the correlational analysis are summarised in Fig. B.1.\nIn Fig. B.1 there is a clear trend of decreasing effective tem-\nperature with increasing PS1 (g−r)0 that can be described by\nTeff = −(5349±54) K×PS1 (g−r)0 +(7504±8) K and residual\nvariance of the order of 5 K (line in Fig. B.1).\nAppendix C: Comparison of line-of-sight velocities\nof velocity standard stars\nOur comparison of the maximum a posteriori estimates of the\nheliocentric LOS velocities of the velocity standard stars can be\nseen in Table 2 from fitting the optical low-resolution spectra\nArticle number, page 19 of 21\n\nA&A proofs: manuscript no. eso_programs_p106_21l8run1and2_paper_v_arxiv\n4000\n4500\n5000\n5500\n500\n1000\n1500\n2000\n2500\n3000\nAverage R across detector\nSlit width 0.4 arcsec\nLinear ﬁt\n4000\n4500\n5000\n5500\nSlit width 1.0 arcsec\nObservation time in JD-UTC\n2459225.9\n2459199.9\n2459203.2\n2459203.9\n2459196.9\n2459224.9\n2459176.9\n2459195.9\n2459201.9\n2459178.1\n2459200.9\n2459192.9\n2459197.9\n2459198.9\n2459193.9\n2459208.0\nObservation time in JD-UTC\n2459225.9\n2459199.9\n2459203.2\n2459203.9\n2459196.9\n2459224.9\n2459176.9\n2459195.9\n2459201.9\n2459178.1\n2459200.9\n2459192.9\n2459197.9\n2459198.9\n2459193.9\n2459208.0\nWavelength\nh ˚A\ni\nFig. A.1. VLT/FORS2/600B+22 grism resolving power trends across detector for gathered data of arc-lamps at different observation times for the\ntwo used slit configurations.\n−0.3\n−0.2\n−0.1\n0.0\n0.1\nPan-STARRS1 (g−r)0 [AB mag]\n7500\n8000\n8500\n9000\nEﬀective temperature [K]\nBHB stars (Barbosa+2022)\nLine ﬁt\nFig. B.1. Correlation of (g−r)PS,0 and effective temperature among BHB\nstars in the Barbosa et al. (2022) sample (probability of being BHB star\nof 100 per cent)\ntaken with the FORS2 instrument using the 600B+22 grism in a\n0.4 arcsec wide slit with rvspecfit and reference values by Soubi-\nran et al. (2018). Further analysis suggests a slight drop of the\ndifference with higher median signal-to-noise ratio of the spec-\ntra between 3,900Å and 5,990Å (considered the reliable range of\nthe spectra) in the upper panel of Fig. C.1 and no evidence of any\nrelational association between the LOS velocity difference and\nmid-observation time (lower panel of Fig. C.1). Overall, these\nresults indicate that it is sufficient to investigate this comparison\nas a function of air mass under which the stars were observed as\nwe do in Sect. 2.5.\nAppendix D: Sample of candidate M-type giant\nstars\nA sample of (candidate) M-type giants identified by using\n822,752 low-resolution spectra from LAMOST DR9 (Cui et al.\n2012) that cover the spur of the Sagittarius stream (Li et al.\n2023a). Li et al. (2023a) present a catalogue of their (candidate)\nM-type giants. (Li et al. 2023a) reported 183 candidate members\nof the Sagittarius stream.\nIn order to compile their catalogue of (variable) RR Lyrae\nstars in the Sagittarius stream, Hernitschek et al. (2017) consider\nall RRab stars identified in Sesar et al. (2017b) to be part of the\nSagittarius stream if they are within nine degrees of the Sagit-\ntarius stream orbital plane. We have adopted the same criteria\n30\n40\n50\n60\nMedian of signal-to-noise ratio\n−40\n−30\n−20\n−10\n0\nBD +35 1801\nBD +24 1843\nBD +31 1684\nBD +31 1781\nBD +30 1501\nTYC 2461-988-1\nBD +34 1955\nBD +36 1823\nWDS J07277+2420A\nBD +26 1647\n2.45921\n2.45922\n2.45923\n2.45924\n2.45925\nJulian day at mid-observation-UTC\n×106\n−40\n−30\n−20\n−10\n0\nLOS velocityobs−LOS velocityref\nh\nkm s−1i\nFig. C.1. The results obtained from the analysis of the FORS2 spectra\nof the velocity standard stars can be compared to the reference LOS\nvelocity values by Soubiran et al. (2018). Times of mid-observations of\nthe spectra are shown in the abscissa of the second panel.\nfor the selection of candidate Sagittarius M-type giant stars in\nthe Li et al. (2023a) catalogue as we for the selection of RR\nLyrae in Fig. 5. The positions of all stars in the Li et al. (2023a)\ncatalogue on the Sagittarius stream orbital plane, as defined in\nArticle number, page 20 of 21\n\nM. Bayer et al.: Kinematics of the distant spur feature of the Sagittarius stream traced by Blue Horizontal Branch stars\nVasiliev et al. (2021), were calculated using the gala (Price-\nWhelan 2017) software. Quantitatively, the Hernitschek et al.\n(2017) selection criterion can be expressed as\n\f\f\fBSgr\n\f\f\f < 9◦where\nBSgr is the latitude of the Vasiliev et al. (2021) definition of the\nSagittarius stream coordinate system.\nSeveral M-giants are observed in the region of the sky of the\nspur region and consistent with its distance range. However, the\ncatalogue of Li et al. (2023a) provides no uncertainties of their\nphotometric distances. Their distances are estimated from a em-\npirical Two Micron All Sky Survey (2MASS, Skrutskie et al.\n2006) colour (J −K)0-absolute magnitude MJ0 relation (equa-\ntion 3 in Li et al. 2023a) fitted with a subset of the total sample\nof (candidate) M-type giants closer than 4 kpc and Gaia early\nDR3 inverted relative parallax uncertainties (Gaia Collaboration\net al. 2021) larger than 5 in the Bailer-Jones et al. (2021) cata-\nlogue. However, in their figure 5, Li et al. (2023a) examine the\nextent to which the calculated M2MASS J0 can be trusted and find\na spread of the relation of 0.64 dex. This residual scatter of 0.64\nwill be presumably the largest component in the uncertainty of\nthe distance modulus in 2MASS J that they use to compute the\nphotometric heliocentric distance of the (candidate) M-type gi-\nants in the catalogue.\nAn uncertainty of 0.64 dex would translate to a photometric\n∆D⊙of at least 30 kpc for stars at a distance of ≳70 kpc as we\nhave in our sample. Therefore, we choose not to use these stars\nfor our purposes.\nArticle number, page 21 of 21\n",
  "metadata": {
    "source_path": "papers/arxiv/A_Pristine-UNIONS_view_on_the_Galaxy_Kinematics_of_the_distant_spur\n__feature_of_the_Sagittarius_stream_traced_by_Blue_Horizontal_Branch_stars_8bef26916e4b1ad8.pdf",
    "content_hash": "8bef26916e4b1ad8dd69f805fa03e524de2e427df79771a1efa72950ed5ceda6",
    "arxiv_id": null,
    "title": "A_Pristine-UNIONS_view_on_the_Galaxy_Kinematics_of_the_distant_spur\n__feature_of_the_Sagittarius_stream_traced_by_Blue_Horizontal_Branch_stars_8bef26916e4b1ad8",
    "author": "",
    "creation_date": "D:20250225030059Z",
    "published": "2025-02-25T03:00:59",
    "pages": 21,
    "size": 2822179,
    "file_mtime": 1740470162.5536137
  }
}