{
  "text": "International Journal of Scientific Research and Management (IJSRM)  \n||Volume||13||Issue||02||Pages||1936-1943||2025||  \n \nWebsite: https://ijsrm.net ISSN (e): 2321-3418 \nDOI: 10.18535/ijsrm/v13i02.ec01 \n \nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1936 \nUtilizing Social Media Analytics to Detect Trends in Saudi Arabia’s \nEvolving Market \nKanwal Aalijah \nSchool of Electrical Engineering and Computer Science (SEECS), H-12 Campus, Islamabad, Pakistan \nNational University of Science and Technology, NUST Islamabad, Pakistan  \n \nAbstract \nSaudi Arabia' faced a swift economic growth and societal transformation under Vision 2030. This offers a \nunique opportunity to track emerging trends in the region, which will ultimately pave the way for new \nbusiness and investment possibilities. This paper explores how AI and social media analytics can identify \nand track trends across sectors such as construction, food and beverage, tourism, technology, and \nentertainment thereby helping the businesses make informed decisions. By leveraging a tailored AI-driven \nmethodology, we analyzed millions of social media posts each month, classifying discussions and \ncalculating scores to track the trends. The approach not only uncovered the emerging trends but also \nshows diminishing trends. Our methodology is able to predict the emergence and growth of trends by \nutilizing social media data. This approach has potential for adaptation in other regions. Ultimately, our \nfindings highlight how ongoing, AI- powered trend analysis can enable more effective, data- informed \nbusiness and development strategies in an increasingly dynamic environment. \n \nKeywords : Social Media Analytics, AI-Driven Trend Analysis, Saudi Arabia Market Trends, Machine \nLearning in Market Research \n \nIntroduction \nThe Kingdom of Saudi Arabia is experiencing a rapid change from a vision 2030 perspective and this calls \nfor an assessment of the regional market trends at different points in time. One of the objectives of vision \n2030 is to further foster economic diversification by reducing oil revenues and building new economies in \nconstruction and tourism. Moreover, the vision also expands up to the IT and communication sector, sports, \nentertainment and food & beverage [1]. Traditionally market surveys or interviews were used to assess the \ntrends. The traditional methodologies are static and, therefore, fail to capture trends and shifts in consumer \nminds and expectations [2]. Due to the active involvement of millions of users, social networks have turned \ninto a great source of data, that is capable of shedding light on the state of the market [3][4]. AI methods \nhave now made it possible to perform content analysis in depth and real-time. The results from these \nmethodologies can keep the businesses, investors, and policymakers informed of the changing dynamics in \nthe market business environments [5]. \nBy using Natural Language Processing (NLP) models and methodologies, vast amounts of unstructured \nsocial media data can be interpreted [5]. These methodologies can be deployed in Saudi Arabia where new \nsocio-economic initiatives are changing some of the industries, for example, tourism, ICT, and \nentertainment. This type of market analysis allows public and private organizations to apply NLP and \nunsupervised clustering algorithms [2] to social media in a way that is able to continuously monitor and \nanticipate shifting marketplace dynamics. AI methodology proposed in this paper can provide sector specific \nanalysis to stake holders and to understand the market trends at large. The analysis can help the institutions \nto make the right decisions. For this study data was collected from social media and NLP models such as \nBERT, HDBSCAN and Forecasting models were used to analyze the trends and to generate patterns. This \nframework can be extended to other regions as well, where the policy makers are studying the effects of new \npolicies on the sentiment and perception of general public. This kind of research can prove to be a valuable \nresource for understanding and capitalizing on economic, social, and technological shifts. \nLiterature Review \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1937 \n𝑖= \nTraditional market research methods are now considered inadequate to cope with rapid changes in the \ndynamics of modern market. They are lagging behind the bilateral dynamics and volatility in the markets; \nespecially in the case of Saudi Arabia [2]. Traditional market research methodologies fail as they are unable \nto keep up with changes in consumer thoughts or sentiments in the high growth regions which are \nundergoing drastic socio-economic changes. With the help of AI, trends can now be analyzed efficiently in \nreal- time. This can be done through the data collected from social media networks [4]. The data collected \nfrom social media can be fed in to machine learning models which can identify patterns by clustering the \ndata and insights can be generated [6]. Advances in NLP especially in LLMs has now made it possible to \nunderstand the changing market and consumer dynamics [7]. Since the region is transforming hence \nconsumer behaviors bound to change, hence it is essential for Saudi Arabia to monitor trends. Most of the \ndata in KSA is generated in Arabic language. Applying models such as BERT [8] and AraBERT [9] has \nbeen shown to analyze modern Arabic unstructured text with greater accuracy [10]. \n \nAI-based analytics are being used for trend analysis focusing on evolving customer habits and shifts in \nvarious sectors and industries[11]. Just like other countries, even in Saudi Arabia, social media serves as the \nbase line platform for public discourse. It serves as a tool to provide insights into sector- specific trends such \nas in tourism, construction, and food & beverage industry [12]. Data generated through social media \nplatforms can be fed in to machine learning models to generate insights and predictions. Models like Latent \nDirichlet allocation and BERTopic are generally use to understand the context and organize the unstructured \ndata [2]. Deeper understanding of consumer sentiment can be obtained by using new and advance deep \nlearning models such multimodal sentiment analysis [13]. These models are able to incorporate text and \nvisual content both. This will ultimately lead to a deeper understanding of consumer sentiment. It will be \nvery beneficial for the decision makers, if they have the ability to continuously monitor and analyze trends \nover time. \nThere is a dire need of an AI methodology, that can bridge the gap made by traditional research methods. \nThis methodology should be robust enough to track the sentiment, emotions of people towards an initiative \nor a problem under consideration. In this paper we propose a machine learning frame work that takes \nadvantages of various NLP models to generate insights, track sentiment thereby helping the business and \npolicy makers to better understand the evolving KSA socio economic market. \n \nMethodology \nA. Data Collection \nData was sourced from major social media platforms, including X, TikTok, Instagram, and Facebook. These \nclustering these embeddings using a class-based TF-IDF (c- TF-IDF) [17] approach. Once the topics were \nidentified we clustered the common topics together using HDBSCAN (Hierarchical Density-Based Spatial \nClustering of Applications with Noise) [18] for clustering, as it does not require pre-specifying the number \nof clusters, allowing the data to naturally reveal topic groupings. \nOnce the overall topics in the entire dataset were identified, we assigned topics to each post. \nAfter that we segmented the dataset into three time periods—2014-2017, 2018-2020, and 2021-202. \nD. Trend Popularity and growth trajectory metrics \n \nIn order to understand perception of public towards a trend, we consolidated the engagement (likes, shares, \nand comments) and sentiment metrics and proposed a formula that tracks the current popularity of a trend. \nBy using this metric we were able to measure a trend’s relevance and potential for growth in upcoming years \n[11]. \nplatforms were selected for their popularity and high engagement in Saudi Arabia. This enabled us to \ncapture real- time public sentiment and sector-specific discussions. We collected over 30 million posts, \ncomments, and videos from \nwhere: \n 𝑃𝑃𝑡 = ∑𝑁 1 𝑆𝑖 X 𝐸  (1) \n2014 to 2024. The posts that had geo location set as KSA or they had certain hashtags like #saudi etc. were \nconsidered relevant and others were discarded. The engagement data such as likes, saves, shares, comments \netc. was also maintained. \nData preprocessing involved several steps: removing noise (URLs, emojis), normalizing text (standardizing \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1938 \nArabic script), tokenizing text, filtering stop words, and applying stemming and lemmatization to handle \nArabic morphology. Additionally, n-grams (bigrams and trigrams) were generated to capture context and \ncommon phrases within the short social media posts. \n \nB. Sentiment Anaysis \nSocial media data in Saudi market is mostly generated in Arabic language. Moreover, Saudi Arabic has \nvarious dialects which makes sentiment analysis difficult. These dialects, along with informal language and \nslang, often deviate from Modern Standard Arabic, adding complexity to language processing tasks. To \naddress this, we used AraBERT [9], a BERT [8] based models. AraBERT was used as it specialized for \nArabic, BERT was used to handle other languages. The reason for using BERT is it effectively handles \ndialectal variations and colloquial expressions commonly found in social media [10], and has been bench \nmarked against many traditional models and methodologies [9]. \nAraBERT Model was fine-tuned on a dataset of regional Arabic language with training split into 80% for \ntraining, 10% for validation, and 10% for testing. Cross-entropy loss [14] and the Adam optimizer [15] were \nused during fine-tuning to improve model performance while preventing overfitting. \n \nC. Topic modeling and clustering \nIn our research, we utilized BERTopic [16],which is a cutting-edge topic modeling technique that employs \nBERT embeddings [16] to analyze topics from a dataset. It captures the semantic nuances of the text, \nproviding a sophisticated understanding of underlying topics. The process involves transforming the dataset \ninto BERT embeddings, followed by 𝑆𝑖 is the sentiment score for each post i \n𝐸𝑖 is the engagement level (sum of likes, shares,comments) \n𝑁 is the total number of posts in the given month \n \nE. Predict trend growth \nTo predict the growth of a trend for upcoming years, we used Prophet Model [19]. It is a simple model, that \nhandles seasonality and trend shift with great accuracy. Moreover, the model has been benchmarked against \nARIMA, LSTM and it was proven that Prophet model handles seasonality well [19]. Hence it was our ideal \nchoice, given the nature of the study. \nResults \nIn this section we are going to present the results that are obtained by following above methodology. \nData collection and pre-processing \nOur dataset included over 30 million social media posts from X, Instagram, and Facebook, collected \nbetween 2014 and 2024 as show in Table I. These platforms were chosen for their widespread use and \nengagement in Saudi Arabia. After various pre-processing steps, the collected data was divided in to year \nbuckets. Reason of these buckets was to understand the shift of trends before the launch of Vision 2030 and \nafter the launch of Vision 2030. \n \nTable I. : Collected data \n \nTime \nRange \nNo. of posts \n2016-\n2017 \n3 million \n2018- \n2020 \n9 million \n2021-\n2024 \n17 million \n \nSentiment Analysis \nTo analyze sentiment in our dataset, we first separated the posts into Arabic and non-Arabic texts. For the \nArabic posts, we used AraBERT. For non-Arabic posts, we applied a standard BERT model that supports \nmultiple languages, including English. Both models classify the sentiment of each post as positive, neutral, \nor negative. Fig 1 shows the \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1939 \nsentiment data was then visualized to show the proportion of positive, neutral, and negative sentiments, \nweighted by the number of posts. \n \nFig. 1. Sentiment Distribution of the posts \n \nFig. 2. Number of posts collected for each time range \n \nIdentification and clustering of Trends \nThe BERTopic model uncovered a variety of topics in the dataset. The initial topics can be seen in the Fig. \n2. It only a subset of the topics that were initially identified. \n \nFig. 3.  A snapshot of identified topics \n \nFig. 4. A snapshot of identified topics per year \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1940 \nThe topics were then clustered to determine the optimal number of topics that best represent the dataset. Fig \n3 shows the final topics. Some of the irrelevant topics were discarded along with their posts as well. For \ninstance, the final topic ‘Sustainability Initiatives” emerged from discussions on renewable energy, electric \nvehicle infrastructure etc. This clustering method enabled the simplification of complex community \ndiscussions into clear, actionable topics. \nEach post was assigned a topic. In certain cases, more than one topic was also assigned to a post. Fig 4 \nshows, the topics diversification by time bucket. After assigning topics to the posts, their engagement levels \nwere studies along with the sentiment. \n \nFig. 5. Sentiment vs Engagment vs Topics \n \nFig 5 shows a drop in engagement trends for oil dependency topic. The percentage of negative sentiment for \nthis topic is also quite high. This shows clearly, as per Vision 2030, KSA has started to move away from Oil \ndependency and we can see it is also evident from the collected data, hence that shows public is also steering \nin the similar direction along with the leaders. Digital transformation show notable high engagement, it was \nalso seen in Fig 4 that as compared with other topics, Digital Transformation grew in the 2021-2024 period \nand the engagement shows the similar pattern. Traditional Economic Model also showed a significant \ndecrease in the more recent years, also indicating the shift away from oil in Saudi Arabia’s development \nstrategy. \n \nFig. 6. Trend Popularity \n \nTrend Popularity \nIn order to predict the emerging trends, we used the data from the historical periods we first calculated Trend \npopularity values using the equation (1). Fig 5 shows the calculated trend popularity for each topic and \nplotting it against time. \nThe trend popularity values obtained, were then used to predict the growth of trend in upcoming year. We \nused Prophet forecasting model to handle the prediction. The model calculates the relationship between the \nyears and the post volumes, engagement etc. then predicts the value for upcoming years onwards based on \nthat trend. This model uses the post volumes in the previous periods to predict the post volume for the next \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1941 \nperiod (2024-2027). \nFig 6 shows the Emerging Trends predicted. The dots actually shows where the trend will reach in the \nupcoming year. It can be observed in the figure, some trends are dropping and some are growing. For \nexample, Topics like Vision 2030, Digital Transformation, and Economic Diversification exhibit consistent \ngrowth. Furthermore, there is a sustained growth in the popularity of concepts such as Sustainability \nInitiatives and Renewable Energy, which is expected stay positive in the near future. In contrast, the topics \nof the reduction in oil dependency and Traditional economic model are likely to shift towards a diminishing \ntrend. The reason for this could be as a part of Vision 2030, it was decided that KSA will move away from \nthese topics. The trends in the dataset provide an insight in the changing priorities of the public towards the \nnew age concepts of modernization and sustainability. \n \nFig. 7. Trend Growth Prediction \n \nIn contrast, the articles of the Drying oil dependency and Traditional economic model are likely to shift \ntowards a diminishing trend for the reasons that these are increasingly irrelevant to the dataset. The trends in \nthe dataset provide an insight in the changing priorities of the public towards the new age concepts of \nmodernization and sustainability. \n \nConclusion and contribution \nThis paper presents an innovative methodology for forecasting trend, combining sentiment analysis and \nengagement metrics from social media data. Key contributions include enhanced trend forecasting through \nthe integration of sentiment scores and engagement data, providing businesses, investors, and policymakers \nwith a reliable measure of trend relevance and growth potential. The paper introduces a dynamic trend \ngrowth prediction model that not only tracks current trends but also forecasts future growth by considering \nmomentum and the rate of change, offering more accurate predictions than traditional models. \nThe process can be updated in real-time by setting up cron jobs, that can continuously update the Pulse \nPotential scores allow for continuous tracking and forecasting, enabling businesses and investors to stay \nahead in fast-changing markets like Saudi Arabia. Moreover, the model not only helps in identifying the \nemerging trends but can also discover the diminishing trends in the given data. It offers critical insights for \ninvestment, new businesses and marketing strategies. This methodology can be applied to other areas as well \nsuch as urban planning, economic policy development etc. thereby helping the decision makers by providing \nreal- time feedback on public sentiment to make informed decisions. \n \nLimitations and future work \nAlthough the research is able to generate promising results but there are several limitations. The model’s \nresults are heavily dependent on the availability and quality of social media data. The results will always \nshow what is in the collected dataset. Our process is only able to collect a subset of dataset from these \nplatforms. There is a possibility for the results to be biased. Moreover, we are tracking limited social media \nplatforms and offline events are not being tracked in this study. The offline events can also influence public \nopinion. \nThis study provides valuable insights into trend forecasting through the Pulse Potential (PP) metric, but there \nare several areas for future research. First, exploring micro- trends within macro trends, such as breaking \ndown digital transformation into subcategories like AI, cloud computing, and cybersecurity, could provide a \nmore granular view of trend evolution. Additionally, sentiment-driven forecasting could be enhanced by \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1942 \nsegmenting stakeholders (e.g., consumers, businesses, government) to better capture their distinct \nperceptions of trends, such as how economic diversification is viewed by different groups. Cross-platform \ndata integration, incorporating data from news articles, forums, and blogs, could offer a more holistic view \nof trends, while dynamic weighting of engagement metrics would optimize the predictive power of likes, \nshares, and comments based on trend context. Model’s accuracy can be further increased, if external factors \nlike economic shits, political changes, global crisis etc. are incorporated. Moreover, if geo- data is also \nincorporated in the dataset, we could further perform analysis based on location-specific predictions. This \nwill be beneficial in identifying the trends that may be more prominent in urban areas like Riyadh as \ncompared with the rural regions. \n \nDisclaimer \nThis study is conducted solely for research purpose. This study is not affiliated with or does not intend to \npromote any business or commercial activity. The only objective of this study is to explore how AI, can be \nused to generate insights into market trends by using social media data. The findings presented in this paper \nare based on the data available on social media platforms during the study period. \n \nReferences \n \n1. Ministry of Economy and Planning, \"Vision 2030 and Economic Development in Saudi Arabia,\" \nSaudi Government Publications, 2020. \n2. J. Chae, J. Chen, T. Zhang, et al., \"Social Media Analytics for Regional Trend Analysis,\" Journal of \nBusiness Research, vol. 112, pp. 125-137, 2020. \n3. Alshamsi, A. Qasmi, and A. Mohtaseb, \"Consumer Sentiment Analysis for Saudi Arabia Using \nSocial Media Data,\" Saudi Economic Review, vol. 11, no. 4, pp. 37-54, 2022. \n4. K. Aalijah and R. Irfan, \"Scalable Taxonomy Generation and Evolution on Apache Spark,\" 2020 \nIEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive \nIntelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber \nScience and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech), Calgary, AB, Canada, \n2020,  pp.  634-639,  doi:  10.1109/DASC-PICom-CBDCom- \n5. CyberSciTech49142.2020.00110. \n6. M. Hussain, M. Alharthi, and M. Hawsawi, \"AI and Social Media Trend Analysis in the Middle \nEast,\" Journal of Middle Eastern Studies, vol. 24, no. 2, pp. 145-162, 2023.x \n7. Aalijah, K., Irfan, R., Umar, U., & Nayab, S. (2022). Automatic taxonomy generation and \nincremental evolution on Apache Spark Parallelization Framework. KIET Journal of Computing and \nInformation Sciences, 5(1), 15–36. \n8. H. Chen, R. Chiang, and V. C. Storey, \"Business Intelligence and Analytics: From Big Data to Big \nImpact,\" MIS Quarterly, vol. 36, no. 4, pp. 1165-1188, Dec. 2012. \n9. J. Devlin, M.-W. Chang, K. Lee, and K. Toutanova, \"BERT: Pre- training of Deep Bidirectional \nTransformers for Language Understanding,\" arXiv preprint arXiv:1810.04805, 2018. \n10. W. Antoun, R. Baly, and H. Hajj, \"AraBERT: Transformer-based Model for Arabic Language \nUnderstanding,\" Proceedings of the 4th Workshop on Open-Source Arabic Corpora and Processing \nTools, pp. 9-15, 2020. \n11. J. Devlin, M.-W. Chang, K. Lee, and K. Toutanova, \"BERT: Pre- training of Deep Bidirectional \nTransformers for Language Understanding,\" arXiv preprint arXiv:1810.04805, 2018 \n12. Y. Zhang, S. Wu, and K. Liang, \"AI-Driven Consumer Insights for Emerging Markets,\" Technology \nand Society, vol. 37, pp. 293-306, 2020. \n13. Alshamsi, A. Qasmi, and A. Mohtaseb, \"Consumer Sentiment Analysis for Saudi Arabia Using \nSocial Media Data,\" Saudi Economic Review, vol. 11, no. 4, pp. 37-54, 2022. \n14. D. Jiang, C. Lu, and Y. Sun, \"Multimodal Sentiment Analysis on Social Media Data,\" IEEE \nTransactions on Multimedia, vol. 23, no. 1, pp. 280-289, 2021. \nI. Goodfellow, Y. Bengio, and A. Courville, Deep Learning. Cambridge, MA: MIT Press, 2016, pp. \n164-166. \n\nKanwal Aalijah, IJSRM Volume 13 Issue 02 February 2025                                                EC-2025-1943 \nI. Loshchilov and F. Hutter, \"Decoupled Weight Decay Regularization,\" in Proc. Int. Conf. Learning \nRepresentations (ICLR), Vancouver, Canada, Apr. 2019. \n15. M. Grootendorst, \"BERTopic: Leveraging BERT embeddings for topic modelling,\" arXiv preprint, \n2020. \n16. M. Grootendorst, \"BERTopic: Neural topic modelling with a class- based TF-IDF procedure,\" arXiv \npreprint arXiv:2203.05794, 2022 \n17. R. J. G. B. Campello, D. Moulavi, and J. Sander, \"Density-Based Clustering Based on Hierarchical \nDensity Estimates,\" in Proc. of the 17th ACM SIGKDD Int. Conf. Knowledge Discovery and Data \nMining, \n18. San Diego, CA, USA, 2013, pp. 160–168 \n19. Taylor, S.J., & Letham, B. (2018). Forecasting at Scale. The American Statistician, 72(1), 37-45. \n",
  "metadata": {
    "source_path": "papers/arxiv/Utilizing_Social_Media_Analytics_to_Detect_Trends_in_Saudi_Arabias\n__Evolving_Market_8fc16450b4529800.pdf",
    "content_hash": "8fc16450b4529800da71b78a25e4fb19a286b94a42f7c65cbf618a71f71cde55",
    "arxiv_id": null,
    "title": "Paper Title (use style: paper title)",
    "author": "IEEE",
    "creation_date": "D:20250201204304+05'30'",
    "published": "20250201204304+05'30'",
    "pages": 8,
    "size": 626626,
    "file_mtime": 1740470216.685225
  }
}