{
  "text": "HybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and\nValidity in 3D Molecular Linker Generation\nMinyeong Hwang 1 Ziseok Lee 2 Kwangsoo Kim 3 Kyungsu Kim 2 Eunho Yang 1 4\nAbstract\nLinker generation is critical in drug discovery ap-\nplications such as lead optimization and PROTAC\ndesign, where molecular fragments are assembled\ninto diverse drug candidates. Existing methods\nfall into PC-Free and PC-Aware categories based\non their use of 3D point clouds (PC). PC-Free\nmodels prioritize diversity but suffer from lower\nvalidity due to overlooking PC constraints, while\nPC-Aware models ensure higher validity but re-\nstrict diversity by enforcing strict PC constraints.\nTo overcome these trade-offs without additional\ntraining, we propose HybridLinker, a framework\nthat enhances PC-Aware inference by providing\ndiverse bonding topologies from a pretrained PC-\nFree model as guidance. At its core, we propose\nLinkerDPS, the first diffusion posterior sampling\n(DPS) method operating across PC-Free and PC-\nAware spaces, bridging molecular topology with\n3D point clouds via an energy-inspired function.\nBy transferring the diverse sampling distribution\nof PC-Free models into the PC-Aware distribu-\ntion, HybridLinker significantly and consistently\nsurpasses baselines, improving both validity and\ndiversity in foundational molecular design and\napplied property optimization tasks, establishing\na new DPS framework in the molecular and graph\ndomains beyond imaging.\n1. Introduction\nFragment-based drug discovery strategically assembles\nmolecular fragments to create stable and effective drug can-\ndidates. A key challenge is linker generation, which involves\ndesigning molecular linkers that connect fragments while\nensuring their validity. In this work, we categorize existing\nlinker generation models into Point Cloud Free (PC-Free)\n1Korea Academic Insititue of Science and Technology (KAIST)\n2Seoul National University\n3McLean Hospital and Harvard\nMedical School 4AITRICS. Correspondence to: Kyungsu Kim\n<kyskim@snu.ac.kr >, Eunho Yang <eunhoy@kaist.ac.kr>.\nPreprint. Under review.\nOurs\nV + U\nPC-Free Model\nV + BM\nV + FG\n     V + HD\n      V + N \nInvalid Structure\nValid+Unique Molecule\nInput \nFragments\n(b) Balanced Diversity and Validity\n(a) Enhanced Diversity Scores\nOurs\nPC-Free\nPC-Aware\n/ Diversity\n/ Validity\n/ Diversity\n0 Validity\n0 Diversity\n/ Validity\nValidity Refinement\nConformation \nGeneration\nPC-Aware Model\nOurs\nFigure 1. (a) Qualitative comparison of our method and existing\npipelines on diversity of valid molecule samples measured on five\nmetrics. (b) Trade-off between diversity and validity in baseline\nmodels and our hybrid approach overcoming these limitations.\nand Point Cloud Aware (PC-Aware) models, distinguished\nby whether they account for the 3D conformation of frag-\nments when determining the bonding topology of the com-\nplete molecule. Furthermore, through a fair comparison, we\n1\narXiv:2502.17349v1  [physics.chem-ph]  24 Feb 2025\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nTable 1. Comparison of molecular generation tasks based on inputs and outputs. It reveals that our setup, linker generation, is a general\nformulation of fragment-based molecular generation. G represents a complete molecule represented as a 3D graph, while F, another\n3D graph, is a partial molecule with |F| ≪|G| in most cases. M denotes the binding pocket of target proteins, providing structural\nconstraints. T refers to the bonding topology of a molecule, defined by atom types and chemical bonds. T represents an arbitrary\ntransformation in SE(3) (e.g., rotations and translations).\nTask\nLinker Gen. (Our Setup)\n2D Linker Gen.\nScaffold Hop.\nPROTAC Design\nInput\nG1, G2\nT1, T2\nF1, F2\nG1, G2\nOutput\nG′ | G1, G2 ⊂G′\nT ′ | T1, T2 ⊂T ′\nG′ | F1, F2 ⊂G′\nG′ | T1[G1], T2[G2] ⊂G′\nTask\nTarget-Aware Drug Design\nFragment Growing\nDe Novo Gen.\nConformation Gen.\nInput\nG1, G2, M ′\nG⋆\nNone\nT ⋆\nOutput\nG′ | G1, G2 ⊂G, M ′\nG′ | G⋆⊂G′\nG′\nG′ = (T ⋆, R′) | T ⋆\nhighlight that achieving a balance between diversity (explor-\ning novel topological spaces) and validity (ensuring spatial\nconsistency between fragments and the linker) remains a\nsignificant challenge in current linker design methodologies.\nPoint Cloud Free Models (↑Diversity ↓Validity).\nThese models, such as FFLOM (Jin et al., 2023) and\nDeLinker (Imrie et al., 2020), generate diverse bonding\ntopologies based on fragment connectivity while excluding\nfragment 3D conformations, followed by 3D conformation\nprediction for the sampled topology using conformation gen-\nerators (Riniker & Landrum, 2015; Xu et al., 2022; 2021).\nBy disregarding 3D fragment conformations during topol-\nogy generation, they maximize entropy in the sampling\ndistribution, enhancing diversity. However, this often re-\nsults in poor alignment between the linker’s conformation\nand the predefined fragment geometry, leading to invalid,\nhigh-energy molecules.\nPoint Cloud Aware Models (↓Diversity ↑Validity). . Dif-\nfLinker (Igashov et al., 2024) and 3DLinker (Huang et al.,\n2022) achieve high validity by incorporating fragment con-\nformations when determining bonding topology, ensuring\nspatial alignment between fragments and generated linkers.\nHowever, their strict spatial constraints lower sampling en-\ntropy, limiting the exploration of diverse topologies. This\nconstrained search space increases the risk of overfitting,\nmaking it challenging to generate topologically diverse drug\ncandidates.\nTo overcome the diversity-validity trade-off, we propose\nHybridLinker, a framework that integrates the strengths\nof PC-Free and PC-Aware models. By guiding a PC-Aware\nmodel with bonding topologies sampled from a PC-Free\nmodel, HybridLinker enhances diversity while preserving\nvalidity. At its core, we introduce LinkerDPS, the first diffu-\nsion posterior sampling (DPS) method that bridges molecu-\nlar topology and point cloud space via an energy-inspired\nfunction. This approach transfers the highly diverse samples\nof PC-Free models into the validity-focused distribution of\nPC-Aware models, achieving a balanced trade-off between\ndiversity and validity. Figure 1 illustrates how HybridLinker\nsurpasses existing methods.\nWe evaluate HybridLinker on the ZINC (Irwin et al., 2020)\ntest dataset, a standard benchmark in drug discovery, demon-\nstrating its ability to generate diverse and valid molecules\nfrom fragment inputs. By leveraging zero-shot cooperation\nbetween PC-Free and PC-Aware models, HybridLinker sur-\npasses existing methods in diversity of valid molecules and\nits enhanced diversity also drives superior performance in\nproperty optimization tasks, highlighting its potential as a\nfoundational model. Moreover, HybridLinker’s success val-\nidates LinkerDPS, showcasing its versatility across various\ndomains and applications.\nOur contributions can be summarized as follows:\n• We are the first to highlight the trade-off between di-\nversity and validity in a fair comparison of Point Cloud\nFree and Point Cloud Aware linker generation models.\n• We present HybridLinker, a simple yet effective frame-\nwork that integrates pretrained Point Cloud Free and\nPoint Cloud Aware linker generation models within a\ntwo-step generation pipeline, enabling zero-shot infer-\nence inheriting their strengths.\n• We introduce LinkerDPS, the first DPS method beyond\nthe image domain, operating across molecular topol-\nogy and point cloud spaces. It bridges these domains\nthrough an energy-inspired cross-domain function, en-\nabling effective topology-guided molecular point cloud\ngeneration. Its cross-domain guidance overcomes chal-\nlenges in point cloud space by leveraging topology\nspace as an intermediary, offering a wide range of po-\ntential applications.\n• We evaluate HybridLinker across both the fundamen-\ntal task of diverse sampling and the application-driven\ntask of property optimization, demonstrating its po-\ntential as a foundation model. Furthermore, validated\nperfomance of LinkerDPS in linker generation show its\npotential for broader applications, particularly in chal-\nlenging point cloud tasks benefiting from topological\nguidance.\n2\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nGuidance from \nPC-Free Model\nPrior of \nPC-Aware Model\nPosterior \nSampling\nHigh Diversity\nHigh Validity\nPC-Aware posterior sampling with PC-Free\nguidance combines both models' strengths.\nFigure 2. Comparison of generation pipelines for PC-Free and PC-Aware models. HybridLinker is designed to leverage the strengths of\nboth approaches, inheriting high diversity from the PC-Free model and high validity from the PC-Aware model.\n2. Background\n2.1. Molecule Generation\nMolecular Representations\nA molecule is commonly\nrepresented as a molecular graph, where nodes correspond\nto atoms, and edges represent covalent bonds (Huang et al.,\n2024). We formalize this below.\nDefinition 2.1 (3D Molecular Graph). A 3D molecular\ngraph is defined as a triplet G = (V, E, R), where:\n• V is the list of atoms in the molecule.\n• E is the set of chemical bonds, represented as an\nadjacency tensor.\n• R ∈R|V |×3 denotes the 3D conformation, specifying\nthe spatial coordinates of each atom.\nGiven a molecular graph with N atoms, we adopt the\nfollowing encoding scheme: V is one-hot encoded as\nV ∈{0, 1}N×A, where A is the number of atom types.\nE is stored as an adjacency tensor E ∈{0, 1}N×N×B,\nwhere B is the number of bond types.\nWe also introduce two key sub-representations:\n• The bonding topology, denoted as T = (V, E), which\ncaptures the connectivity of atoms without considering\nspatial information.\n• The point cloud representation, given by (V, R),\nwhich encodes atom types and 3D positions but omits\nbond information.\nThus, a 3D molecular graph can be equivalently expressed\nas G = (T , R), combining both connectivity and geometry.\nWe write PG = PT ,R to denote the distribution (dataset) of\nvalid 3D molecular graphs which can be seen as the joint\ndistribution over the bonding topology and 3D conforma-\ntion.\nRecent molecular diffusion models (Hoogeboom et al.,\n2022; Igashov et al., 2024; Corso et al., 2023b; Schneu-\ning et al., 2024; Corso et al., 2023a) represent molecules as\npoint clouds (V, R), disregarding explicit chemical bonds\n(E) during the denoising steps. In these methods, the dis-\ncrete point cloud representation is embedded in a continuous\nspace Rd, where d = NA + 3|V | accounts for both atom\ntypes (one-hot encoded) and spatial coordinates. Diffusion\ndenoising steps operate in Rd, gradually refining the contin-\nuous representation. After sampling, the discrete atom rep-\nresentation is recovered using an argmax operation on V .\nChemical bonds are inferred via a post-hoc bond predictor\nas E = E(F, V, R) or E(∅, V, R) depending on fragment\nconditions F, producing G = (V, E, R).\nTasks in Molecule Generation\nThis paper addresses the\nlinker generation task, a subfield within the broader domain\nof large molecule generation. As shown in Table 1, we\ncontextualize this task by comparing it with other related\ntasks in the domain, including topology linker generation,\nscaffold hopping, PROTAC design, fragment growing, de\nnovo molecule generation, and conformation generation.\nRelated works are summarized in Appendix H.\nValidity\nIn prior works, molecular validity has been pri-\nmarily defined in terms of satisfying the valence rule in\nmolecular topology. In this paper, we extend its definition to\nalso consider molecular conformation and the resulting ener-\ngetic stability. A detailed discussion on validity is provided\nin Appendix A.\n2.2. Problem Setup: Linker Generation\nSuppose we are given two molecule fragments G1 =\n(T1, R1) and G2 = (T2, R2), where G1 and G2 are sub-\ngraphs of a reference molecule Gref = (Tref, Rref). The ref-\nerence molecule Gref, which contains Nref = |Vref| atoms, is\nchemically valid, and belongs to a molecular graph dataset.\n3\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nComplete Molecule \nFragments \nLinker\nFigure 3. Problem setup for linker generation, illustrating the frag-\nments G1 and G2 embedded in a candidate molecule G′. Nref is\nthe size of reference molecule.\nFurther, we set Tcond = T1 ∪T2, and Rcond = R1 ∪R2.\nLinker Generation is the task of generating new complete\n3D molecular graphs G′ = (T ′, R′), from the following\nconditional distribution1 (see Figure 3):\nG′ ∼PG(G |\nG1, G2 ⊂G, |V | = Nref\n|\n{z\n}\nF=Tcond∩Rcond: fragment conditions\n)\n(1)\nFor simplicity, we use the shorthand PG(G | F) to denote\nthis joint distribution which captures the topological (Tcond)\nand geometric (Rcond) constraints imposed by a fragment\ncondition F. We analogously write the marginal distribu-\ntions of T , R as PT and PR, respectively.\nIn this setup, G1 and G2 serve as endpoints, and the task is\nto generate the missing linker atoms and bonds that connect\nG1 and G2 while maintaining its validity.\n2.3. PC-Free and PC-Aware Approaches\nExisting works in linker generation are divided into two\napproaches, Point Cloud Free (PC-Free) and Point Cloud\nAware (PC-Aware) approaches, based on awareness of frag-\nments’ conformation Rcond on determining the bonding\ntopology of output molecule T . To clarity, the ways they\nsample T are distinguished as following:\nPC-Free : PT |Tcond(T | Tcond)\nPC-Aware : PT |Tcond,Rcond(T | Tcond, Rcond )\n(2)\nIn the following, we explain each approach in detail with\nrelated models.\nPoint Cloud Free (PC-Free) Approach.\nPC-Free ap-\nproaches (Jin et al., 2023; Imrie et al., 2020) model the\nconditional distribution as in (3), sequentially sampling the\nbonding topology T conditioned on only the fragments’\nbonding topology Tcond and then the 3D conformation R.\nPG(G | F)\nBayes\n= PT (T | F ) · PR|T (R | T , F)\nPC-Free\n≈\nPT (T | Tcond ) · PR|T (R | T , F)\n=: P2D(G | F)\n(3)\n1We write G1 ⊂G′ to denote that G′ contains G1 as its\nsubgraph, meaning that V1 ⊂V ′, E1 ⊂E′, R1 ⊂R′. We\nanalogously write T1 ⊂T to mean V1 ⊂V ′, E1 ⊂E′.\nHowever, the approximation in (3), which assumes that the\nlinker’s topology is independent of Rcond, is often inaccu-\nrate. In reality, the topology of the linker generally depends\non Rcond, as its topology-driven conformation must align\nwith Rcond to ensure energetic stability. To emphasize the\ndistinction between the true distribution PG and its approx-\nimation, we denote the latter as P2D, referring to it as the\nsurrogate distribution.\nPC-Free models sample from (3) by using a neural network\nto approximate PT (T | Tcond) and an off-the-shelf confor-\nmation generator R which produces the 3D conformation\nof the molecule conditioned on R1 and R2.\nR′ = R(T ′, R1, R2\n| {z }\nRcond\n) ∈R|V |×3\n(4)\nPoint Cloud Aware (PC-Aware) Approach.\nIn contrast,\nPC-Aware models like DiffLinker (Igashov et al., 2024)\nand 3DLinker (Huang et al., 2022) learn the distribution\nof bonding topology conditioned on both 3D conformation\nand bonding topology of fragments, as in (2). In particular,\nDiffLinker and 3DLinker incorporate atom-wise distances\nbetween linker atoms and fragments to account for Rcond\nin determining both topology and conformation, thereby\nresulting in a non-approximated sampling framework (5).\nPG(G | F) = PV,R(V, R | F)\n|\n{z\n}\nGenerative Model\n· PE|V,R(E | F, V, R)\n|\n{z\n}\nE=E(F,V,R)\n(5)\nThis formulation allows generative models to focus on sam-\npling atomic positions while leveraging external bond infer-\nence models.\n2.4. Trade-Off in Diversity and Validity\nDue to different sampling strategy, PC-Free and PC-Aware\nmodels exhibit an inverse relationship between diversity\nand validity. Specifically, PC-Free models demonstrate\nhigh diversity but low validity, whereas PC-Aware models\nachieve high validity but low diversity.\nDiversity\nPC-Free models generate T without condition-\ning on Rcond, leading to greater diversity compared to PC-\nAware models, which incorporate Rcond in sampling T . This\nfollows from the general principle that conditioning reduces\nentropy,\nH(T | Tcond, Rcond) ≤H(T | Tcond).\n(6)\nValidity\nPC-Free models face validity issues due to the\ninaccurate assumptions in (3). Since the 3D conformations\nof fragments, R1 and R2, are ignored when determining\nthe bonding topology T ′, even a model that perfectly learns\nthe target distribution P2D will still deviate from the true\nmolecular distribution PG. In contrast, PC-Aware models\ninherently overcome this limitation by explicitly training on\nthe linker generation task in (5).\n4\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\n( ⬆ Diversity ⬇ Validity )\n( ⬇ Diversity ⬆ Validity )\na) PC-Free Model\nb) Diffusion-based PC-Aware Model\nc) HybridLinker\n(  ⬆ Diversity ⬆ Validity )\nFigure 4. Conceptual comparison of sampling distributions in PC-Free, PC-Aware, and HybridLinker models. (a) PC-Free models explore\na broad molecular space but often generate invalid molecules. (b) PC-Aware models focus on validity but suffer from low diversity due to\nspatial constraints. (c) HybridLinker leverages LinkerDPS to balance diversity and validity, enhancing exploration while maintaining\ncorrectness.\n2.5. Diffusion-based Molecule Generation\nThe molecular diffusion model (Hoogeboom et al., 2022;\nIgashov et al., 2024; Corso et al., 2023b) has emerged as a\nleading architecture for various molecule generation tasks,\nincluding PC-Aware linker generation (Igashov et al., 2024).\nIt leverages the reverse diffusion process to iteratively de-\nnoise a randomly sampled xT ∼N(0, I) into a valid point\ncloud x0 = (V, R) in T timesteps. Specifically, the process\nis formulated as\n(\nxT ∼N(0, I)\ndxt =\n\u0002\nf(xt, t) + g2(t)∇xt log pt(xt)\n\u0003\ndt + g(t)d ¯Wt\n(7)\nwhere ¯Wt represents the reverse Wiener process. The drift\ncoefficient is given by f(xt, t) = 1\n2βtxt, and the diffusion\ncoefficient is g(t) = √βt, where βt is a predefined noise\nschedule. The term ∇x log pt(x), referred to as the score, is\nestimated using a trained network sθ∗. The output denoised\ngraph x0 is converted into a one-hot encoded molecular\npoint cloud using argmax followed by a post-hoc bond\npredictor, as described in Definition 2.1.\n3. Method\nRather than directly sampling G′ ∼PG in a single step,\nwe propose a hybrid two-step approach that leverages both\nPC-Free and PC-Aware linker generation models.\n3.1. Motivation for a Hybrid Approach\nExperimental Comparison\nTo validate this trade-off, we\nevaluate PC-Free and PC-Aware models on the ZINC dataset\nusing standard metrics: Validity for validity, Uniqueness\nfor diversity and V + U for diversity of valid molecules.\nThe experimental setup follows Section 4.1. As shown in\nTable 2, PC-Free models excel in diversity, while PC-Aware\nmodels perform best in validity, confirming our hypothesis.\nAs observed in V + U score, the trade-off between diversity\nTable 2. Trade-off between diversity and validity in PC-Free and\nPC-Aware models. The F/A column indicates whether the model\nbelongs to PC-Free (F) or PC-Aware (A). Uniqueness is a metric\nthat measures the diversity of samples, while V + U represents\nuniqueness counting only valid molecules\nMethod\nF / A\nUniquess (↑)\nValidity (↑)\nV + U (↑)\nFFLOM\nF\n0.840 (High)\n0.370 (Low)\n0.313\nDeLinker\nF\n0.638 (High)\n0.575 (Low)\n0.386\nDiffLinker\nA\n0.349 (Low)\n0.711 (High)\n0.269\n3DLinker\nA\n0.443 (Low)\n0.654 (High)\n0.326\nand validity significantly limits the practical utility of exist-\ning linker generation models. To overcome this limitation,\nwe propose a hybrid approach that integrates the strengths\nof both PC-Free and PC-Aware models without requiring\nany training. Our hybrid pipeline leverages pretrained PC-\nFree and PC-Aware models cooperatively to achieve both\nhigh diversity and validity. Figure 2 illustrates the genera-\ntion processes of PC-Free and PC-Aware models, along with\ngoal of our proposed hybrid strategy of inheriting strength\nof two models.\n3.2. Hybrid Approach\nWe develop a straightforward and intuitive pipeline that inte-\ngrates two pretrained models, leveraging a novel theoretical\nmethodology to execute the process. To adopt two types of\nmodels, we rewrite our sampling as two-step pipeline given\na fragment condition F = Tcond ∩Rcond as (8),\nPG, ˜\nG(G, ˜G | F) = P ˜\nG( ˜G | F) · PG| ˜\nG(G | ˜G, F)\n(8)\nwhere we first sample surrogate molecule ˜G to support\nsampling of G.\nNow, we plug-in the PC-Free and PC-Aware models to im-\nplement the two steps in (8). In the first stage, we set P ˜\nG\nas the PC-Free distribution P2D, which captures the topo-\nlogical diversity of PG but also includes invalid samples.\n5\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nStep 1 (PC-Free Sampling of a Surrogate):\nStep 2 (PC-Aware Posterior Sampling for the Given Surrogate):\nTwo-Step Pipeline (Combining PC-Aware / PC-Free Models' Strengths):\nFigure 5. Two-step generation pipeline of HybridLinker. (Step 1.) diverse molecular samples are generated using pretrained PC-Free\nmodels. (Step 2.) posterior sampling is performed for each molecule from the previous step. If a molecule is invalid, LinkerDPS is\napplied to a diffusion-based PC-Aware model to refine it into a valid structure while maintaining similarity to the guiding molecule. Valid\nmolecules from the first step are directly used as the final output.\nCorrespondingly, PG| ˜\nG in the second stage becomes sam-\npling of valid molecule equal or similar to ˜G. To clarify,\nif ˜G is invalid, we run a molecular refinement process to\nobtain a similar but valid molecule; otherwise, we set G\nto be ˜G. To implement the molecular refinement process,\nwe perform posterior sampling using the validity-focused\nprior distribution of G, learned by the PC-Aware model,\nand our likelihood of ˜G, which favors affinity with G. To\nsummarize, we implement (8) as (9).\nPG,2D(G, ˜G | F) = P2D( ˜G | F)\n|\n{z\n}\nStep 1: PC-Free\n· PG|2D(G | ˜G, F)\n|\n{z\n}\nStep 2: PC-Aware\n(9)\nAt a high level, our implementation can be viewed as trans-\nferring the high-entropy of the PC-Free distribution into\nthe validity-focused PC-Aware distribution, leading to a co-\nordinated distribution that ensures both high diversity and\nvalidity of G. Specifically, our process produces a tuple\ncomprising a valid 3D molecule sample G ∼PG and a\nsurrogate ˜G ∼P2D. We describe the algorithmic difference\nof HybridLinker to PC-Aware model and PC-Free model in\nAppendix C.\n3.3. Posterior Sampling From PG|2D\nThe challenge in sampling PG|2D lies in refining an invalid\nsurrogate molecule into a valid one, which corresponds to\nthe inverse problem (Gutha et al., 2024; Yang et al., 2024;\nChung et al., 2024a) in the molecular domain. Since this\narea remains unexplored, we introduce LinkerDPS, the first\nDPS (Chung et al., 2024a) method designed for the molecu-\nlar domain. By adopting the reverse process of the diffusion-\nbased PC-Aware model, LinkerDPS samples a refined point\ncloud (V, R) favored by the pretrained prior distribution of\nvalid point clouds.\np(V, R | ˜G, F) =\nvalidity\nz\n}|\n{\np(V, R | F) ·\naffinity\nz\n}|\n{\np( ˜G | V, R, F)\np( ˜G | F)\n(10)\nAs shown in (10), leveraging Bayes’ rule, we decompose\np(V, R | ˜G, F) into the prior distribution p(V, R | F) and\nthe likelihood p( ˜G | V, R, F), which respectively ensure\nthe validity of (V, R) and its affinity with ˜G. Beyond the\nprior learned by the pretrained PC-Aware model, we design\nthe likelihood of ˜G = ( ˜V , ˜E, ˜R) as follows. Note that we\ndisregard the condition F by considering V and R as stricter\nconstraints. Additionally, we assume mutual independence\nof ˜V , ˜E, ˜R given V and R.\nLikelihood of Atom\nTo ensure consistency between the\nsurrogate and generated molecules, we enforce that the\natoms of both molecules remain the same. Formally, the\nlikelihood of ˜V is defined as\nP ˜V |V ( ˜V | V ) := I( ˜V = V )\n(11)\nwhere I denotes the indicator function.\nLikelihood of Bond and Conformation\nTo account for\nthe cross-domain nature of bond likelihood given a point\ncloud, we introduce a molecular energy-inspired function\nU, defined as\nU(E∗, R∗) :=\nX\n1≤i,j≤|V |\n1E∗\ni,j̸=0∥R∗\ni −R∗\nj∥,\n(12)\n6\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nTable 3. Comparison of linker generation models across diversity and validity metrics. The F/A column indicates whether the model\nbelongs to a PC-Free (F), PC-Aware (A), or hybrid (F+A) model. The ”Diversity w/o Validity” columns represent diversity without\nconsidering validity (only satisfying topological valence rules), while the ”Diversity w/ Validity” columns represent diversity of valid\nmolecules.\nF/A\nValidity (%)\nDiversity wo/ Validity\nDiversity w/ Validity\nUniqueness (%)\nNovelty (%)\nV+U (%)\nV+N (%)\nV+HD\nV+FG\nV+BM\nFFLOM\nF\n37.07\n84.04\n58.29\n31.25\n31.32\n6.38\n16.37\n14.48\nDeLinker\nF\n57.44\n63.78\n31.63\n38.57\n38.53\n7.32\n16.20\n17.33\nDiffLinker\nA\n71.08\n34.94\n16.32\n26.90\n26.90\n5.08\n11.37\n10.91\n3DLinker\nA\n65.31\n44.31\n21.83\n32.61\n32.64\n6.14\n15.40\n14.23\nHybridLinker (FFLOM)\nF+A\n69.03\n68.39\n44.67\n55.10\n55.09\n10.81\n23.92\n24.59\nHybridLinker (DeLinker)\nF+A\n77.27\n68.09\n35.70\n55.02\n55.28\n10.21\n21.82\n24.23\nwhich quantifies the energy of a bond-conformation system\nforming a molecule. We define the affinity of ˜E with a given\nR and its likelihood as the probability that the system en-\ncompassing R adopts the bond ˜E. Utilizing the Boltzmann\ndistribution, this quantity is expressed as being proportional\nto exp\n\u0010\n−U( ˜E, R)\n\u0011\n. Similarly, to model the likelihood of\n˜R, we employ a Gaussian kernel κ to quantify the similarity\nbetween ˜R and R as in (13), and we define the likelihood\nof ˜R to be proportional to κ( ˜R, R):\nκ( ˜R, R) = e−∥˜\nR−R∥2.\n(13)\nCombining these components, we formulate the joint likeli-\nhood of ( ˜E, ˜R) as\np( ˜E, ˜R | R) := 1\nZ κ( ˜R, R)e−U( ˜\nE,R),\n(14)\nwhere Z is the normalization constant, assumed to be inde-\npendent of R.\nLinkerDPS Formulation.\nUtilizing (11) and (14) to ex-\npress the likelihood in (10), sampling p(V, R | ˜G) reduces\nto sampling R while keeping V = ˜V fixed, formulated as\np(R | ˜G, V, F) ∝p(R | V, F) · p( ˜E, ˜R | R).\n(15)\nAccordingly, LinkerDPS implements conditional sampling\nof the conformation R via the reverse diffusion process:\ndrt =\nh\nf(rt, t) + g2(t)∇rt log pt(rt | ˜E, ˜R, V )\ni\ndt + g(t)d ¯Wt\n(16)\nwhere rt follows the prior distribution induced by the for-\nward process of PR. Applying Bayes’ rule, we express:\n∇rt log p(rt| ˜E, ˜R, V ) = ∇rt log pt(rt|V ) + ∇rt log pt( ˜E, ˜R|rt, V )\n(17)\nTo compute ∇rt log pt(rt|V ), we employ an inpainting\nstrategy (Lugmayr et al., 2022) and introduce a conditional\nscore estimator sr\nθ∗, derived from the pretrained score esti-\nmator sθ∗of the PC-Aware model:\nsr\nθ∗(rt, t, V, F) ≈∇rt log pt(rt|V ).\n(18)\nThe detailed operation of this estimator is described in Ap-\npendix D.5. To evaluate ∇rt log pt( ˜E, ˜R | rt, V ), we ex-\ntend the DPS approximation (Chung et al., 2024a) for our\nlikelihood in (14), obtaining:\npt( ˜E, ˜R | rt, V ) ≈p( ˜E, ˜R | ˆr),\n(19)\nwhere\nˆr =\n1\n√αt\n(rt + (1 −αt) · sr\nθ∗(rt, t, V, F))\n(20)\nis the estimated expectation of r0 given V . The adaptation\nof the DPS approximation is detailed in Appendix D.3. This\napproximation renders (17) tractable as\n∇rt log pt(rt| ˜E, ˜R, V ) = sr\nθ∗(rt, t, V, F) + ∇rt log p( ˜E, ˜R | ˆr).\n(21)\nThe detailed computation of ∇rt log p( ˜E, ˜R | ˆr) is pre-\nsented in Appendix D.4. Finally, we apply ancestral sam-\npling (Ho et al., 2020a) to sample from the reverse diffu-\nsion process. The sampled conformation is concatenated\nwith V to construct the point cloud, which is subsequently\nconverted into a complete molecular structure using the post-\nhoc bond predictor E, following the PC-Aware model. The\nfull algorithm for LinkerDPS is provided in Appendix D.6.\n4. Experiments\n4.1. Experiment Setup\nWe evaluate linker generation algorithms on for 400\nfragment-linker pairs from ZINC-250K (G´omez-Bombarelli\net al., 2018), which are the test data in prior linker gener-\nation work (Imrie et al., 2020). Further, we run 50 times\nsampling for each fragment and use 20,000 samples in total\nfor our experiments. To evaluate generated samples’ valid-\nity, we use the metric Validity described in Section 2.1.\nTo score the diversity of samples, we use the followings to\ncapture diversity in multiple perspective: Uniqueness, Nov-\nelty, V+U, V+N, V+HD, V+FG, and V+BM. Uniqueness\nand Novelty accounts for all samples satisfying topological\nvalence rule, but the others measures the diversity of valid\nmolecules by counting only the valid samples. More details\n7\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nTable 4. Comparison of linker generation algorithms based on drug-\nlikeness scores. We report the score of best sample for given\nfragments, averaged over all test fragments.\nMethod\nQEDbest (↑)\nSAbest (↓)\nPLogPbest (↑)\nFFLOM\n0.755\n2.780\n1.259\nDeLinker\n0.768\n2.655\n1.302\nDiffLinker\n0.759\n2.698\n0.744\n3DLinker\n0.767\n2.690\n1.323\nHybridLinker (FFLOM)\n0.768\n2.723\n1.436\nHybridLinker (DeLinker)\n0.774\n2.649\n1.404\nof evaluation metrics in Appendix B.3. Furthermore, we\npresent the results of the ablation study on the design of\nLinkerDPS in Appendix E.\nFor baseline comparisons, we use all pretrained PC-Free and\nPC-Aware models trained on the ZINC dataset: FFLOM (Jin\net al., 2023) and DeLinker (Imrie et al., 2020) for PC-\nFree models, and 3DLinker (Huang et al., 2022) and\nDiffLinker (Igashov et al., 2024) for PC-Aware models.\nWe evaluate two implementations of HybridLinker, Hy-\nbridLinker(FFLOM) and HybridLinker(DeLinker), both uti-\nlizing DiffLinker as the diffusion-based PC-Aware model\nwhile incorporating FFLOM and DeLinker as their re-\nspective PC-Free models.\nFor all approaches, we use\nETKDGv3 (Riniker & Landrum, 2015) algorithm provided\nby RDkit (Landrum, 2022) as conformation predictor R,\nand Obabel (O’Boyle et al., 2011) as post-hoc bond predic-\ntor E. For further implementation details, see Appendix B.2.\n4.2. Result: Advanced Diversity of Valid Molecules\nWe run quantitative comparison of each linker generation\nalgorithm in Table 3, demonstrating that HybridLinker suc-\ncessfully balance both high validity and diversity while all\nthe baselines fail. The high scores in all diversity counting\nonly valid moleucles (V+U, V+N, V+HD, V+FG, V+BM),\nindicate that its diversity is driven by meaningful substruc-\ntural variations. Notably, the high V+N score highlights Hy-\nbridLinker’s ability to discover non-trivial linkers for given\nfragments. When using DeLinker as the surrogate generator,\nHybridLinker achieves the highest validity, while utilizing\nsurrogates from FFLOM boosts diversity while maintaining\ncompetitive validity. Importantly, HybridLinker also main-\ntains high Uniqueness and Novelty scores, showing that its\nsuperior diversity of valid molecules stems from a balanced\nenhancement of both validity and diversity.\n4.3. Application: Property Optimization\nProperty optimization, which aims to identify molecules\nwith high scores in specific measurements, is a direct appli-\ncation benefitted by sample diversity. Here, we demonstrate\nthat the high diversity of HybridLinker enhances property\noptimization results through the following two experiments:\nDruglikenss Optimization and Molecule Descriptor Opti-\nmization. We describe the latter experiment in Appendix E\nDruglikeness Optimization\nWe evaluate each linker gen-\neration algorithm regard to the quality of best sample they\ngenerate for given fragment. We utilize three widely recog-\nnized drug-likeness scores—QED, SA, and PLogP—where\nhigher values for QED and PLogP, and lower values for SA,\nindicate better drug-likeness. Table 4 presents the average\nscores of each algorithm across all fragments in the ZINC\ntest dataset. The results highlight HybridLinker’s strong\nperformance, specifically, HybridLinker (DeLinker) outper-\nfoms baselines in all scores while HybridLinker (FFLOM)\nalso beats the baselines except for SA.\n4.4. Discussion\nHybridLinker as a Foundational Model\nAs shown in\nTable 3, HybridLinker excels in linker generation by si-\nmultaneously achieving high diversity and validity—two\nfundamental pillars of drug discovery. Beyond its strong\nperformance in core metrics, it also demonstrates excep-\ntional results in application-driven tasks, as highlighted in\nTable 4. Moreover, as a zero-shot framework that seam-\nlessly integrates pretrained PC-Free and PC-Aware models,\nHybridLinker remains highly adaptable to future advance-\nments in these models, further enhancing its capabilities.\nThese strengths establish HybridLinker as a foundational\nframework for linker generation, offering both versatility\nand long-term scalability in molecular design.\nVersatility of LinkerDPS\nAt the core of HybridLinker\nis LinkerDPS, the first DPS approach to enable cross-\ndomain guidance from molecular topology to molecular\npoint clouds. By decomposing molecule generation into\ntwo sequential tasks, LinkerDPS facilitates the seamless\nintegration of specialized models for each domain. We an-\nticipate that its capability will extend to a broader range of\napplications, particularly in tackling complex challenges at\nthe intersection of topology and point cloud modeling by\nleveraging domain-specific expertise. Notably, large-scale\nmolecule generation—one of the most pressing challenges\nin modern drug discovery due to its complexity—could\nbecome a new frontier for LinkerDPS, offering a scalable\nsolution to this critical problem.\nWe provide discussion on the impact of balancing diversity\nand validity in drug discovery and the impact of surrogate\nquality on HybridLinker’s performance in Appendix G.\n5. Conclusion\nWe introduce HybridLinker, a zero-shot framework that inte-\ngrates pretrained PC-Free and PC-Aware models to balance\ndiversity and validity without additional training. At its core,\nLinkerDPS enables cross-domain guidance from molecular\ntopology to point clouds, decomposing molecular sampling\ninto sequential subtasks. Our results validate effectiveness\nof LinkerDPS as well as HybridLinker, and we anticipate its\napplication in scalable large-molecule generation by break-\ning complex problems into manageable steps.\n8\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nImpact Statement\nThis work aims to advance drug discovery by leveraging the\nremarkable computational power of modern artificial intelli-\ngence. While we acknowledge both the significant benefits\nand potential risks associated with our approach, such as\naccelerating drug development for emerging viral threats\nlike COVID-19 or inadvertently facilitating the discovery\nof unintended compounds, we emphasize the importance of\nresponsible application. We hope this technology will be uti-\nlized ethically to drive positive advancements in healthcare\nand pharmaceutical research.\nAcknowledgement\nThis work was supported by Institute of Information & com-\nmunications Technology Planning & Evaluation (IITP) grant\nfunded by the Korea government (MSIT) [NO.RS2021-\nII211343, Artificial Intelligence Graduate School Program\n(Seoul National University), No.2022-0-00984, No.2019-\n0-00075, Artificial Intelligence Graduate School Program\n(KAIST)]\nReferences\nBickerton, G. R., Paolini, G. V., Besnard, J., Muresan, S.,\nand Hopkins, A. L. Quantifying the chemical beauty of\ndrugs. Nat Chem, 2012(4):90–98, 1 2012. doi: 10.1038/\nnchem.1243. 2) . Published.\nChung, H., Kim, J., Mccann, M. T., Klasky, M. L., and Ye,\nJ. C. Diffusion posterior sampling for general noisy in-\nverse problems, 2024a. URL https://arxiv.org/\nabs/2209.14687.\nChung, H., Kim, J., Park, G. Y., Nam, H., and Ye, J. C.\nCfg++: Manifold-constrained classifier free guidance\nfor diffusion models, 2024b. URL https://arxiv.\norg/abs/2406.08070.\nCorso, G., St¨ark, H., Jing, B., Barzilay, R., and Jaakkola, T.\nDiffdock: Diffusion steps, twists, and turns for molecular\ndocking, 2023a. URL https://arxiv.org/abs/\n2210.01776.\nCorso, G., St¨ark, H., Jing, B., Barzilay, R., and Jaakkola, T.\nDiffdock: Diffusion steps, twists, and turns for molecular\ndocking, 2023b. URL https://arxiv.org/abs/\n2210.01776.\nDhariwal, P. and Nichol, A. Diffusion models beat gans on\nimage synthesis, 2021. URL https://arxiv.org/\nabs/2105.05233.\nErtl, P. and Schuffenhauer, A. Estimation of synthetic acces-\nsibility score of drug-like molecules based on molecular\ncomplexity and fragment contributions. J Cheminform, 1:\n8, 2009. doi: 10.1186/1758-2946-1-8.\nGao, X., Sitharam, M., and Roitberg, A. E. Bounds on\nthe jensen gap, and implications for mean-concentrated\ndistributions. arXiv preprint arXiv:1712.05267, 2017.\nGeng, Z., Xie, S., Xia, Y., Wu, L., Qin, T., Wang, J., Zhang,\nY., Wu, F., and Liu, T.-Y. De novo molecular generation\nvia connection-aware motif mining, 2023. URL https:\n//arxiv.org/abs/2302.01129.\nGhorbani, M., Gendelev, L., Beroza, P., and Keiser,\nM. J. Autoregressive fragment-based diffusion for pocket-\naware ligand design, 2023. URL https://arxiv.\norg/abs/2401.05370.\nGuan, J., Qian, W. W., Peng, X., Su, Y., Peng, J., and Ma,\nJ. 3d equivariant diffusion for target-aware molecule\ngeneration and affinity prediction, 2023. URL https:\n//arxiv.org/abs/2303.03543.\nGuan, J., Peng, X., Jiang, P., Luo, Y., Peng, J., and Ma, J.\nLinkernet: fragment poses and linker co-design with 3d\nequivariant diffusion. Advances in Neural Information\nProcessing Systems, 36, 2024.\nGutha, S. B. C., Vinuesa, R., and Azizpour, H. Inverse\nproblems with diffusion models: A map estimation per-\nspective, 2024. URL https://arxiv.org/abs/\n2407.20784.\nG´omez-Bombarelli,\nR.,\nWei,\nJ. N.,\nDuvenaud,\nD.,\nHern´andez-Lobato, J. M., S´anchez-Lengeling, B., She-\nberla, D., Aguilera-Iparraguirre, J., Hirzel, T. D., Adams,\nR. P., and Aspuru-Guzik, A. Automatic chemical de-\nsign using a data-driven continuous representation of\nmolecules.\nACS Central Science, 4(2):268–276, Jan-\nuary 2018. ISSN 2374-7951. doi: 10.1021/acscentsci.\n7b00572. URL http://dx.doi.org/10.1021/\nacscentsci.7b00572.\nHalgren,\nT. A.\nMerck molecular force field. i.\nbasis,\nform,\nscope,\nparameterization,\nand\nper-\nformance\nof\nmmff94.\nJournal\nof\nComputa-\ntional Chemistry,\n17(5-6):490–519,\n1996.\ndoi:\nhttps://doi.org/10.1002/(SICI)1096-987X(199604)17:\n5/6⟨490::AID-JCC1⟩3.0.CO;2-P.\nURL\nhttps:\n//onlinelibrary.wiley.com/doi/abs/10.\n1002/%28SICI%291096-987X%28199604%\n2917%3A5/6%3C490%3A%3AAID-JCC1%3E3.0.\nCO%3B2-P.\nHo, J. and Salimans, T.\nClassifier-free diffusion guid-\nance, 2022.\nURL https://arxiv.org/abs/\n2207.12598.\n9\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nHo, J., Jain, A., and Abbeel, P. Denoising diffusion proba-\nbilistic models, 2020a. URL https://arxiv.org/\nabs/2006.11239.\nHo, J., Jain, A., and Abbeel, P. Denoising diffusion proba-\nbilistic models, 2020b. URL https://arxiv.org/\nabs/2006.11239.\nHo, J., Salimans, T., Gritsenko, A., Chan, W., Norouzi, M.,\nand Fleet, D. J. Video diffusion models, 2022. URL\nhttps://arxiv.org/abs/2204.03458.\nHoogeboom, E., Satorras, V. G., Vignac, C., and Welling, M.\nEquivariant diffusion for molecule generation in 3d, 2022.\nURL https://arxiv.org/abs/2203.17003.\nHu, X., Liu, G., Yao, Q., Zhao, Y., and Zhang, H. Hamil-\ntonian diversity: effectively measuring molecular diver-\nsity by shortest hamiltonian circuits. Journal of Chem-\ninformatics, 16(1):94, Aug 2024. ISSN 1758-2946. doi:\n10.1186/s13321-024-00883-4. URL https://doi.\norg/10.1186/s13321-024-00883-4.\nHuang, H., Sun, L., Du, B., and Lv, W. Learning joint 2-d\nand 3-d graph diffusion models for complete molecule\ngeneration. IEEE Transactions on Neural Networks and\nLearning Systems, 2024.\nHuang, Y., Peng, X., Ma, J., and Zhang, M. 3dlinker: an\ne (3) equivariant variational autoencoder for molecular\nlinker design. arXiv preprint arXiv:2205.07309, 2022.\nHussain, J. and Rea, C. Computationally efficient algorithm\nto identify matched molecular pairs (mmps) in large data\nsets. Journal of chemical information and modeling, 50\n(3)::339–348, 2010.\nIgashov, I., St¨ark, H., Vignac, C., Schneuing, A., Satorras,\nV. G., Frossard, P., Welling, M., Bronstein, M., and Cor-\nreia, B. Equivariant 3d-conditional diffusion model for\nmolecular linker design. Nature Machine Intelligence, pp.\n1–11, 2024.\nImrie, F., Bradley, A. R., van der Schaar, M., and Deane,\nC. M. Deep generative models for 3d linker design. Jour-\nnal of chemical information and modeling, 60(4):1983–\n1995, 2020.\nIrwin, J. J., Tang, K. G., Young, J., Dandarchuluun, C.,\nWong, B. R., Khurelbaatar, M., Moroz, Y. S., Mayfield,\nJ., and Sayle, R. A. Zinc20—a free ultralarge-scale chem-\nical database for ligand discovery. Journal of chemical\ninformation and modeling, 60(12):6065–6073, 2020.\nJi, C., Zheng, Y., Wang, R., Cai, Y., and Wu, H. Graph\npolish: A novel graph generation paradigm for molecu-\nlar optimization, 2020. URL https://arxiv.org/\nabs/2008.06246.\nJin, J., Wang, D., Shi, G., Bao, J., Wang, J., Zhang, H., Pan,\nP., Li, D., Yao, X., Liu, H., et al. Fflom: A flow-based\nautoregressive model for fragment-to-lead optimization.\nJournal of Medicinal Chemistry, 66(15):10808–10823,\n2023.\nJing, B., Corso, G., Chang, J., Barzilay, R., and Jaakkola,\nT. Torsional diffusion for molecular conformer genera-\ntion, 2023. URL https://arxiv.org/abs/2206.\n01729.\nJo, J., Kim, D., and Hwang, S. J.\nGraph generation\nwith diffusion mixture. arXiv:2302.03596, 2024. URL\nhttps://arxiv.org/abs/2302.03596.\nKao, C.-T., Lin, C.-T., Chou, C.-L., and Lin, C.-C. Fragment\nlinker prediction using the deep encoder-decoder network\nfor protacs drug design. Journal of chemical information\nand modeling, 63(10):2918–2927, 2023.\nKim, T., Seo, H., Ahn, S., and Yang, E. Rebind: Enhanc-\ning ground-state molecular conformation via force-based\ngraph rewiring, 2024. URL https://arxiv.org/\nabs/2410.14696.\nKirchmair, J., Wolber, G., Laggner, C., and Langer, T.\nComparative performance assessment of the conforma-\ntional model generators omega and catalyst: a large-\nscale survey on the retrieval of protein-bound ligand\nconformations. Journal of Chemical Information and\nModeling, 46(4):1848–1861, Jul 2006. ISSN 1549-9596.\ndoi: 10.1021/ci060084g. URL https://doi.org/\n10.1021/ci060084g.\nLandrum, G. Rdkit. // www, http, 2022. rdkit.org.\nLiu, X. K. T.\nGraphpiece: Efficiently generating high-\nquality molecular graph with substructures.\narXiv\npreprint arXiv:2106.15098, 2021.\nLugmayr, A., Danelljan, M., Romero, A., Yu, F., Timofte,\nR., and Van Gool, L. Repaint: Inpainting using denoising\ndiffusion probabilistic models. In Proceedings of the\nIEEE/CVF conference on computer vision and pattern\nrecognition, pp. 11461–11471, 2022.\nMadhawa, K., Ishiguro, K., Nakago, K., and Abe, M. Graph-\nnvp: An invertible flow model for generating molecular\ngraphs. arXiv preprint, 2019.\nMaziarz, K., Jackson-Flux, H., Cameron, P., Sirockin, F.,\nSchneider, N., Stiefl, N., Segler, M., and Brockschmidt,\nM. Learning to extend molecular scaffolds with structural\nmotifs, 2024.\nURL https://arxiv.org/abs/\n2103.03864.\n10\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nO’Boyle, N. M., Banck, M., James, C. A., Morley, C.,\nVandermeersch, T., and Hutchison, G. R.\nOpen ba-\nbel: An open chemical toolbox.\nJournal of Chemin-\nformatics, 3(1):33, Oct 2011. ISSN 1758-2946. doi:\n10.1186/1758-2946-3-33. URL https://doi.org/\n10.1186/1758-2946-3-33.\nPeach, M. L., Cachau, R. E., and Nicklaus, M. C. Conforma-\ntional energy range of ligands in protein crystal structures:\nThe difficult quest for accurate understanding. Journal of\nMolecular Recognition, 30, 2017. URL https://api.\nsemanticscholar.org/CorpusID:4615425.\nPeng, X., Luo, S., Guan, J., Xie, Q., Peng, J., and Ma, J.\nPocket2mol: Efficient molecular sampling based on 3d\nprotein pockets, 2022. URL https://arxiv.org/\nabs/2205.07249.\nPeng, X., Guan, J., Liu, Q., and Ma, J. Moldiff: Addressing\nthe atom-bond inconsistency problem in 3d molecule\ndiffusion generation, 2023. URL https://arxiv.\norg/abs/2305.07508.\nRiniker, S. and Landrum, G. A. Better informed distance\ngeometry: Using what we know to improve conformation\ngeneration. J Chem Inf Model, 55(12):2562–74, 12 2015.\ndoi: 10.1021/acs.jcim.5b00654. PMID: 26575315. Epub\n2015 Nov 30.\nRombach, R., Blattmann, A., Lorenz, D., Esser, P., and\nOmmer, B. High-resolution image synthesis with latent\ndiffusion models, 2022. URL https://arxiv.org/\nabs/2112.10752.\nSchneuing, A., Harris, C., Du, Y., Didi, K., Jamasb,\nA., Igashov, I., Du, W., Gomes, C., Blundell, T.,\nLio, P., Welling, M., Bronstein, M., and Correia, B.\nStructure-based drug design with equivariant diffusion\nmodels, 2024.\nURL https://arxiv.org/abs/\n2210.13695.\nShi, C., Xu, M., Zhu, Z., Zhang, W., Zhang, M., and\nTang, J. Graphaf: a flow-based autoregressive model\nfor molecular graph generation, 2020. URL https:\n//arxiv.org/abs/2001.09382.\nSitzmann, M., Weidlich, I. E., Filippov, I. V., Liao, C.,\nPeach, M. L., Ihlenfeldt, W.-D., Karki, R. G., Borodina,\nY. V., Cachau, R. E., and Nicklaus, M. C. Pdb ligand con-\nformational energies calculated quantum-mechanically.\nJournal of Chemical Information and Modeling, 52(3):\n739–756, Mar 2012. ISSN 1549-9596. doi: 10.1021/\nci200595n.\nURL https://doi.org/10.1021/\nci200595n.\nSong, J., Meng, C., and Ermon, S. Denoising diffusion\nimplicit models, 2022. URL https://arxiv.org/\nabs/2010.02502.\nTorge, J., Harris, C., Mathis, S. V., and Lio, P. Diffhopp: A\ngraph diffusion model for novel drug design via scaffold\nhopping, 2023. URL https://arxiv.org/abs/\n2308.07416.\nVignac, C., Osman, N., Toni, L., and Frossard, P. Midi:\nMixed graph and 3d denoising diffusion for molecule\ngeneration, 2023. URL https://arxiv.org/abs/\n2302.09048.\nWang, C., Ong, H. H., Chiba, S., and Rajapakse, J. C.\nDe novo molecule generation with graph latent diffu-\nsion model. In ICASSP 2024 - 2024 IEEE International\nConference on Acoustics, Speech and Signal Process-\ning (ICASSP), pp. 2121–2125, 2024a. doi: 10.1109/\nICASSP48485.2024.10447480.\nWang, C., Ong, H. H., Chiba, S., and Rajapakse, J. C.\nDe novo molecule generation with graph latent diffu-\nsion model. In ICASSP 2024 - 2024 IEEE International\nConference on Acoustics, Speech and Signal Process-\ning (ICASSP), pp. 2121–2125, 2024b. doi: 10.1109/\nICASSP48485.2024.10447480.\nXu, M., Wang, W., Luo, S., Shi, C., Bengio, Y., Gomez-\nBombarelli, R., and Tang, J. An end-to-end framework\nfor molecular conformation generation via bilevel pro-\ngramming, 2021. URL https://arxiv.org/abs/\n2105.07246.\nXu, M., Yu, L., Song, Y., Shi, C., Ermon, S., and Tang, J.\nGeodiff: a geometric diffusion model for molecular con-\nformation generation, 2022. URL https://arxiv.\norg/abs/2203.02923.\nXu, M., Powers, A., Dror, R., Ermon, S., and Leskovec,\nJ. Geometric latent diffusion models for 3d molecule\ngeneration, 2023. URL https://arxiv.org/abs/\n2305.01140.\nYang, L., Zhang, Z., Song, Y., Hong, S., Xu, R., Zhao, Y.,\nZhang, W., Cui, B., and Yang, M.-H. Diffusion models: A\ncomprehensive survey of methods and applications, 2024.\nURL https://arxiv.org/abs/2209.00796.\nYou, J., Liu, B., Ying, Z., Pande, V., and Leskovec, J.\nGraph convolutional policy network for goal-directed\nmolecular graph generation.\nIn Bengio, S., Wallach,\nH., Larochelle, H., Grauman, K., Cesa-Bianchi, N.,\nand Garnett, R. (eds.), Advances in Neural Information\nProcessing Systems, volume 31. Curran Associates, Inc.,\n2018.\nURL https://proceedings.neurips.\ncc/paper_files/paper/2018/file/\nd60678e8f2ba9c540798ebbde31177e8-Paper.\npdf.\n11\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nZhang, H., Huang, J., Xie, J., Huang, W., Yang, Y., Xu, M.,\nLei, J., and Chen, H. Grelinker: A graph-based generative\nmodel for molecular linker design with reinforcement and\ncurriculum learning. Journal of Chemical Information\nand Modeling, 64(3):666–676, 2024.\nZheng, C., Lan, Y., and Wang, Y.\nLanpaint: Training-\nfree diffusion inpainting with exact and fast conditional\ninference, 2025. URL https://arxiv.org/abs/\n2502.03491.\nZhou, X., Cheng, X., Yang, Y., Bao, Y., Wang, L., and Gu,\nQ. Decompopt: Controllable and decomposed diffusion\nmodels for structure-based molecular optimization, 2024.\nURL https://arxiv.org/abs/2403.13829.\n12\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nA. Extended Definition of Validity\nIn this work, we extend the previous definition of molecule validity, focusing on each topology representation, to reflect its\npoint cloud representations, which is a crucial consideration to make the the validity indicates its stability in 3D space where\nthey serve a drug. We accounts for not only the valence rule in molecular topology but also the coherence of molecular\npoint cloud with the topology. Molecular potential energy U is adopted to score the pair of topology and point cloud. We\ndetermine the validity of given molecule based on its conformation energy, the gap of its energy the its optimal energy\nattained in its most stable conformation without external constraints as fragments condition. To clarify, higher conformation\nenergy means the molecule is unstable, also can be interpreted by Boltzmann distribution. We choos the widely used cut-off\n25(kcal / mol) (Sitzmann et al., 2012; Kirchmair et al., 2006; Peach et al., 2017) of practically allowable conformation energy\nas our threshold τ val, and label the molecule valid if its conformation energy is lower than the τ val. We use RDKit (Landrum,\n2022) to compute U and molecule’s optimal conformation.\nFigure 6. Extended definition of molecular validity, accounting for its point cloud feature as well as topological valence rule via utilizing\nconformation energy.\n13\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nB. Experimetal Details\nB.1. Dataset Construction\nFollowing DeLinker (Imrie et al., 2020), we select a subset of 250,000 molecules from the ZINC dataset. The energetically\nstable conformation of each molecule is determined using MMFF force field optimization (Halgren, 1996) implemented\nin RDKit (Landrum, 2022). As in prior work (Hussain & Rea, 2010), molecular fragmentation is performed by applying\ndouble bond cuts on acyclic single bonds that are not part of functional groups. Following the preprocessing steps in\nDeLinker (Imrie et al., 2020), we construct 418,797 fragment-linker pairs and further select 400 pairs as our test set, aligning\nwith the test set used in DeLinker (Imrie et al., 2020). In this study, we exclusively use the test set to evaluate HybridLinker,\nas our method does not require additional training but instead operates in a zero-shot manner using pretrained models.\nB.2. Implmentation of Baselines and HybridLinker\nWe compare HybridLinker with recent baselines for linker generation, falls into either PC-Free models or PC-Aware models.\nFFLOM (Jin et al., 2023) and DeLinker (Imrie et al., 2020) are included to represents PC-Free models. For the PC-Free\nmodels, we adopt the strong and easy-to-use conformation generation algorithm, ETKDG (Riniker & Landrum, 2015), to\npredict conformation of molecule topology they generate. For PC-Aware models, we include 3DLinker (Huang et al., 2022)\nand DiffLinker (Igashov et al., 2024) as baseline models.\nHybridLinker is implemented utilizing both pretrained PC-Free models and PC-Aware models, respectively. As far we know,\nDiffLinker is the only strong PC-Aware baseline, and we adopt it in HybridLinker’s second stage. As for the PC-Free model\nin the first step, we utilze FFLOM and DeLinker, as the two are only strong PC-Free baselines. In the experiment, we refer\nthe PC-Free model in HybridLinker’s first stage as surrogate generator. Note that we do not conduct additional training\nof baselines. Further, we found that if surrogate molecule ˜G from the first stage is already valid, skipping second stage to\nsample G but directly sample G = ˜G is effective to achieve high performance. We follow this scheme in our experiments.\nFurther, we use ETKDGv3 (Riniker & Landrum, 2015) algorithm provided by RDkit (Landrum, 2022) as the off-the-shelf\nconformation predictor R, and Obabel (O’Boyle et al., 2011) as post-hoc bond predictor E.\nB.3. Evaluation Metrics\nIn Section 4.2, we first evaluate the samples generated by each algorithm based on their validity and diversity. Notably,\nwe extend the definition of Validity from prior works to account for both valence rules in bonding topology and energetic\nstability in the 3D graph. To evaluate sample diversity, we incorporate standard metrics such as Uniqueness and Novelty.\nHowever, unlike prior works that define Novelty as the fraction of novel molecules, we compute it as the fraction of\nmolecules that are both unique and novel. Additionally, we introduce three more diversity metrics introduced in (Hu et al.,\n2024)—HamDiv, FG, BM—to capture diversity from different perspectives, specifically, molecule fingerprint, number\nof unique functional group, and number of unique molecular scaffolds, respectively. We follow the implementation in the\nrepository (https://github.com/HXYfighter/HamDiv) to caculate them. We also heavily focus on calculating each diversity\nscore counting only the valid molecules (diversity metrics for valid molecules).In the main paper, we denote them as V+U\n(Uniqueness), V+N (Novelty), V+HD (HamDiv), V+FG (FG), and V+BM (BM). For instance, the calculation of V+U for a\ngiven fragment pair differs from that of Uniqueness as follows:\nUniqueness = |S|\nN ,\nV + U = |{T | T ∈S, T is valid}|\nN\n,\n(22)\nwhere S = {Ti}N\ni=1 represents the set of topologies for the N generated molecules corresponding to the fragment pair. The\nother diversity metrics for valid molecules are computed in a similar manner. All metrics above are first calculated for 50\nsamples for each fragments, and averaged over the test fragments.\nWe also evaluate the drug-likeness and chemical properties of the generated samples. In Section 4.3, we compare the\ndrug-likeness of samples from each algorithm. For drug-likeness scoring, we use QED(Bickerton et al., 2012), SA(Ertl &\nSchuffenhauer, 2009), and PLogP(You et al., 2018), which measure general drug quality, synthetic accessibility, and the\noctanol-water partition coefficient penalized by the synthetic accessibility score, respectively.\n14\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nC. Algorithmic Comparison on PC-Aware model, PC-Free model, and HybridLinker\nHere, we illustrate the algorithmic distinction of HybridLinker compared to PC-Aware and PC-Free models. While PC-\nAware and PC-Free models perform either PC-Aware or PC-Free inference, specializing in validity or diversity respectively,\nHybridLinker integrates both inference types in two-step pipeline, effectively leveraging the strengths of both approaches.\nAlgorithm 1 PC-Aware Linker Generation Model (Diffusion-based)\ninput fragments G1 = (T , R1) = (V1, E1, R1), G2 = (T2, R2) = (V2, E2, R2), PC-Aware condition F = G1 ∩G2, pretrained score\nestimator sθ∗, bond predictor E, noise levels {˜σt}N\nt=1\n1: xT ∼N(0, I)\n◁run reverse process for linker atom generation\n2: for t = T, . . . , 1 do\n3:\nˆs ←sθ∗(xt, t, F)\n◁estimate score ∇xt log pt(xt)\n4:\nz ∼N(0, I)\n5:\nˆx ←\n1\n√¯αt (xt + (1 −¯αt)ˆs)\n◁compute ˆx ≈Eq(x0|x0)[x0]\n6:\nxt−1 ←\n√αt(1−¯αt−1)\n1−¯αt\nxt +\n√\n¯αt−1βt\n1−¯αt\nˆx + ˜σtz\n◁update xt−1\n7: end for\n8: (v′, R′) ←x0\n9: V ′\nargmax\n←−−−v′\n10: E′ ←E(V ′, R′)\n11: G′ ←(V ′, E′, R′)\n12: return G′\nAlgorithm 2 PC-Free Linker Generation Model\ninput fragments G1 = (T , R1) = (V1, E1, R1), G2 = (T2, R2) = (V2, E2, R2), PC-Free condition Tcond = T1 ∩T2, PC-Aware\ncondition F = G1 ∩G2, parameterized function for PC-Free model fθF , conformation predictor R\n1: T ′ ←fθF (Tcond)\n◁sample topology from topology condition: T ′ ∼PT |Tcond\n2: R′ ←R(T ′, F)\n◁conformation prediction R′ ∼PR|T (R′, T ′)\n3: G′ ←(T ′ | R′, F)\n4: return G′\nAlgorithm 3 HybridLinker\ninput fragments G1 = (T , R1) = (V1, E1, R1), G2 = (T2, R2) = (V2, E2, R2), PC-Free condition Tcond = T1 ∩T2, PC-Aware\ncondition F = G1 ∩G2, pretrained score estimator for diffusion-based PC-Aware model sθ∗, parameterized function for PC-Free\nmodel fθF , conformation predictor R, bond predictor E\n1: ˜T ←fθF (Tcond)\n2: ˜R ←R(T ′, F)\n3: ˜G ←( ˜T , ˜R)\n◁1st Stage (PC-Free Generation): ˜G ∼P2D( ˜G | F)\n4: if ˜G is invalid then\n5:\n(V ′, R′) ←LinkerDPS(sθ∗, F, ˜G)\n◁for invalid ˜G, run LinkerDPS with PC-Aware model to enhance validity\n6:\nE ←E(V ′, R′)\n7:\nG′ ←(V ′, E′, R′)\n8: else\n9:\nG′ ←˜G\n◁for valid ˜G, set G = ˜G\n10: end if\n◁2nd Stage (PC-Aware Generation): G′ ∼PG|2D(G′ | ˜G, F)\n11: return G′\n15\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nD. Details of LinkerDPS\nD.1. Overview on Diffusion Posterior Sampling\nDiffusion Posterior Sampling (DPS) (Chung et al., 2024a) is a novel method for addressing noisy inverse problems using\ndiffusion models. Diffusion models, which are typically employed for generative tasks, works in reverse process of diffusion\nforward pass that progressively add noise to data.\nFormally, the diffusion forward process is governed by\nxt = √¯αtx0 +\n√\n1 −¯αtϵ,\nϵ ∼N(0, I),\nt ∈[0, T]\n(23)\nwhere ¯αt is a variance scheduler that decrease from 1 at t = 1 to 0 at t = 0 and x0 is the clean ground truth image from the\ndata distribution pdata.\nTo recover the data generating distribution, we can use the reverse process defined as\ndxt =\n\u0002\nf(xt, t) + g2(t)∇xt log p(xt)\n\u0003\ndt + g(t)d ¯wt,\nt ∈[0, T]\n(24)\nwhere the drift coefficient f is defined by f(xt, t) = 1\n2βtxt and diffusion coefficient g is defined by g(t) = √βt for\nβt = −\n1\n√¯αt\nd¯αt\ndt . Further, ¯w is a standard Wiener process flows backward from t = T to t = 0 and dt is an infinitesimal\nnegative timestep. Here, since the score ∇xt log p(xt) is intractable, the neural score network sθ∗where\nθ∗= arg min\nθ\nEt∼u(ϵ,1),xt∼p(xt|x0),x0∼pdata\n\u0002\n∥sθ(xt, t) −∇xt log p(xt|x0)∥2\u0003\n(25)\nfor a very small positive constant ϵ ≃0.\nNow, we sample data from the posterior p(x|y) given noisy measurement y that is derived from x.\nThe strength of DPS is that we only need the likelihood p(y|x) which is the normal distribution of mean A(x) with forward\noperator A, in addition to pretrained non-conditional score network sθ∗approximating ∇xt log p(xt).\nThis time, we transform the Equation (24) into the conditional SDE as following:\ndxt =\n\u0002\nf(xt, t) + g2(t)∇xt log p(xt|y)\n\u0003\ndt + g(t)d ¯wt,\nt ∈[0, T]\n(26)\nBased on the Bayes’ rule, the new score ∇xt log p(xt|y) is decomposed into\n∇xt log p(xt|y) = ∇xt log p(xt) + ∇xt log p(y|xt).\n(27)\nFurther, Theorem D.3 proposed approximation for likelihood score\n∇xt log p(y|xt) = ∇xt ˆx0(xt)∇x0 log p(y|x0 = ˆx0)\n(28)\nwhere ˆx0 =\n1\n√αt (xt + (1 −αt)sθ∗(xt, t)). Now, this term is computable using backward-propagation on tractable\ncomputation ˆx0 and log p(y|x0). The final shape becomes\ndxt =\n\u0002\nf(xt, t) + g2(t)(∇xt log p(xt) + ∇xt ˆx0(xt)∇x0 log p(y|x0 = ˆx0))\n\u0003\ndt + g(t)d ¯wt,\nt ∈[0, T]\n(29)\n16\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nD.2. DPS Approximation\nExploiting Definition D.1, (Chung et al., 2024a) proposed Theorem D.3 about DPS approximation.\nDefinition D.1 (Jensen Gap (Gao et al., 2017)). Let x be a random variable with distribution p(x). For some function f that\nmay or may not be convex, the Jensen gap is defined as\nJ (f, x ∼p(x)) = E[f(x)] −f(E[x]),\n(30)\nwhere the expectation is taken over p(x).\nDefinition D.2. The general form of the forward model of an inverse problem can be stated as\ny = A(x0) + ϵ\n(31)\nwhere y, ϵ ∈Rn, x0 ∈Rd and A(·) : Rd 7→Rn is the forward measurement operator and ϵ is the measurement noise.\nTheorem D.3. For the measurement model defined in Definition D.2 with ϵ ∼N(0, σ2I), we have\np(y | xt) ≈p(y | ˆx0)\n(32)\nwhere the approximation error can be quantified with the Jensen gap, which is upper bounded by\nJ ≤\nd\n√\n2πσ2 e−1/2σ2∥∇xA(x)∥m1,\n(33)\nwhere ∥∇xA(x)∥:= maxx ∥∇xA(x)∥and m1 :=\nR\n∥x0 −ˆx0∥p(x0|xt) dx0.\n17\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nD.3. Adaptation of DPS Approximation\nInspired by Theorem D.3, we propose Theorem D.4 about LinkerDPS approximation exploting (D.5) and (D.6). Theorem D.4\nprovides the reasoning for line 12 in Algorithm 4, where we approximate ∇rtp( ˜E, ˜R | rt, V ) ≃∇rtp( ˜E, ˜R | ˆr). This\napproximation is what allows all terms in the algorithm to be analytically tractable, as the measurement distribution is given.\nTheorem D.4. (LinkerDPS Approximation) For the given cross domain measurement model,\np( ˜E, ˜R | r) = 1\nZ e−[ϕ1(r ; ˜\nR)/2σ2\n1+ϕ2(r ; ˜\nE)/σ2]\n(34)\nwhere σ1, σ2 ∈R and ϕ1, ϕ2 are defined as\nϕ1(r ; ˜R) := ∥˜R −r∥2,\nϕ2(r ; ˜E) :=\nX\n1≤i,j≤|V |\n1 ˜\nEi,j̸=0∥ri −rj∥,\n(35)\nwe have\npt( ˜E, ˜R|rt, V ) ≃p( ˜E, ˜R|ˆr),\n(36)\nwhere ˆr0 is the expectation of r0 given V and the approximation error for (36) can be quantified with the Jensen gap, which\nis upper bounded by\nJ ≤Lm1,\n(37)\nwhere L = 1\nZ ·\n\u0010\ne−1/2\nσ1\n+ N3/2\nσ2\n\u0011\n, and m1 :=\nR\n∥r0 −ˆr0∥p(r0|rt, V ) dr0.\nproof of Theorem D.4.\np( ˜E, ˜R | rt, V ) =\nZ\np( ˜E, ˜R | r0)p(r0 | rt, V )dr0\n(38)\n= Er0∼p(r0|rt,V )[f(r0)]\n(39)\nwhere, f(r) := p( ˜E, ˜R | r).\nNow, the approximation error of (36) becomes the Jensen gap as\npt( ˜E, ˜R | rt, V ) −p( ˜E, ˜R|ˆr0) = |E[f(r0)] −f(E[r0])|\n(40)\nLeveraging Lemma D.5 and Proposition D.6, the Jensen gap has upper bound as\n|E[f(r0)] −f(E[r0])| ≤Lm1\n(41)\nwhere L = 1\nZ ·\n\u0010\ne−1/2\nσ1\n+ N3/2\nσ2\n\u0011\n, m1 =\nR\n∥r0 −ˆr∥p(r0|rt, V ) dr0.\nLemma D.5. Let f(r) := p( ˜E, ˜R | r). There exists a constant L such that ∀r, r∗∈R3N,\n∥f(r) −f(r∗)∥≤L∥r −r∗∥,\n(42)\nwhere L = 1\nZ ·\n\u0010\ne−1/2\nσ1\n+ N3/2\nσ2\n\u0011\n.\n18\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nproof of Lemma D.5.\nmax\nr\n∥∇rf(r)∥= max\nr\n∥f(r) ·\n\u0012\n−1\n2σ2\n1\n· ∇rU1( ˜R | r) −1\nσ2\n· ∇rU2( ˜E | r)\n\u0013\n∥\n≤max\nr\n∥f(r) ·\n\u0012\n−1\n2σ2\n1\n· ∇rU1( ˜R | r)\n\u0013\n∥+ max\nr\n∥f(r) ·\n\u0012\n−1\nσ2\n· ∇rU2( ˜E | r)\n\u0013\n∥\n= max\nr\n∥f(r) ·\n \n−r −˜R\nσ2\n1\n!\n∥+ max\nr\n∥f(r) ·\n\u0012\n−1\nσ2\n· ∇rU2( ˜E | r)\n\u0013\n∥\n= 1\nσ1\n· max\nr\n \nf(r) · ∥r −˜R\nσ1\n∥\n!\n+ 1\nσ2\n· max\nr\n∥f(r) · ∇rU2( ˜E | r)∥\n≤1\nZ ·\n\u0012e−1/2\nσ1\n+ N 3/2\nσ2\n\u0013\n(43)\nwhere the last two equations are from\nmax\nr\n \nf(r) · ∥r −˜R\nσ1\n∥\n!\n= max\nr\n \ne−∥r−˜\nR∥2/(2σ2\n1)\nZ\n· ∥r −˜R\nσ1\n∥\n!\n= max\nz∈R+\nz · e−z2/2\nZ\n= e−1/2\nZ\n(44)\nand\nmax\nr\n∥f(r) · ∇rU2( ˜E | r)∥≤1\nZ · max\nr\n∥∇rU2( ˜E | r)∥\n≤1\nZ ·\np\nN · (N)2\n≤N 3/2\nZ\n(45)\nThen, we have\n∥f(r) −f(r∗)∥≤max\nr\n∥∇rf(r)∥· ∥r −r∗∥\n≤1\nZ ·\n\u0012e−1/2\nσ1\n+ N 3/2\nσ2\n\u0013\n· ∥r −r∗∥\n(46)\nProposition D.6 (Jensen gap upper bound (Gao et al., 2017)). Define the absolute cenetered moment as mp :=\npp\nE[|X −µ|p], and the mean as µ = E[X]. Assume that for α > 0, there exists a positive number K such that for\nany x ∈Rd, |f(x) −f(µ)| ≤K|x −µ|α. Then,\n|E[f(X) −f(E[X])]| ≤\nZ\n|f(X) −f(µ)|dp(X)\n≤K\nZ\n|x −µ|αdp(X) ≤Kmα\nα.\n(47)\n19\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nD.4. Computation of Guidance Term in LinkerDPS\nWe show that the ∇rt log p( ˜E, ˜R | ˆr) in (21) is tractable as follows.\nWe first apply chain rule and have\n∇rt log p( ˜E, ˜R | ˆr) = ∇rtˆr · ∇ˆr log p( ˜E, ˜R | ˆr)\n(48)\nLeveraging ˆr =\n1\n√αt (rt + (1 −αt) · sr\nθ∗(rt, t | V )), the former term ∇rtˆr can be computed using autograd.\nThe latter ∇ˆr log p( ˜E, ˜R | ˆr) is expressed as\n∇ˆr log p(y|ˆr) = −∇ˆrϕ1(ˆr ; ˜R) −∇ˆrϕ2(ˆr ; ˜E),\n(49)\nwhere\nϕ1(ˆr ; ˜R) := ∥˜R −ˆr∥2,\nϕ2(ˆr ; ˜E) :=\nX\n1≤i,j≤|V |\n1 ˜\nEi,j̸=0∥ˆri −ˆrj∥,\n(50)\n∇ˆrϕ1 and ∇ˆrϕ2 are computed in straightforward as\n∇ˆriϕ1(ˆr ; ˜R) = −2( ˜Ri −ˆri)T\n∇ˆriϕ2(ˆr ; ˜E) = −2\nX\n1≤j≤|V |\n1 ˜\nEi,j̸=0(ˆri −ˆrj)T\n∥ˆri −ˆrj∥\n,\n(51)\nwhich makes (49) tractable.\n20\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nD.5. Conditional Score Estimator\nLeveraging pretrained score estimator sθ∗:\nsθ∗(vt, rt, t, F) = ∇vt,rt log pt(vt, rt),\n(52)\nwe introduce the conditional score estimator sr\nθ∗:\nsr\nθ∗(rt, t, v0, F) = ∇rt log pt(rt|v0).\n(53)\nWe define its operation as\nsr\nθ∗(rt, t, v0, F) = mr ⊙sθ∗(vt, rt, t, F),\nwhere\nvt ∼N(\np\n1 −βtv0, βtI)\n(54)\nwhere mr⊙is the masking operation that eliminates dimensions for v and remains those for r.\nTo validate its estimation, we utilize the following decoupling approximation (Lugmayr et al., 2022; Zheng et al., 2025):\np(vt, rt | v0) ≈p(rt | vt) · p(vt | v0)\n(55)\nIt assumes vt following forward process p(vt | v0) has sufficient information on v0, to clarify, p(rt | vt, v0) ≈p(rt | vt).\nLeveraging independence of vt and rt given v0 as\np(vt | rt, v0) = p(vt | v0),\n(56)\nwe have\np(rt | v0) = p(vt, rt | v0)\np(vt | rt, v0)\n≈p(vt, rt) · p(vt | v0)\np(vt) · p(vt | rt, v0)\n= p(vt, rt) · p(vt | v0)\np(vt) · p(vt | v0)\n= p(vt, rt)\np(vt)\n(57)\nBased on this approximation, we estimate conditional score as\n∇rt log p(rt|v0) ≈∇rt log p(vt, rt)\np(vt)\n= ∇rt log p(vt, rt)\n= mr ⊙∇vt,rt log p(vt, rt)\n= mr ⊙sθ∗(vt, rt, t, F)\n(58)\nwhich validates (54).\n21\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nD.6. Algorithm for LinkerDPS\nWe describe alorithm of LinkerDPS in Algorithm 4, which is to adopt ancestral sampling (Ho et al., 2020a) with our\nreverse process discussed in Section 3.3. Similarly to prior work (Chung et al., 2024a), we choose step size {ξt}T\nt=1 to be\nξt =\nξ′\n∥∇ˆr(U1( ˜\nR|ˆr)+U2( ˜\nE|ˆr))∥with ξ′ = 0.01.\nAlgorithm 4 LinkerDPS\ninput pretrained score network of PC-Aware model sθ∗, PC-Aware fragment condition F, surrogate molecule ˜G,\nϕ1(r ; ˜R) := ∥˜R −r∥2, ϕ2(r ; ˜E) := P\n1≤i,j≤|V | 1 ˜\nEi,j̸=0∥ri −rj∥, step size {ξt}T\nt=1, noise level {˜σt}N\nt=1,\n1: ( ˜V , ˜E, ˜R) ←˜G\n2: V ′ ←˜V\n3: v0\ncontinuous\n←−−−−−\nembedding V ′\n4: rT ∼N(0, I)\n◁run reverse process on r\n5: for t = T, . . . , 1 do\n6:\nϵ ∼N(0, I)\n7:\nvt ←√¯αtv0 + (1 −¯αt)ϵ\n8:\nˆs ←sθ∗(vt, rt, t, F)\n◁estimate conditional score ∇rt log pt(rt | v0)\n9:\nˆr ←\n1\n√¯αt (rt + (1 −¯αt)ˆs)\n◁compute ˆr ≈Eq(r0|rt,v0)[r0]\n10:\nz ∼N(0, I)\n11:\nr′\nt−1 ←\n√αt(1−¯αt−1)\n1−¯αt\nrt +\n√¯αt−1βt\n1−¯αt\nˆr + ˜σtz\n12:\nrt−1 ←r′\nt−1 −ξt∇rt\n\u0010\nϕ1(r ; ˜R) + ϕ2(r ; ˜E)\n\u0011\n◁apply guidance from the ˜E, ˜R\n13: end for\n14: R′ ←r0\n15: return (V ′, R′)\n22\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nE. Property Optimization: Descriptor Optimization\nIn this experiment, we identify the molecule whose descriptor value is closest to a randomly sampled target value to assess\nthe effectiveness of each generation algorithm. The target value is drawn from an approximated Gaussian distribution of the\ndescriptors of reference molecules in the test dataset. We then select the molecule that minimizes the descriptor distance to\nthe target value. This minimum distance serves as the evaluation metric, where a smaller value indicates that the algorithm\nbetter captures a diverse range of molecular properties. We consider five molecular descriptors: Ipc, MolLogP, MolWt,\nTPSA, and LabuteASA. Table 5 presents the average score of each algorithm across the fragments in the ZINC test dataset.\nThe results highlight the strength of HybridLinkers, as they achieve the best or second-best scores across most descriptors.\nTable 5. Comparison of algorithms based on descriptor optimization. The values represent the minimum MAE between the target value\nand values of generated samples for given fragment.\nMethod\nIpc\nMolLogP\nMolWt\nTPSA\nLabuteASA\nFFLOM\n0.216\n0.135\n0.133\n0.145\n0.154\nDeLinker\n0.218\n0.085\n0.138\n0.114\n0.141\nDiffLinker\n0.219\n0.114\n0.172\n0.132\n0.177\n3DLinker\n0.217\n0.101\n0.124\n0.107\n0.135\nHybridLinker (FFLOM)\n0.209\n0.087\n0.117\n0.099\n0.139\nHybridLinker (DeLinker)\n0.213\n0.064\n0.127\n0.076\n0.134\n23\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nF. Ablation Study\nThe refinement process using LinkerDPS plays a central role in HybridLinker. To assess the contribution of each component\nin p( ˜G | V, R)—namely, the likelihood of atoms, bonds, and conformation, each providing three types of guidance—we\nconduct an ablation study in Table 4. Variants of LinkerDPS (A-DPS) are tested by selectively removing specific likelihood\ncomponents. Additionally, we introduce a version where the likelihood of atoms is modeled as a continuous distribution\nusing a Gaussian kernel:\np(˜v | v) ∝κ(˜v, v),\n(59)\nwhich allows for a continuous representation of atomic properties. To implement this, we employ the following reverse\nprocess:\ndxt =\nh\nf(xt, t) + g2(t)∇xt log pt(xt | ˜V , ˜E, ˜R)\ni\ndt + g(t)d ¯Wt,\n(60)\nwhere xt follows the prior distribution induced by the forward process of p(v, R | F). The LinkerDPS approximation for\npt( ˜V , ˜E, ˜R | xt) is straightforward to adapt, and we apply this approximation to compute the score in (60).\nTable 6 reveals that even variants using a single type of guidance outperform baseline methods. Performance improves\nfurther when combining two types, with the best results achieved when all three guidance components are incorporated. The\nmarginal gains from additional guidance suggest that each component provides complementary yet overlapping information\nabout molecular topology. Notably, relaxing the condition on atoms reduces molecular diversity, while the strict constraint\non atoms ensures the preservation of surrogate atoms, reinforcing its role in maintaining molecular consistency. While\nvalidity slightly improves in the absence of inpainting, this is likely due to the repeated generation of certain valid molecules,\nas reflected in the decline of diversity metrics that count only valid molecules (V+U and V+N).\nTable 6. Ablation study on likelihood type in LinkerDPS. The rightmost two columns represent diversity of valid molecules. The\nlikelihood components used in each variant are denoted with A (Atom), E (Bond), and R (conformation).\nGuidance Type\nUnique\nNovel\nValid\nV+U\nV+N\nE\n57.17\n33.55\n76.89\n49.82\n29.30\nR\n57.68\n33.47\n76.89\n49.93\n28.97\nA\n65.10\n41.79\n68.39\n53.59\n33.71\nA + E\n67.20\n44.10\n69.23\n54.59\n35.08\nA (DPS) + E + R\n61.61\n37.76\n75.65\n52.12\n31.61\nA + E + R (Ours)\n68.45\n44.69\n69.14\n55.10\n35.17\n24\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nG. Additional Discussion on Experimental Results\nImpact of Balancing Diversity and Validity in Drug Discovery\nBalancing diversity and validity is a fundamental\nchallenge in drug discovery, as it directly determines the success of downstream applications. Our experimental results\nfurther reinforce this: HybridLinker’s strength in Table 3 translates to superior performance in Table 4. The findings reveal\nthat models excelling in only one aspect—either generating diverse but invalid molecules or producing valid but overly\nconstrained structures—lack practical utility in drug design. This highlights the necessity of striking a balance between\ndiversity and validity for practical applications, establishing HybridLinker as a crucial framework for advancing molecular\ngeneration in drug discovery.\nImpact of surrogate quality on HybridLinker’s performance\nComparing the two HybridLinker implementations\nin Table 3, each utilizing FFLOM and DeLinker as surrogate generators, highlights the impact of surrogate quality\non HybridLinker’s performance. FFLOM exhibits higher Uniqueness and Novelty than DeLinker, and accordingly,\nHybridLinker(FFLOM) achieves superior scores in these metrics compared to HybridLinker(DeLinker). Conversely,\nHybridLinker(DeLinker) demonstrates higher validity, reflecting DeLinker’s tendency to generate more valid molecules\nthan FFLOM. A similar trend is observed in property optimization results presented in Table 4 and Table 5, where DeLinker-\nproduced molecules generally exhibit better drug-likeness, which corresponds to HybridLinker(DeLinker) achieving stronger\ndrug-likeness scores. Likewise, in the molecular descriptor optimization task, implementations using surrogates that perform\nwell for specific descriptors tend to show better optimization results for those properties. Furthermore, the effectiveness\nof LinkerDPS in molecule refinement is evident in Table 3. While HybridLinker(DeLinker) retains higher validity than\nHybridLinker(FFLOM), the validity gap between them significantly narrows. This suggests that LinkerDPS successfully\nrefines invalid molecules into valid ones, effectively mitigating the initial disparity between FFLOM and DeLinker.\n25\n\nHybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation\nH. Related Works: Molecule Generation and Guidance on Diffusion Models\nFragment-Based Drug Design.\nFragment-Based Drug Design (FBDD) (Jin et al., 2023; Igashov et al., 2024; Torge\net al., 2023; Imrie et al., 2020; Huang et al., 2022) is a drug discovery approach that utilizes small molecular fragments\nand optimizes them into larger, more potent drug candidates. Deep learning-based FBDD encompasses a variety of tasks,\neach distinguished by its learning objective. Linker Generation (Igashov et al., 2024; Huang et al., 2022) is a fundamental\ntask in FBDD, where two molecular fragments are connected to form a complete molecule. Similarly, Topology Linker\nGeneration (Jin et al., 2023; Imrie et al., 2020; Zhang et al., 2024) focuses on linking the topological graphs of fragments to\ngenerate a complete molecular topology graph. Scaffold Hopping (Torge et al., 2023; Zhou et al., 2024) involves replacing\nthe core structure of a given molecule while preserving its biological activity. PROTAC Design (Guan et al., 2024; Kao\net al., 2023) focuses on generating molecules that incorporate fragment linkers with flexible rotation and translation in 3D\nspace. Fragment Growing (Maziarz et al., 2024; Ghorbani et al., 2023) expands single small molecular fragment into larger\ndrug-like structure. Our work specifically addresses Linker Generation, tackling the critical trade-off between diversity and\nvalidity observed in existing models. Table 1 Summarizes the tasks in FBDD along with two standard molecular generation\ntasks—De Novo Generation and Conformation Generation.\nMolecule Generation.\nMolecule generation (Hoogeboom et al., 2022; Vignac et al., 2023; Wang et al., 2024b; Liu, 2021;\nMadhawa et al., 2019; Schneuing et al., 2024) based on deep learning plays a crucial role in drug discovery and is broadly\ncategorized into De Novo Molecule Generation(Peng et al., 2023; Geng et al., 2023; Vignac et al., 2023; Jo et al., 2024),\nFragment-Based Drug Design(Jin et al., 2023; Igashov et al., 2024; Torge et al., 2023; Imrie et al., 2020; Huang et al.,\n2022), Target-Aware Drug Design(Guan et al., 2023; Corso et al., 2023a; Schneuing et al., 2024; Peng et al., 2022), and\nConformer Generation(Xu et al., 2022; Kim et al., 2024; Jing et al., 2023; Xu et al., 2021), based on their input and output\nformulations. Molecule generation can also be classified into three sub-tasks: Topology Generation(Shi et al., 2020; Geng\net al., 2023; Jin et al., 2023; Jo et al., 2024; Ji et al., 2020; Wang et al., 2024b;a), Point Cloud Generation(Hoogeboom\net al., 2022; Xu et al., 2023; Igashov et al., 2024; Guan et al., 2023; Schneuing et al., 2024), and 3D Graph Generation,\nwhere deep learning models learn the distributions of molecular bonding topology, spatial coordinates, and 3D molecular\ngraph representations, respectively. Our work falls under Fragment-Based Drug Design, introducing a hybrid approach that\nleverages pretrained models for topology and point cloud generation in a zero-shot manner.\nGuidance on Diffusion Models.\nDiffusion models (Ho et al., 2020b; Song et al., 2022; Rombach et al., 2022; Ho et al.,\n2022; Jo et al., 2024; Hoogeboom et al., 2022; Vignac et al., 2023) have demonstrated exceptional performance across\nvarious generative tasks, including image, video, graph, and molecular generation. A recent advancement in diffusion\nmodels is conditional generation (Ho & Salimans, 2022; Chung et al., 2024a;b; Dhariwal & Nichol, 2021), which enables\nsampling from a conditional distribution based on desired properties. This is achieved by incorporating a guidance term into\nthe backward diffusion process. To compute the guidance term, Classifier Guidance (Dhariwal & Nichol, 2021) employs a\nclassifier trained to estimate the likelihood of a given property, while Classifer-Free Guidance (CFG) (Dhariwal & Nichol,\n2021) replaces the classifier with a conditional diffusion model. CFG++ (Chung et al., 2024b) is designed to mitigate\noff-manifold sampling issues, and Diffusion Posterior Sampling (DPS) (Chung et al., 2024a) was developed to solve\nnonlinear noisy inverse problems. In this paper, we introduce the first DPS-based method for guiding diffusion models in\nmolecular point cloud generation using molecular topology. Our approach introduces a novel energy-based function that\neffectively bridges topological and spatial molecular representations.\n26\n",
  "metadata": {
    "source_path": "papers/arxiv/HybridLinker_Topology-Guided_Posterior_Sampling_for_Enhanced_Diversity\n__and_Validity_in_3D_Molecular_Linker_Generation_91c1203d8de7dc5f.pdf",
    "content_hash": "91c1203d8de7dc5f65398efb4d61bd6f6a788feb69ffbd1c833194b57d50cf6e",
    "arxiv_id": null,
    "title": "HybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation",
    "author": "Minyeong Hwang, Ziseok Lee, Kwangsoo Kim, Kyungsu Kim, Eunho Yang",
    "creation_date": "D:20250225030308Z",
    "published": "2025-02-25T03:03:08",
    "pages": 26,
    "size": 8616849,
    "file_mtime": 1740470158.5733485
  }
}