{
  "text": "Letter\n1\nCoexistence of continuous-variable quantum key\ndistribution and classical data over 120-km fiber\nADNAN A.E. HAJOMER1, *, IVAN DERKACH2, VLADYSLAV C. USENKO2, ULRIK L. ANDERSEN1, AND\nTOBIAS GEHRING1,*\n1Center for Macroscopic Quantum States (bigQ), Department of Physics, Technical University of Denmark, 2800 Kongens Lyngby, Denmark\n2Department of Optics, Faculty of Science, Palacky University, 17. listopadu 12, 771 46 Olomouc, Czech Republic\n*Corresponding authors: aaeha@dtu.dk, tobias.gehring@fysik.dtu.dk\nCompiled February 25, 2025\nIntegrating quantum key distribution (QKD) with clas-\nsical data transmission over the same fiber is crucial for\nscalable quantum-secured communication. However,\nnoise from classical channels limits QKD distance. We\ndemonstrate the longest-distance continuous-variable\nQKD (CVQKD) over 120 km (20 dB loss) coexisting with\na fully populated coarse wavelength division multiplex-\ning system. Natural mode filtering of the local oscillator\nand phase noise mitigation enabled this without addi-\ntional filtering or wavelength reallocation. Benchmark-\ning against a commercial discrete-variable QKD system\nand considering finite-size effects confirms the feasibil-\nity of CVQKD as a plug-and-play solution for typical\n80–100 km long-haul optical networks. Our results set a\nrecord distance for CVQKD, showing its potential for\ncost-effective, large-scale deployment in existing net-\nwork infrastructure.\nhttp://dx.doi.org/10.1364/ao.XX.XXXXXX\nQuantum key distribution (QKD) has emerged as a lead-\ning quantum technology, reaching a maturity level suitable for\nreal-world deployment and commercialization [1]. It is broadly\ncategorized into discrete-variable (DV) and continuous-variable\n(CV) QKD [2], both of which have demonstrated secure key\ngeneration over long distances in dedicated optical fibers [3–6].\nHowever, large-scale deployment requires QKD to coexist with\nclassical data transmission within the same optical fiber channel\nto minimize infrastructure costs associated with deploying and\nmaintaining dark fibers.\nA promising approach to achieving this coexistence is wave-\nlength division multiplexing (WDM), where QKD and classi-\ncal signals use different frequency bands but otherwise share\nthe same fiber infrastructure. However, the fundamental chal-\nlenge lies in the extreme fragility of quantum states, which are\nhighly susceptible to noise photons from co-propagating classi-\ncal signals despite being in different frequency bands. This noise\nprimarily stems from the significant power imbalance between\nclassical and quantum signals, as well as Raman scattering and\nother nonlinear fiber effects, which lowers the attainable secure\nkey rate as well as the maximum transmission distance of QKD\nsystems.\nExtensive efforts have been made to mitigate classical noise\nand enable the coexistence of QKD and classical signals. In\nDV QKD, noise reduction strategies typically involve temporal\nfiltering using gated detectors, spectral filtering, and operating\nwithin specific wavelength windows (e.g., around 1310 nm) to\nminimize Raman-induced noise [7–11]. While effective, these\nconstraints can limit seamless QKD integration into existing\ntelecom networks, requiring dedicated wavelength allocation or\nthe implementation of strong filtering mechanisms.\nIn contrast, CVQKD offers a promising alternative by encod-\ning and decoding quantum information using standard telecom\ncomponents, such as quadrature modulators and coherent detec-\ntors, with a local oscillator (LO) facilitating the detection process.\nA key advantage of CVQKD is that the LO inherently acts as\na mode filter, improving resilience to classical noise and there-\nfore enabling seamless integration into existing fiber networks.\nPrevious demonstrations of CVQKD coexistence with classical\nchannels have primarily focused on analyzing different sources\nof noise and increasing the number of multiplexed classical sig-\nnals [12–16]. In particular, these works have been limited by\nshort secure transmission distances.\nIn this work, we report the longest-distance demonstration\nof CVQKD coexisting with a fully populated coarse wavelength\ndivision multiplexing (CWDM) system. Specifically, we demon-\nstrate co-propagation of CVQKD and classical data transmission\nchannels, each with about 1 mW launch power provided by\noff-the-shelf 10G small form-factor pluggable (SFP) transceivers,\nover 100 km and 120 km of ultra-low-loss optical fiber, corre-\nsponding to total channel losses of 17 dB and 20 dB, respectively.\nSecure keys are generated in the finite-size regime at 100 km,\nwhile asymptotic keys are achieved at 120 km. This record trans-\nmission distance is enabled by the intrinsic mode-filtering prop-\nerties of the LO and the optimization of modulation variance to\nsuppress phase noise-induced excess noise. We further validate\nthe effectiveness of mode filtering by comparing excess noise\nlevels with and without classical channels. Finally, we bench-\nmark our CVQKD system against a commercial DV QKD system\noperating over the same link, demonstrating that CVQKD pro-\nvides a viable, plug-and-play solution for integrating QKD into\ntypical long-haul optical networks spanning 80–100 km.\nFigure 1 shows our long-distance local local-oscillator (LLO)\narXiv:2502.17388v1  [quant-ph]  24 Feb 2025\n\nLetter\n2\nIQ Modulator - In-phase and quadrature modulator;\nCWDM - Coarse Wavelength Division Multiplexing; \nADC - 16-bit analog-to-digital converter;\nDAC - 16-bit digital-to-analog converter;\nCW laser - Continuous wave 1550 laser;\nVOA - Variable optical attenuator;\nABC - Automatic bias controler;\nCLK - 10 Mhz reference clock;\nPC - Polarization controller;\nBD - Balanced detector;\nOSW - optical switch;\nFI - Faraday isolator;\nSW - switch;\nFig. 1. Experimental setup for CVQKD coexisting with a fully populated CWDM system.\nCVQKD system [17] based on Gaussian-modulated coherent\nstates consisting of a transmitter (Alice), a receiver (Bob), and a\nCWDM system.\nAt the transmitter, a continuous-wave (CW) laser at 1550\nnm, with a narrow linewidth of approximately 100 Hz, was\nemployed as the optical source. Coherent states were prepared\nusing an in-phase and quadrature (IQ) modulator, driven by a\n16-bit digital-to-analog converter (DAC) operating at 1 Gsam-\nple/s. The optical single-sideband modulation was realized by\nprecisely adjusting the bias voltages using an automatic bias\ncontroller (ABC). A variable optical attenuator (VOA) fine-tuned\nthe modulation variance of the transmitted Gaussian distribu-\ntion of coherent states. To prevent back-reflections and mitigate\nTrojan-horse attacks, a Faraday isolator was introduced at the\ntransmitter’s output.\nQuantum symbols were derived from Gaussian-distributed\nrandom numbers generated by a quantum random number gen-\nerator (QRNG) based on vacuum fluctuations [18]. These sym-\nbols (αi = xi + ipi) were mapped onto amplitude and phase\nquadrature in phase space.\nThe system’s symbol rate was\n125 MBaud. The quantum symbols were up-sampled to the\nDAC sampling rate of 1 Gsample/s and pulse shaped using a\nroot-raised cosine (RRC) filter with a roll-off factor of 0.2. The\nquantum signal was frequency-shifted to 120 MHz for single-\nsideband modulation and multiplexed with a pilot tone at 220\nMHz for carrier phase recovery.\nAfter the CVQKD transmitter, the quantum signal at 1550\nnm was multiplexed with CWDM channels using a multiplexer\n(Mux). Each CWDM channel utilized a 10 Gbit/s SFP transceiver\nwith a launch power of about 1 mW (0 dBm), rated for 21 to 24 dB\nchannel attenuation. The CWDM system, covering wavelengths\nfrom 1270 nm to 1610 nm with 20 nm channel spacing, was\nfully populated. Following the CWDM Mux, the quantum and\nclassical signals were transmitted through a 120 km ultra-low-\nloss fiber (TeraWave® SCUBA 125 Ocean Optical Fiber) with an\nattenuation of 0.146 dB/km at 1550 nm. The total fiber channel\nloss was measured at approximately 18 dB, primarily due to a\nmode field diameter mismatch between the SMF-28 fiber pigtail\nand SCUBA 125 fiber. At the receiver, the classical and quantum\nsignals were separated using a demultiplexer (DeMux). The\nMux and DeMux introduced at the 1550 nm port an insertion\nloss of approximately 1.5 dB, which was considered part of the\ntotal channel loss.\nAt the receiver, quantum state measurements were performed\nvia radio-frequency (RF) heterodyne detection. An independent\nCW laser–of the same type as the transmitter laser, with a 100\nHz linewidth–operated as the LLO. This laser was free-running\nrelative to Alice’s laser and maintained a frequency offset of\napproximately 240 MHz. The quantum signal’s polarization was\naligned to match that of the LO using a manual polarization con-\ntroller (PC). Interference between the quantum signal and the\nLO was detected via a balanced detector (BD) with a bandwidth\nof 250 MHz. The detector’s output was digitized by a 16-bit\nanalog-to-digital converter (ADC) operating at 1 Gsample/s. A\n10 MHz reference clock was used to ensure precise synchroniza-\ntion between the DAC and ADC. Two optical switches (OSW)\nwere added to the quantum signal and LO path to perform\nvacuum noise and electronic noise calibration.\nThe received signal was subjected to extensive digital sig-\nnal processing (DSP) to recover quantum symbols. To speed\nup the DSP, the measurements were divided into frames, each\nwith 107 DAC samples. Initially, a frequency-domain equalizer\n(whitening filter) was applied to remove auto-correlation and\nmaintain the statistical independence of quantum symbols. To\nestimate the frequency offset between the two lasers, the pilot\ntone was extracted using a 1 MHz bandpass filter. A linear fit\nwas used to estimate the frequency offset after extracting the\nphase profile using the Hilbert transform. An unscented Kalman\nfilter was used for phase estimation [19]. The quantum signal\nwas then shifted to the baseband and corrected for the phase\nnoise. Finally, after matched RRC filtering and down-sampling,\nthe quantum symbols were reconstructed.\nFollowing quantum state reconstruction, classical post-\nprocessing was applied to extract secure keys. This included\ninformation reconciliation, parameter estimation, and privacy\namplification. Information reconciliation was carried out us-\ning multidimensional reconciliation based on multi-edge-type\n(MET) low-density parity-check (LDPC) codes with a fixed rate\nof 0.01 [20], achieving a reconciliation efficiency (β) of 93.73%\nand a frame error rate (FER) of 30%.\nWe evaluate the performance of the integrated CVQKD sys-\ntem based on the no-switching protocol [21] with CWDM chan-\n\nLetter\n3\nTable 1. Experimental parameters for different fiber lengths.\nD: distances, VM: modulation variance, η: Untrusted efficiency,\nξ: Excess noise (at channel output), τ: trusted efficiency, Vel:\nTrusted detection noise, N: block size.\nD, km\nVM, SNU\nη\nξ, mSNU\nτ\nVel, mSNU\nN\nCWDM Channels\n100\n9.41\n0.0180\n0.714\n0.685\n19.62\n1 × 108\nOFF\n100\n9.41\n0.0184\n0.760\n0.685\n19.25\n1 × 108\nON\n100\n9.41\n0.0183\n0.712\n0.685\n19.26\n1.6 × 109\nON\n120\n4.71\n0.0096\n0.444\n0.685\n18.99\n1 × 108\nON\nnels using two key metrics: the secret key rate (SKR) and excess\nnoise. Experiments were conducted under two conditions: (i)\nwith classical channels turned OFF, serving as a reference, and\n(ii) with classical channels turned ON. Table 1 summarizes the\nexperimental parameters for fiber channels of 100 km and 120\nkm. In both cases, Alice generates coherent states with a mod-\nulation variance VM of 9.41 SNU for the 100 km link and 4.71\nSNU for the 120 km link. Due to additional insertion losses intro-\nduced by the CWDM system and optical switches, the effective\nloss in the 100 km and 120 km channels exceeds the physical loss\nof fiber channels.\n30\n40\n50\n60\n70\n80\n0.0000\n0.0005\n0.0010\n0.0015\n0.0020\n0.0025\n0.0030\nframe no.\nϵ, SNU\nb\na\n0\n100\n200\n300\n400\n10-1\n100\n101\n102\nPower spectrum, a.u\nNormalized vacuum\nFrequency, MHz\n0\n100\n200\n4×102\n8×102\nFig. 2. (a) Cumulative excess noise (at the channel output) af-\nter each measurement frame (each of ≈1.2 × 106 symbols)\nwhen classical channels are turned OFF (red) or ON (blue). Er-\nror bars are evaluated based on Gaussian confidence intervals\nfor given amount of acquired data and protocol failure prob-\nability of ϵ = 10−10 [22]. (b) Vacuum noise power with (blue)\nand without (red) classical channels is identical across broad\nrange of frequencies.\nTo quantify the impact of classical channels on excess noise,\nwe compared measurements taken with and without their pres-\nence. Figure 2(a) shows the excess noise at the quantum channel\noutput as a function of the accumulated number of symbols per\nframe (≈1.2 × 106 symbols) over the 100 km fiber channel. The\naverage measured excess noise is 0.714 mSNU with classical\nchannels off and 0.760 mSNU with them on. Despite the slight\nincrease, the overlapping error bars indicate that this variation\nis statistically insignificant, demonstrating that the presence of\nclassical channels has a negligible effect on the excess noise\nperformance of CVQKD.\nFurther validation comes from analyzing the power spectrum\nof vacuum noise, comparing the case with classical channels ON\nto that of true vacuum noise (i.e., classical channels OFF). This\ncomparison is illustrated by the red and blue traces in Fig. 2(b),\nwhich completely overlap. This is further confirmed by the\nnormalized vacuum noise (black trace) plotted on a logarithmic\nscale, remaining at a value of 1 across the detector bandwidth,\nindicating no observable difference between the two scenarios.\nThese results demonstrate that the classical channels do not\nintroduce significant excess noise, primarily due to the natural\nmode filtering effect of the LO.\nTo verify the LO’s mode-filtering properties, we assess leak-\nage from classical channels by measuring photon noise at the\n1550 nm port using superconducting nanowire single-photon\ndetectors (SNSPDs), with the MUX and DEMUX connected via a\nshort fiber patch cord. Figure 3(a) presents the cumulative pho-\nton count rate after enabling classical channels within the 1550\nnm window and subtracting the dark count of 126 count/s. The\nresults indicate that the dominant noise contribution originates\nfrom adjacent channels at 1530 nm and 1570 nm, as the cumu-\nlative photon count rate saturates upon activating these two\nchannels. Despite this observed photon leakage, the excess noise\nof our CVQKD system remains unaffected (Fig. 2 (a)), further\nconfirming the LO’s mode-filtering capability and the system’s\nrobustness against interference from classical channels.\nAdditionally, we have seen no effect of spontaneous Raman\nscattering noise, as previous studies [12, 15] have shown that\nit decreases with both distance and launch optical power. This\nconclusion is further supported by our excess noise measure-\nments, which confirm that Raman scattering is negligible at the\nobserved total loss.\nThe SKR quantifies the information advantage of Alice and\nBob over Eve [1]. Figure 3(b) illustrates the SKR obtained from\nboth simulations (solid and dashed lines) and experimental re-\nsults (data points), considering both asymptotic (solid lines) and\nfinite-size (dashed lines) regimes as a function of channel loss.\nTo ensure a fair comparison between the classical channels ON\nand OFF cases, we assume the same reconciliation efficiency β\nof 96% [4].\nFor a 100 km fiber link with a total loss of 17 dB, the system\nachieves similar performance in the asymptotic regime for both\ncases (blue and red points), owing to comparable excess noise\nlevels. In the finite-size regime, a positive key rate of 3.98 × 10−4\nbits/channel use is achieved at the same 17 dB loss with classical\nchannels ON by increasing the block size to 1.6 × 109, consid-\nering Gaussian confidence intervals and a failure probability of\n10−10 [6, 22].\nBy optimizing VM with respect to phase noise [6] and a range\nof attainable reconciliation efficiencies β, the transmission dis-\ntance extends to 120 km (20.17 dB loss), achieving a positive key\nrate in the asymptotic regime (orange point). Given the observed\nexcess noise performance, theoretical simulations (orange solid\nline) suggest that the total loss budget can extend beyond 21 dB.\nThe tolerable loss can also be translated into large number of\nnetwork users connected via trusted broadcasting protocol [23].\nGiven such level of noise, up to four users can simultaneously\nestablish a secure key with transmitter distanced by 100 km of\nultra-low-loss optical fiber, or more than twenty users at half the\ndistance from transmitter.\nFor actual key generation over a 120 km link, we perform\nerror correction with β of 93.73% and a FER of 30%. At a symbol\nrate of 125 MBaud, the achieved key rate was 48.3 kbit/s in the\nasymptotic regime. However, a finite-size key can also be ob-\ntained by increasing the block size and improving the efficiency\nof information reconciliation. Fig. 3(c) illustrates the minimum\nrequired block size N (×109 symbols) and reconciliation effi-\n\nLetter\n4\n0\n5\n10\n15\n20\n10- 6\n10- 4\n0.01\n1\nη, dB\nSKR, bits/use\n5×105 1×106\n5×106 1×107\n5×107 1×108\nCummulative photon count rate, count/s\nChannel wavelength, nm\n1490\n1510\n1530\n1570\n1590\n1610\n0\n0.0002\n0.0004\n0.0006\n0.0008\n95\n96\n97\n98\n99\n2\n4\n6\n8\n10\nReconciliation efficinency β, %\nNumber of blocks Nx109\na\nb\nc\nFig. 3. (a) Cumulative photon count rate (in count/s) at 1550 nm port. (b) Secure key rate (in bits/channel use) dependency on\nthe channel loss (in dB). Theoretical secure transmittance is shown for asymptotic (solid) and finite-size (dashed) regime, without\nclassical channels (blue lines) and with classical channels (red). Experimental measurement results are indicated by red circles for\nmeasurements with classical channels and a blue circle for measurements without classical channels. (c) Finite-size key rate (in\nbits/channel use) as a function of block size and information reconciliation efficiency.\nciency necessary to achieve a finite-size key under the given\nsystem parameters (for D = 120 km in Table. 1). At least 2 × 109\nsymbols are required to reach a positive key with almost perfect\nefficiency. However, with attainable values β ≤96% [4, 20, 24]\nmore than 4 blocks (109 each) are needed to reach a positive key\nrate.\nTo benchmark our system, we compare its performance with\na commercial decoy-state BB84 DV-QKD system operating at\n1550 nm, which employs a free-running single-photon detector\nover a 100 km fiber link. The system generated a secret key rate\nof 0.88 kbit/s in the absence of classical channels. However,\nwhen the CWDM system was enabled, the key rate dropped\nto zero. Even after removing the most significant interfering\nchannels (1510 nm, 1530 nm and 1570 nm), the key rate remained\nzero.\nWhile DV-QKD systems have demonstrated functionality in\nnoisy CWDM environments through temporal and strong spec-\ntral filtering [7–11], our results highlight that CVQKD provides\na plug-and-play solution for long-haul optical links without re-\nquiring additional filtering techniques or specific wavelength\nallocation.\nIn this work, we demonstrated the longest-distance LLO\nCVQKD system coexisting with a fully populated CWDM sys-\ntem over 120 km (20.17 dB loss) with a typical launched power of\n1 mW. Importantly, the presence of classical communication has\nabsolutely no impact on the key rate. This achievement is made\npossible by the inherent properties of the LLO, which serves as\nan ideal mode filter, and by optimizing the modulation variance\nto mitigate excess noise due to phase noise [6].\nTo further enhance system performance and support larger\nblock sizes for finite-size keys, the symbol rate can be increased\nwith faster detectors, DACs, and ADCs. Additionally, the devel-\nopment of efficient MET-LDPC codes can significantly improve\nerror correction efficiency.\nOur results not only demonstrate the longest LLO CVQKD\nsystem to date but, more importantly, establish that CVQKD can\nserve as a plug-and-play solution for long-haul optical networks,\npaving the way for the large-scale deployment of quantum-safe\ncommunication.\nAcknowledgments.\nWe thank OFS optics for providing the\nSCUBA125 fiber for this experiment, Mircea Balauroiu for assistance\nin operating the DVQKD system, Naja L.Nysom for conducting error\ncorrection, and Lucas N. Faria for operating the SNSPDs. AAEH, ULA\nand TG acknowledge support from the Danish National Research Foun-\ndation, Center for Macroscopic Quantum States (bigQ, DNRF142). This\nproject was funded within the QuantERA II Programme (project CVS-\nTAR) that has received funding from the European Union’s Horizon\n2020 research and innovation programme under Grant Agreement No\n101017733. ID acknowledges support from the project 22-28254O of the\nCzech Science Foundation. VCU acknowledges project 21-44815L of the\nCzech Science Foundation and project CZ.02.01.01/00/22_008/0004649\n(QUEENTEC) of the Czech MEYS. We acknowledge support from Eu-\nropean Union’s Horizon Europe research and innovation programme\nunder the project “Quantum Security Networks Partnership” (QSNP,\ngrant agreement no. 101114043), from the European Union’s Digital\nEurope programme (QCI.DK, grant agreement no. 101091659), and from\nInnovation Fund Denmark (CyberQ, grant agreement no. 3200-00035B).\nData availability.\nData underlying the results presented in this paper\nare available from the authors upon reasonable request.\nDisclosures.\nThe authors declare no conflicts of interest.\nREFERENCES\n1.\nS. Pirandola, U. L. Andersen, L. Banchi, et al., Adv. Opt. Photonics 12,\n1012 (2020).\n2.\nV. C. Usenko,\nA. Acín,\nR. Alléaume,\net al.,\narXiv preprint\narXiv:2501.12801 (2025).\n3.\nA. Boaron, G. Boso, D. Rusca, et al., Phys. review letters 121, 190502\n(2018).\n4.\nY. Zhang, Z. Chen, S. Pirandola, et al., Phys. review letters 125, 010502\n(2020).\n5.\nY. Liu, W.-J. Zhang, C. Jiang, et al., Phys. Rev. Lett. 130, 210801\n(2023).\n6.\nA. A. Hajomer, I. Derkach, N. Jain, et al., Sci. Adv. 10, eadi9474 (2024).\n7.\nP. D. Townsend, Electron. Lett. 33, 188 (1997).\n8.\nP. Eraerds, N. Walenta, M. Legré, et al., New J. Phys. 12, 063027\n(2010).\n9.\nK. Patel, J. Dynes, I. Choi, et al., Phys. Rev. X 2, 041010 (2012).\n10.\nL.-J. Wang, K.-H. Zou, W. Sun, et al., Phys. Rev. A 95, 012301 (2017).\n11.\nP. Gavignet, E. Pincemin, F. Herviou, et al., J. Light. Technol. 42, 1321\n(2023).\n\nLetter\n5\n12.\nR. Kumar, H. Qin, and R. Alléaume, New J. Phys. 17, 043027 (2015).\n13.\nT. A. Eriksson, T. Hirano, B. J. Puttnam, et al., Commun. Phys. 2, 9\n(2019).\n14.\nT. A. Eriksson, B. J. Puttnam, G. Rademacher, et al., IEEE Photonics\nTechnol. Lett. 31, 467 (2019).\n15.\nF. Karinou, H. H. Brunner, C.-H. F. Fung, et al., IEEE Photonics Technol.\nLett. 30, 650 (2018).\n16.\nD. Milovanˇcev, N. Voki´c, F. Laudenbach, et al., J. Light. Technol. 39,\n3445 (2021).\n17.\nB. Qi, P. Lougovski, R. Pooser, et al., Phys. Rev. X 5, 041009 (2015).\n18.\nT. Gehring, C. Lupo, A. Kordts, et al., Nat, Commun. 12, 1 (2021).\n19.\nH.-M. Chin, N. Jain, D. Zibar, et al., npj Quantum Inf. 7, 1 (2021).\n20.\nH. Mani, T. Gehring, P. Grabenweger, et al., Phys. Rev. A 103, 062419\n(2021).\n21.\nC. Weedbrook, A. M. Lance, W. P. Bowen, et al., Phys. review letters\n93, 170504 (2004).\n22.\nL. Ruppert, V. C. Usenko, and R. Filip, Phys. Rev. A 90, 062310 (2014).\n23.\nA. A. Hajomer, I. Derkach, R. Filip, et al., Light. Sci. & Appl. 13, 291\n(2024).\n24.\nA. A. Hajomer, N. Jain, H. Mani, et al., npj Quantum Inf. 8, 136 (2022).\n\nLetter\n6\nFULL REFERENCES\n1.\nS. Pirandola, U. L. Andersen, L. Banchi, et al., “Advances in quantum\ncryptography,” Adv. Opt. Photonics 12, 1012–1236 (2020).\n2.\nV. C. Usenko, A. Acín, R. Alléaume, et al., “Continuous-variable quan-\ntum communication,” arXiv preprint arXiv:2501.12801 (2025).\n3.\nA. Boaron, G. Boso, D. Rusca, et al., “Secure quantum key distribution\nover 421 km of optical fiber,” Phys. review letters 121, 190502 (2018).\n4.\nY. Zhang, Z. Chen, S. Pirandola, et al., “Long-distance continuous-\nvariable quantum key distribution over 202.81 km of fiber,” Phys. review\nletters 125, 010502 (2020).\n5.\nY. Liu, W.-J. Zhang, C. Jiang, et al., “Experimental twin-field quantum\nkey distribution over 1000 km fiber distance,” Phys. Rev. Lett. 130,\n210801 (2023).\n6.\nA. A. Hajomer, I. Derkach, N. Jain, et al., “Long-distance continuous-\nvariable quantum key distribution over 100-km fiber with local local\noscillator,” Sci. Adv. 10, eadi9474 (2024).\n7.\nP. D. Townsend, “Simultaneous quantum cryptographic key distribu-\ntion and conventional data transmission over installed fibre using\nwavelength-division multiplexing,” Electron. Lett. 33, 188–190 (1997).\n8.\nP. Eraerds, N. Walenta, M. Legré, et al., “Quantum key distribution and\n1 gbps data encryption over a single fibre,” New J. Phys. 12, 063027\n(2010).\n9.\nK. Patel, J. Dynes, I. Choi, et al., “Coexistence of high-bit-rate quantum\nkey distribution and data on optical fiber,” Phys. Rev. X 2, 041010\n(2012).\n10.\nL.-J. Wang, K.-H. Zou, W. Sun, et al., “Long-distance copropagation of\nquantum key distribution and terabit classical optical data channels,”\nPhys. Rev. A 95, 012301 (2017).\n11.\nP. Gavignet, E. Pincemin, F. Herviou, et al., “Co-propagation of qkd &\n6 tb/s (60× 100g) dwdm channels with 17 dbm total wdm power in\nsingle and multi-span configurations,” J. Light. Technol. 42, 1321–1327\n(2023).\n12.\nR. Kumar, H. Qin, and R. Alléaume, “Coexistence of continuous vari-\nable qkd with intense dwdm classical channels,” New J. Phys. 17,\n043027 (2015).\n13.\nT. A. Eriksson, T. Hirano, B. J. Puttnam, et al., “Wavelength division\nmultiplexing of continuous variable quantum key distribution and 18.3\ntbit/s data channels,” Commun. Phys. 2, 9 (2019).\n14.\nT. A. Eriksson, B. J. Puttnam, G. Rademacher, et al., “Crosstalk im-\npact on continuous variable quantum key distribution in multicore fiber\ntransmission,” IEEE Photonics Technol. Lett. 31, 467–470 (2019).\n15.\nF. Karinou, H. H. Brunner, C.-H. F. Fung, et al., “Toward the integration\nof cv quantum key distribution in deployed optical networks,” IEEE\nPhotonics Technol. Lett. 30, 650–653 (2018).\n16.\nD. Milovanˇcev, N. Voki´c, F. Laudenbach, et al., “High rate cv-qkd se-\ncured mobile wdm fronthaul for dense 5g radio networks,” J. Light.\nTechnol. 39, 3445–3457 (2021).\n17.\nB. Qi, P. Lougovski, R. Pooser, et al., “Generating the local oscilla-\ntor “locally” in continuous-variable quantum key distribution based on\ncoherent detection,” Phys. Rev. X 5, 041009 (2015).\n18.\nT. Gehring, C. Lupo, A. Kordts, et al., “Homodyne-based quantum\nrandom number generator at 2.9 Gbps secure against quantum side-\ninformation,” Nat, Commun. 12, 1–11 (2021).\n19.\nH.-M. Chin, N. Jain, D. Zibar, et al., “Machine learning aided carrier\nrecovery in continuous-variable quantum key distribution,” npj Quantum\nInf. 7, 1–6 (2021).\n20.\nH. Mani, T. Gehring, P. Grabenweger, et al., “Multiedge-type low-density\nparity-check codes for continuous-variable quantum key distribution,”\nPhys. Rev. A 103, 062419 (2021).\n21.\nC. Weedbrook, A. M. Lance, W. P. Bowen, et al., “Quantum cryptogra-\nphy without switching,” Phys. review letters 93, 170504 (2004).\n22.\nL. Ruppert, V. C. Usenko, and R. Filip, “Long-distance continuous-\nvariable quantum key distribution with efficient channel estimation,”\nPhys. Rev. A 90, 062310 (2014).\n23.\nA. A. Hajomer, I. Derkach, R. Filip, et al., “Continuous-variable quantum\npassive optical network,” Light. Sci. & Appl. 13, 291 (2024).\n24.\nA. A. Hajomer, N. Jain, H. Mani, et al., “Modulation leakage-free\ncontinuous-variable quantum key distribution,” npj Quantum Inf. 8, 136\n(2022).\n",
  "metadata": {
    "source_path": "papers/arxiv/Coexistence_of_continuous-variable_quantum_key_distribution_and\n__classical_data_over_120-km_fiber_c115b27d1b9d7d0f.pdf",
    "content_hash": "c115b27d1b9d7d0f7720f190f22373b720ebc4dbde5731c3ec2d655c685b104e",
    "arxiv_id": null,
    "title": "Coexistence_of_continuous-variable_quantum_key_distribution_and\n__classical_data_over_120-km_fiber_c115b27d1b9d7d0f",
    "author": "",
    "creation_date": "D:20250225030623Z",
    "published": "2025-02-25T03:06:23",
    "pages": 6,
    "size": 2179819,
    "file_mtime": 1740470153.072982
  }
}