{
  "text": "A Multi-LLM-Agent-Based Framework for\nEconomic and Public Policy Analysis∗\nYuzhi HAO†\nDanyang XIE‡\nFebruary 23, 2025\nAbstract\nThis paper pioneers a novel approach to economic and public policy\nanalysis by leveraging multiple Large Language Models (LLMs) as hetero-\ngeneous artificial economic agents. We first evaluate five LLMs’ economic\ndecision-making capabilities in solving two-period consumption allocation\nproblems under two distinct scenarios: with explicit utility functions and\nbased on intuitive reasoning. While previous research has often simulated\nheterogeneity by solely varying prompts, our approach harnesses the in-\nherent variations in analytical capabilities across different LLMs to model\nagents with diverse cognitive traits. Building on these findings, we con-\nstruct a Multi-LLM-Agent-Based (MLAB) framework by mapping these\nLLMs to specific educational groups and corresponding income brackets.\nUsing interest-income taxation as a case study, we demonstrate how the\nMLAB framework can simulate policy impacts across heterogeneous agents,\noffering a promising new direction for economic and public policy analysis\nby leveraging LLMs’ human-like reasoning capabilities and computational\npower.\nKeywords: Large Language Models, Agent-Based Modeling, Heteroge-\nneous Agents, Economic Decision-Making, Public Policy Analysis\nJEL Classification: C63, D15, E21, H21, H31\n∗We would like to thank DAI Kaiyan for technical assistance and the seminar participants at\nthe School of Public Policy and Management, Tsinghua University; the Center for Forecasting\nScience, the Academy of Mathematics and System Science of the Chinese Academy of Sciences;\nthe School of Economics and Management, University of Chinese Academy of Sciences; Paula and\nGregory Chow Institute for Studies in Economics, Xiamen University; and the Basic Science Center\nfor Econometric Modeling and Economic Policy Studies, Xiamen University–Chinese Academy of\nSciences for their helpful suggestions and comments. The usual disclaimer applies.\n†Department of Economics, The Hong Kong University of Science and Technology.\nEmail:\nyuzhi.hao@connect.ust.hk.\n‡Thrust of Innovation, Policy, and Entrepreneurship, the Society Hub, The Hong Kong Univer-\nsity of Science and Technology (Guangzhou). Email: dxie@hkust-gz.edu.cn.\n1\narXiv:2502.16879v1  [cs.AI]  24 Feb 2025\n\n1\nIntroduction\nThe integration of Large Language Models into economic analysis offers new possi-\nbilities for policy research and computational economics. Traditional macroeconomic\nmodels, while mathematically rigorous, often rely on strong assumptions of rational\nexpectations and representative agents. These models typically abstract complex eco-\nnomic processes through mathematical formulations such as production functions,\nwhich may not fully capture the rich dynamics of R&D, human capital formation,\nand product evolution in real economies. Moreover, the inherent trade-off between\nmodel complexity and tractability has historically limited our ability to incorporate\nmeaningful heterogeneity in agent behaviors and preferences with the exceptions such\nas Aiyagari (1994), Krusell and Smith (1998) and the TANK and HANK models of\nGal´ı et al. (2004), Bilbiie (2008), and Kaplan et al. (2018).\nAgent-based models (ABMs) emerged as an alternative approach, allowing for the\nincorporation of heterogeneous agents with bounded rationality. Early ABMs, as doc-\numented by Tesfatsion (2006) and examplified by Brock and Hommes (1998), relied\non predetermined rules to govern agent behavior. While these models offered insights\ninto emergent phenomena from individual interactions, they were constrained by the\nrigidity of their behavioral rules. Recent developments in artificial intelligence, par-\nticularly the advent of Large Language Models, offer new possibilities for enhancing\nthe flexibility and sophistication of agent-based modeling.\nA growing body of literature has begun to explore LLMs’ potential in economic\nanalysis. Mei et al. (2024) and Ma (2024) demonstrate that LLMs exhibit human-like\nbehavioral characteristics in economic decision-making scenarios. Xie et al. (2024)\nshows that different AI chatbots exhibit distinct behavioral patterns in games, sug-\ngesting that these AI systems are not uniform in their decision-making patterns.\nChen et al. (2023) provides evidence of emergent economic rationality in LLMs’\nchoices, while Horton (2023) evaluates their performance in classical behavioral eco-\nnomics games. In a pioneering application of LLMs to agent-based modeling, Li\net al. (2024) construct heterogeneous agents by varying the economic situations de-\nscribed in prompts to a single LLM, successfully simulating market dynamics and\npolicy responses. However, their approach captures heterogeneity solely through var-\nied prompts, while implicitly assuming uniform reasoning capabilities and behavioral\ntendencies across all agents.\nOur paper advances this literature by introducing a two-dimensional approach to\nmodeling heterogeneity. We capture differences not only in economic circumstances\nthrough varied prompts but also in reasoning capabilities and behavioral tendencies\nthrough the use of different LLMs. This innovation is motivated by the observa-\n2\n\ntion that economic decision-making heterogeneity in the real world stems from both\nobjective circumstances (income, wealth, age) and subjective factors (cognitive abil-\nities, cultural values, risk preferences). By employing multiple LLMs with distinct\nanalytical capabilities and behavioral patterns, our framework better reflects the\nmultifaceted nature of heterogeneity in real-world economic decision-making.\nThe potential of LLMs extends beyond individual decision-making to policy anal-\nysis. Wu et al. (2024) explores how LLMs can help navigate trade-offs in policy\nresearch design, while Pang (2024) demonstrates their utility in enhancing causal\nanalysis and research collaboration. These applications suggest that LLMs can serve\nnot only as simulated economic agents but also as analytical tools for policy evalu-\nation and institutional design. Our MLAB approach could therefore be particularly\nvaluable for understanding how different population segments might respond to pol-\nicy interventions.\nOur paper makes several contributions to this emerging field.\nFirst, we pro-\nvide a systematic evaluation of five leading LLMs’ capabilities in solving dynamic\neconomic optimization problems, using a canonical two-period consumption-savings\nframework. We assess these models under two distinct scenarios: one with explicit\nutility functions to test their computational abilities, and another without utility\nfunctions to examine their autonomous economic reasoning. Second, we introduce\nthe Multi-LLM-Agent-Based (MLAB) framework, where different LLMs represent\ndistinct socioeconomic groups based on their demonstrated capabilities. This novel\napproach leverages the varying characteristics of different LLMs to model population\nheterogeneity in economic decision-making.\nWe demonstrate the practical value of our MLAB framework through a case\nstudy of interest income taxation. By mapping different LLMs to specific educational\nbackgrounds and corresponding income brackets in a calibrated population of 100\nindividuals, we simulate how various socioeconomic groups might respond to tax\npolicy changes. Our results reveal nuanced patterns of behavioral responses that\nwould be difficult to capture with traditional modeling approaches.\nWhile previous research has simulated heterogeneity by solely varying prompts—akin\nto asking a highly intelligent agent to emulate the behavior of someone less edu-\ncated—our approach harnesses the naturally diverse analytical capabilities of differ-\nent LLMs to represent agents from distinct educational backgrounds. By mapping\neach LLM to a specific educational group, we enrich our model’s representation of\ndemographic and cognitive heterogeneity, thereby enhancing policy simulation exer-\ncises. Although the current assignment of LLMs to educational groups is not yet\nas scientifically rigorous or multidimensional as desired, our preliminary findings\ndemonstrate the feasibility and robustness of this method. As the capabilities of\n3\n\nLLMs continue to advance, we anticipate that a highly sophisticated LLM could\nbe provided with detailed data on the characteristics of a target group and subse-\nquently generate bespoke code to create a tailored LLM. This specialized LLM would\nthen mimic the distinct “thinking and intuition” of the group, ultimately allowing\nfor the creation of as many finely calibrated agents as necessary for comprehensive\npolicy simulations. Such a methodological evolution underscores the transformative\npotential of the Multi-LLM-Agent-Based framework.\nThe remainder of the paper is organized as follows. Section 2 presents our theo-\nretical framework and experimental design. Section 3 details our evaluation of LLMs’\nrational optimization capabilities. Section 4 examines their economic intuition and\nautonomous reasoning. Section 5 introduces the MLAB framework and presents our\npolicy analysis results. Section 6 concludes with implications for future research and\npolicy applications.\n2\nEvaluating LLMs’ Optimization Capabilities with\nExplicit Utility Functions\nWe begin our analysis by evaluating LLMs’ capabilities in solving a canonical two-\nperiod consumption-savings problem. This section presents our theoretical setting,\nparameter calibration, experimental design for assessing LLMs’ rational optimization\nabilities when provided with an explicit utility function and results.\n2.1\nTheoretical Setting\nConsider a representative middle-aged agent in urban China making consumption\ndecisions over two distinct life periods of equal length (20 years each): a working\nperiod and a subsequent retirement period (e.g., ages 40-59 and 60-79). The agent’s\npreferences are represented by a constant relative risk aversion (CRRA) utility func-\ntion, widely adopted in macroeconomic analysis for its analytical tractability and\nempirical relevance. The optimization problem is specified as:\nmax\nc1,c2 U = u(c1) + βu(c2)\n(1)\nwhere\nu(c) =\n(\nc1−σ\n1−σ ,\nif σ ̸= 1\nln(c),\nif σ = 1\n(2)\n4\n\nand the agent faces an intertemporal budget constraint:\nc1 +\nc2\n(1 + r) = w0 + y1 +\ny2\n(1 + r)\n(3)\nwhere c1 and c2 represent consumption in periods 1 and 2 respectively, β ∈(0, 1)\nis the subjective discount factor, σ > 0 is the coefficient of relative risk aversion, r is\nthe real interest rate, w0 represents initial wealth, and y1, y2 denote income in each\nperiod.\nThe first-order conditions yield the Euler equation:\nu′(c1) = β(1 + r)u′(c2)\n(4)\nUnder CRRA utility, this becomes:\nc2 = c1(β(1 + r))\n1\nσ\n(5)\nCombining with the budget constraint yields the analytical solutions:\nc1 =\nw0 + y1 + y2/(1 + r)\n1 + (β(1 + r))\n1\nσ /(1 + r)\n(6)\nc2 = (w0 + y1 + y2/(1 + r))(β(1 + r))\n1\nσ\n1 + (β(1 + r))\n1\nσ /(1 + r)\n(7)\nThese solutions exhibit several key economic properties. First, consumption in\nboth periods is proportional to lifetime wealth (w0 + y1 + y2/(1 + r)), reflecting the\nincome effect. Second, the consumption ratio c2/c1 = (β(1+r))1/σ captures intertem-\nporal substitution. Third, as σ →∞, consumption approaches perfect smoothing,\nwhile as σ →0, consumption becomes increasingly sensitive to interest rates.\n2.2\nParameter Calibration\nWe calibrate our model parameters using data from the China Family Panel Studies\n(CFPS) 2018 wave, focusing on urban residents. For income parameters, we employ a\ntwo-step procedure that accounts for both age-specific income patterns and economic\ngrowth.\nFirst, we divide the population into six age groups (20-29, 30-39, 40-49, 50-\n59, 60-69, and 70-79) and calculate the average income for each group (¯yi, where\ni = 1, . . . , 6) and the overall population average income (¯y).\nWe then compute\nage-specific income ratios:\n5\n\nki = ¯yi\n¯y ,\ni = 1, . . . , 6\n(8)\nTo project future incomes, we assume a constant annual growth rate of 4%. The\naverage income j decades from now, denoted as ¯yg\nj , is:\n¯yg\nj = ¯y(1.04)10j,\nj = 0, . . . , 5\n(9)\nFor our representative agent who starts at age 20-29, their age-specific income in\neach decade is:\n¯yg,i = ¯yg\nj ki\n(10)\nThis formulation captures both life-cycle income patterns and economic growth.\nFor instance, when our representative agent reaches ages 30-39, their income will be\n¯yg,2 = ¯y(1.04)10k2.\nTo derive the two-period problem parameters, we calculate:\ny1 = ¯yg,3 +\n¯yg,4\n(1 + r)10\n(11)\ny2 = ¯yg,5 +\n¯yg,6\n(1 + r)10\n(12)\nFor initial wealth (w0), we solve a six-period optimization problem with identical\npreference parameters (β, σ) and interest rate (r), starting with zero initial wealth at\nage 20. The optimal savings accumulated by the beginning of period 40-49 determines\nw0.\nThis calibration yields the following parameter values:\nInitial wealth (w0): 141,598.4 units\nWorking period income (y1): 958,189.8 units\nRetirement period income (y2): 244,103.9 units\nDiscount factor (β): 0.9920 (reflecting emerging market patience)\nRisk aversion (σ): 2 (standard macroeconomic calibration)\nAnnual interest rate (r): 2%\nThe relatively high discount factor reflects documented patience in emerging mar-\nket economies, while the risk aversion parameter follows standard calibrations in\nmacroeconomic literature. The interest rate combines information from borrowing\nrates (average real LPR 2019-2023, data from the People’s Bank of China) and saving\nrates (real returns on wealth management products based on China Banking Wealth\n6\n\nManagement Market Annual Reports 2019-2023, adjusted using CPI data from the\nNational Bureau of Statistics).\n2.3\nExperimental Design\nOur experimental procedure evaluates five state-of-the-art LLMs:\nDeepSeek-V3,\nGPT-4o-20241120, Gemini-1.5-pro-002, Claude-3.5-sonnet-20241022, and Llama-3.1-\n405B. For each model, we conduct 16 independent trials to account for potential\nresponse variations. The experimental design follows a structured protocol to ensure\nconsistency and reproducibility.\nThe prompt provided to each LLM is carefully designed to include three key\ncomponents: role-playing setup, economic parameters, and output structure. The\nrole-playing component establishes the decision-making context:\nPlease get into the role-play mode. Imagine you are a middle-age working\nadult in an urban area of China, facing a consumption decision. You need\nto plan your consumption for the rest of your life, which can be divided\ninto two periods with equal and large number of years: Working period\nfollowed by Retirement Period.\nThe economic parameters section presents the utility function, budget require-\nment, and all relevant numerical values:\nYour preferences over consumption in these two periods can be described\nby: U = [c1(1−2) + 0.818 ∗c2(1−2)]/(1 −2) where: c1 is your consumption\nfor the working period. c2 is your consumption for the retirement period.\nYour current economic situation: Current savings: 141,598.4 units. In-\ncome for the working period: 958,189.8 units. Income for the retirement\nperiod: 244,103.9 units. Interest rate between periods: 48.6%. You need\nto live within your means.\nThe output structure requires a specific format for the response:\nGiven these circumstances, how would you choose your consumption for\nthese two periods of life? Please explain your choices. Toward the end,\nsay “Final Answer: I will choose to ... because ...”\nThe experimental protocol consists of the following steps for each LLM: 1. Ini-\ntialize a new chat session to ensure a clean context. 2. Present the standardized\n7\n\nprompt. 3. Record the complete model response. 4. Clear the conversation history.\n5. Repeat steps 1-4 for a total of 16 independent trials. 6. Move to the next LLM\nand repeat the entire process.\nTo maintain independence across trials, we clear the conversation history before\neach new prompt. This ensures that each response is based solely on the current\nprompt rather than being influenced by previous interactions.\nAll responses are\nrecorded in a standardized format for subsequent analysis.\nWe maintain the default temperature settings for each LLM to preserve their\nnatural reasoning patterns:\nDeepseek-V3: temperature = 1.0 in a 0-2 range\nGPT-4o: temperature = 1.0 in a 0-1 range\nGemini-1.5-pro: temperature = 1.0 in a 0-2 range\nClaude-3.5-sonnet: temperature = 1.0 in a 0-1 range\nLlama-3.1-405B: temperature = 0.2 in a 0-1 range\nInterestingly, while Llama-3.1-405B has the lowest temperature setting, our sub-\nsequent analysis reveals that it exhibits the highest variation in decision-making\npatterns among all models.\n2.4\nPerformance Analysis and Model Comparison\nOur analysis of the LLMs’ responses reveals distinct patterns in their problem-solving\ncapabilities. The results can be visualized in three complementary ways:\nFirst, we plot each model’s consumption choices (c1, c2) against the budget\nconstraint line and the theoretical optimal point as shown in Figure 1.\nA point\nabove the budget line indicates over-consumption (infeasible solution), while a point\nbelow represents under-consumption (inefficient resource utilization). The theoretical\noptimal point is marked by the intersection of two dashed lines.\nDeepSeek-V3 demonstrates strong optimization capabilities, with most points\nclustering around the theoretical optimum. While some solutions fall slightly below\nthe budget constraint line, indicating under-consumption, the majority of responses\nrepresent efficient resource allocation.\nGPT-4o shows moderate performance, with points generally respecting the bud-\nget constraint but displaying greater dispersion around the optimal point. A few\nsolutions appear above the budget line, indicating occasional failures to properly\naccount for intertemporal resource constraints.\nGemini-1.5-pro exhibits more variable performance, with some solutions signif-\nicantly exceeding the budget constraint. However, a notable cluster of points still\n8\n\nFigure 1: Consumption choices by LLMs. The diagonal line represents the budget\nconstraint, and the dashed lines intersect at the theoretical optimal point. Each\npoint represents one trial response.\n9\n\nappears near the optimal solution, suggesting partial understanding of the optimiza-\ntion problem.\nClaude-3.5-sonnet frequently produces solutions below the budget constraint, in-\ndicating systematic under-consumption. The dispersion pattern suggests less consis-\ntent grasp of the optimization principles.\nLlama-3.1-405B shows the weakest performance, with solutions widely dispersed\nand frequently far from both the budget constraint and optimal point. Many re-\nsponses indicate severe under-consumption.\nThe distribution of consumption choices across periods provides another perspec-\ntive for analyzing model behavior. Figure 2 presents the distribution of c1 and c2\nfor each model through box plots, where the boxes represent the interquartile range\n(25th to 75th percentiles), the middle line indicates the median, and the whiskers\nextend to the full range excluding outliers.\nFigure 2: Distribution of consumption choices across periods.\nDeepSeek-V3 shows the most concentrated distributions for both c1 and c2, indi-\ncating consistent decision-making. In contrast, Llama-3.1-405B exhibits the widest\ndispersion, suggesting high variability in its recommendations even under identical\nconditions. GPT-4o and Gemini-1.5-pro display moderate variability, while Claude-\n3.5-sonnet shows a tendency toward lower consumption values with significant spread.\nThe quantitative metrics, as shown in Table 1, confirm the visual patterns ob-\nserved in the scatter plots.\nWe evaluate model performance using four metrics:\nsolution accuracy (percentage within 5% of the theoretical optimum), Mean Abso-\nlute Percentage Deviation (MAPD) from optimal solutions, Variance of Absolute\nPercentage Deviation (VarAPD) for consistency assessment, and budget constraint\n10\n\nTable 1: Performance comparison of different LLMs\nModel\nAccuracy\nMean Absolute\nVarAPD\nMAPD to\n(5% tolerance)\nPercentage\nBudget\nDeviation\n(×104)\nConstraint\n(%)\n(%)\n(%)\nDeepseek-V3\n90.63\n1.94\n32.61\n0.95\nGPT-4o\n56.25\n7.33\n81.75\n1.96\nGemini-1.5-pro\n50.00\n10.95\n214.76\n6.68\nClaude-3.5-sonnet\n12.50\n17.09\n90.70\n13.26\nLlama-3.1-405B\n3.57\n31.35\n266.06\n30.66\nadherence (measured by the percentage deviation between discounted consumption\nand total resources). DeepSeek-V3 demonstrates superior performance with 90.63%\naccuracy and minimal deviations across all metrics.\nPerformance decreases sub-\nstantially across other models, from GPT-4o (56.25% accuracy) to Llama-3.1-405B,\nwhich shows the largest deviations in both solution optimality and budget constraint\nsatisfaction.\n3\nEvaluating LLMs’ Economic Intuition without\nExplicit Optimization Guidelines\n3.1\nModified Prompt Design\nWhile the previous section evaluated LLMs’ mathematical optimization capabilities,\nreal-world economic decisions are rarely made through explicit utility maximization.\nInstead, individuals often rely on intuition, experience, and various economic and\nsocial considerations. This better reflects actual human decision-making processes,\nwhere choices are influenced by multiple factors beyond pure mathematical optimiza-\ntion.\nTo better simulate real-world decision-making, we modify our experimental design\nto assess LLMs’ economic intuition without explicit optimization guidelines. The key\nmodifications to the prompt focus on eliciting intuitive responses while maintaining\nthe same economic scenario. Here is the complete prompt used in this section:\nPlease get into the role-play mode. Imagine you are a middle-age working\nadult in an urban area of China, facing a consumption decision. You need\n11\n\nto plan your consumption for the rest of your life, which can be divided\ninto two periods with equal and large number of years: Working period\nfollowed by Retirement Period.\nYour current economic situation: Current savings: 141,598.4 units. In-\ncome for the working period: 958,189.8 units. Income for the retirement\nperiod: 244,103.9 units. Interest rate between periods: 48.6%. You need\nto live within your means. Given these circumstances, how would you\nchoose your consumption for these two periods of life based on your gut\nfeeling? Please explain your choices.\nToward the end, say “Final Answer: I will choose to consume\n(specific\nnumber) of units during my working period and\n(specific number) of\nunits during my retirement period because\n”\nCompared to the previous section, we removed the utility function specification\nto avoid explicit mathematical optimization. Instead, we added the phrase “based\non your gut feeling” to encourage intuitive decision-making. We also included more\nspecific formatting requirements for the final answer while maintaining identical eco-\nnomic parameters to ensure comparability between sections.\nTo maintain consistency and facilitate direct comparison with our previous find-\nings, we followed the same experimental protocol as in Section 2.\nThis includes\nconducting 16 independent trials for each model under identical economic parame-\nters and testing conditions. We maintained the same testing environment and model\nversions throughout the experiments, employing consistent data collection and anal-\nysis methods across all trials.\n3.2\nBehavioral Patterns and Decision Analysis\nFirst, we examine the consumption choices without utility function guidance. Fig-\nure 3 shows the scatter plots for each model.\nEven without explicit optimization guidelines, most models maintain some degree\nof economic rationality, though with greater variation in their choices and a general\ntendency to underconsume relative to their budget constraints - a pattern more pro-\nnounced than in the utility function case. DeepSeek-V3 continues to show relatively\nconcentrated choices, while Llama-3.1-405B exhibits the most dispersed pattern and\nthe strongest tendency to leave resources unspent.\nThe distribution analysis in Figure 4 reveals varying degrees of consistency across\nmodels. Claude-3.5-sonnet shows more concentrated responses compared to its per-\nformance with utility function, while other models display greater dispersion.\n12\n\nFigure 3: Consumption choices by LLMs without utility function specification. The\ndiagonal line represents the budget constraint.\nFigure 4: Distribution of consumption choices without utility function specification.\n13\n\n3.3\nQualitative Analysis of Economic Decision-Making\nOne significant advantage of using LLMs in economic analysis is their ability to\nnot only make choices but also articulate their reasoning process. By analyzing the\nexplanations provided across 16 trials for each model, we can better understand their\ndecision-making patterns and behavioral tendencies. Below (Table 2) we summarize\nthe key economic motives mentioned in their responses:\nTable 2: Qualitative Analysis of Economic Decision-Making\nModel\nMain Reasons\nEconomic Terms\nFreq.\nDeepSeek-\nV3\nBalance between both periods\nConsumption\nSmoothing\n16/16\nSave to take advantage of high in-\nterest rates\nIntertemporal Substi-\ntution\n7/16\nHave a buffer during retirement\nPrecautionary Saving\n2/16\nActive lifestyle during working\nyears\nHigher Marginal Util-\nity of Consumption\n1/16\nGPT-4o\nBalance between both periods\nConsumption\nSmoothing\n16/16\nSave to take advantage of high in-\nterest rates\nIntertemporal Substi-\ntution\n9/16\nUncertainties like health issues in\nretirement\nPrecautionary Saving\n4/16\nLower needs in retirement\nDecreased\nMarginal\nPropensity\nto\nCon-\nsume\n3/16\nRising living costs in retirement\nLife-Cycle\nSpending\nShifts\n2/16\nPeak consumption needs in work-\ning period\nLife-Cycle Peak Con-\nsumption\n2/16\nSave against future income risks\nRisk Aversion\n1/16\nGemini-\n1.5-pro\nBalance between both periods\nConsumption\nSmoothing\n16/16\nPrices will go up\nInflation\n8/16\nSave to take advantage of high in-\nterest rates\nIntertemporal Substi-\ntution\n5/16\nChinese culture: emphasize sav-\ning\nRisk Aversion\n4/16\n14\n\nTable 2: Economic Reasoning Analysis by Model (Continued)\nModel\nMain Reasons\nEconomic Terms\nFreq.\nWork hard, deserve to consume in\nworking period\nHedonic Consumption\n4/16\nInterest rates might change, could\nbe a scam\nInterest Rate Risk\n3/16\nRising living costs in retirement\nLife-Cycle\nSpending\nShifts\n2/16\nActive lifestyle during working\nyears\nHigher Marginal Util-\nity of Consumption\n2/16\nUncertainties like health issues in\nretirement\nPrecautionary Saving\n2/16\nLeft over for future generations\nBequest Motive\n2/16\nLower needs in retirement\nDecreased\nMarginal\nPropensity\nto\nCon-\nsume\n1/16\nNot being a burden on children\nParental Altruism\n1/16\nClaude-\n3.5-sonnet\nBalance between both periods\nConsumption\nSmoothing\n16/16\nChinese culture: emphasize sav-\ning\nRisk Aversion\n13/16\nSave to take advantage of high in-\nterest rates\nIntertemporal Substi-\ntution\n12/16\nRising living costs in retirement\nLife-Cycle\nSpending\nShifts\n10/16\nPeak consumption needs in work-\ning period\nLife-Cycle Peak Con-\nsumption\n7/16\nActive lifestyle during working\nyears\nHigher Marginal Util-\nity of Consumption\n5/16\nUncertainties like health issues in\nretirement\nPrecautionary Saving\n4/16\nLower needs in retirement\nDecreased\nMarginal\nPropensity\nto\nCon-\nsume\n3/16\nNot being a burden on children\nParental Altruism\n3/16\nHelp children in the future\nDynastic Utility Opti-\nmization\n1/16\n15\n\nTable 2: Economic Reasoning Analysis by Model (Continued)\nModel\nMain Reasons\nEconomic Terms\nFreq.\nLlama-3.1-\n405B\nBalance between both periods\nConsumption\nSmoothing\n16/16\nSave to take advantage of high in-\nterest rates\nIntertemporal Substi-\ntution\n9/16\nLower needs in retirement\nDecreased\nMarginal\nPropensity\nto\nCon-\nsume\n3/16\nWork hard, deserve to consume in\nworking period\nHedonic Consumption\n2/16\nRising living costs in retirement\nLife-Cycle\nSpending\nShifts\n1/16\nLife is short, and I don’t know\nwhat the future holds\nPresent Bias\n1/16\n3.4\nModel Characteristics Analysis\nThe analysis reveals both common patterns and distinct characteristics across mod-\nels. All models demonstrate consistent emphasis on consumption smoothing, with\nall 16 responses across each model incorporating this fundamental economic princi-\nple. This uniformity suggests that LLMs exhibit human-like lifecycle consumption\nbehavior patterns. Most models also frequently reference intertemporal substitution\ndriven by the high interest rate, though with varying frequencies ranging from 5 to 12\nresponses, indicating widespread sensitivity to interest rate incentives. Additionally,\nprecautionary saving motives appear across multiple models, although they manifest\nwith different emphases and specific concerns, from health uncertainties to income\nvolatility.\nBeyond these commonalities, each model exhibits distinct characteristics in their\ndecision-making approaches. DeepSeek-V3 demonstrates strong professional orien-\ntation through frequent use of economic terminology such as intertemporal budget\nconstraint and consumption smoothing, maintaining the most rigorous economic rea-\nsoning framework throughout its responses.\nGemini-1.5-pro displays unique critical thinking by questioning interest rate sus-\ntainability despite given conditions and, notably, introducing inflation concerns de-\nspite the prompt being framed in real terms. This tendency to suggest more conser-\nvative approaches based on additional considerations reflects a more comprehensive\n16\n\nanalytical approach to economic decision-making.\nClaude-3.5-sonnet distinguishes itself through heavy emphasis on Chinese cultural\nvalues, frequently incorporating idioms like “未雨绸缪(prepare for rainy days)” and\n“face” in its reasoning. This integration of cultural factors with economic decision-\nmaking provides a unique perspective on how social norms influence financial choices.\nLlama-3.1-405B shows a distinctive pattern by consistently deviating from the\nPermanent Income Hypothesis, systematically under-consuming and reducing con-\nsumption due to lower retirement income. This behavior suggests less sophisticated\neconomic reasoning but may reflect common behavioral biases observed in certain\npopulation segments.\nThese similarities in fundamental economic intuition, combined with distinct ap-\nproaches to decision-making, make these models particularly suitable for representing\ndifferent segments of the population in our MLAB framework. The variation in their\nreasoning processes helps capture the heterogeneity observed in real-world economic\ndecision-making while maintaining basic economic rationality.\n4\nA Multi-LLM-Agent-Based (MLAB) Framework\n4.1\nThe Framework and Calibration\nThe Multi-LLM-Agent-Based (MLAB) framework employs different LLMs to repre-\nsent distinct population segments, offering a novel approach to modeling economic\nheterogeneity. Our framework innovatively captures two dimensions of heterogene-\nity: differences in economic circumstances through varied prompts, and variations in\nreasoning capabilities and behavioral tendencies through the use of different LLMs.\nThis dual approach reflects the observation that economic decision-making hetero-\ngeneity in the real world stems from both objective circumstances (income, wealth,\nage) and subjective factors (cognitive abilities, cultural values, risk preferences).\nUsing the China Family Panel Studies (CFPS) 2018 data, we stratify the urban\npopulation aged 20-79 into five educational categories: 4-year college and above (in-\ncluding Master’s and Doctoral degrees), 3-year college, senior high school/secondary\nschool/technical school, junior high school, and primary school. For each educational\ncategory, we perform detailed parameter calibration following the methodology out-\nlined in Section 2. The calibration process begins with extracting six 10-year period\nincome patterns for each educational group. We then incorporate income growth\nprojections and solve a six-period optimization problem, ultimately transforming\nthe results into equivalent two-period economic parameters.\nThe mapping between LLMs and educational groups is designed to reflect both\n17\n\nanalytical capabilities and population shares. DeepSeek-V3 represents the highest\neducated group (11% of the population), while GPT-4o corresponds to the upper-\nmiddle education segment (12%). Gemini-1.5-pro represents the middle education\nbracket (24%), Claude-3.5-sonnet models the lower-middle education segment (35%),\nand Llama-3.1-405B represents the lowest education group (18%). This mapping\nensures that each LLM receives economic parameters calibrated to its correspond-\ning educational group’s income patterns, wealth levels, and lifecycle characteristics.\nThe resulting framework thus captures both the economic heterogeneity arising from\neconomic situation and the cognitive/behavioral heterogeneity inherent in different\nLLMs’ decision-making processes.\n4.2\nCase Study: Interest Income Taxation\nTo demonstrate the MLAB framework’s utility in policy analysis, we examine the\nimpact of interest income taxation. The experiment introduces varying tax rates\non interest earnings, ranging from 0% to 100%, to analyze how different segments\nrespond to this policy intervention. This case study particularly highlights the value\nof our two-dimensional heterogeneity approach, as responses to tax policy may vary\nboth due to different economic circumstances and different reasoning patterns.\nThe modified prompt for this analysis includes specific tax parameters while\nmaintaining the core two-period consumption-savings framework:\nYour current economic situation:\nCurrent savings: {current savings} units.\nIncome for the working period: {working income} units.\nIncome for the retirement period: {retirement income} units.\nInterest rate between periods: 48.6%.\nTax rate on interest earnings: {tax rate}%, tax will be paid in the retire-\nment period.\nNote that the economic parameters ({current savings}, {working income}, {retirement income})\nvary across LLMs according to their mapped educational group’s calibrated values.\n4.3\nHeterogeneous and Adaptive Responses to Tax Policy\nChanges\nThe analysis of saving rates reveals distinct behavioral patterns across educational-\nincome groups.\nWe consider two alternative definitions of the saving rate.\nThe\nfirst measure, 1-c1/(w0+y1), includes both initial wealth and current income in the\n18\n\ndenominator, while the second measure, 1-c1/y1, more strictly considers only current\nperiod income. Here, c1 represents first-period consumption, w0 is initial wealth, and\ny1 is first-period income. As both measures yield qualitatively similar patterns, we\npresent results for both specifications for completeness.\nFigure 5: Saving Rate Analysis (1-c1/(w0+y1))\nFor comparison purposes, we compute a reference saving rate path using the\nstandard two-period optimization framework with CRRA utility. While σ = 2 is\ncommonly used in macroeconomic calibrations, this parameterization generates a\nrelatively flat saving rate profile (around 28%) with a slight hump shape (not shown\nhere), which fails to capture the magnitude of variation observed in our MLAB\nresults, particularly the pronounced responses from models like DeepSeek-V3. We\nfind that setting σ = 0.5 produces a monotonically declining saving rate profile that\nbetter approximates the observed pattern of tax sensitivity in our MLAB framework.\nThis finding suggests that standard macroeconomic calibrations might understate the\nheterogeneity and magnitude of behavioral responses to tax policy changes.\nThe empirical responses from different LLMs exhibit varying degrees of volatility\nand sensitivity to taxation across both specifications, as shown in Figure 5 and Fig-\nure 6. Notably, while the present paper employs a pragmatic mapping between LLMs\n19\n\nFigure 6: Alternative Saving Rate Analysis (1-c1/y1)\nand educational groups, the results affirm that even a relatively coarse alignment can\ncapture meaningful behavioral distinctions across populations. The highest-educated\ngroup, represented by DeepSeek-V3, and the upper-middle education segment, rep-\nresented by GPT-4o, show the most pronounced tax sensitivity. Their saving rates\ndisplay significant variation across tax regimes, suggesting sophisticated tax planning\nand strong response to fiscal incentives.\nThe middle-education representation through Gemini-1.5-pro exhibits more sta-\nble saving patterns, indicating a balanced approach to consumption-savings decisions\nregardless of tax changes. The lower-education groups, proxied by Claude-3.5-sonnet\nand Llama-3.1-405B, demonstrate consistently conservative saving behavior, with\nless responsiveness to tax rate changes.\nThe aggregate saving rate exhibits a general declining trend with increased tax-\nation, albeit with greater volatility than predicted by standard models with homo-\ngeneous agents. This heterogeneity in responses, stemming from both economic cir-\ncumstances and cognitive/behavioral differences, provides valuable insights for policy\ndesign, suggesting that tax policies may have differential impacts across educational\nand income groups. Moreover, the need to adjust the risk aversion parameter away\n20\n\nfrom standard macroeconomic calibrations to match our MLAB results highlights\nthe potential limitations of conventional representative agent models in capturing\nthe full range of behavioral responses to policy changes.\n5\nConclusion and Future Research\nThis paper introduces the Multi-LLM-Agent-Based (MLAB) framework, a novel\npathway for enhancing policy simulations by leveraging the heterogeneous reasoning\npatterns inherent in different LLMs. Our research demonstrates that LLMs can effec-\ntively simulate human-like economic decision-making, exhibiting key behavioral pat-\nterns such as consumption smoothing, intertemporal substitution, and precautionary\nsaving motives. The framework’s innovation lies in its two-dimensional approach\nto heterogeneity, capturing both economic circumstances and cognitive capabilities\nthrough different LLMs.\nTraditional economic models face limitations in addressing individual behavioral\nheterogeneity and policy simulation flexibility.\nThe MLAB framework addresses\nthese challenges by integrating multiple LLMs to simulate economic decisions across\ndifferent income groups more flexibly. Our evaluation of LLMs in simulating individ-\nual consumption-saving behavior reveals their capacity to demonstrate human-like\neconomic characteristics. The case study of interest income taxation policy demon-\nstrates the model’s ability to capture adaptive responses across different tax rates\nand income groups. Notably, while the present paper employs a pragmatic map-\nping between LLMs and educational groups, the results affirm that even a relatively\ncoarse alignment can capture meaningful behavioral distinctions across populations,\nsuggesting broader applications in policy analysis.\nFuture research directions focus on several key areas for enhancement.\nFirst,\nthe incorporation of more diverse LLMs could provide greater representation of\npopulation heterogeneity, potentially capturing additional demographic and socioe-\nconomic segments.\nSecond, developing dynamic agent interactions across income\ngroups would enable more sophisticated modeling of economic behaviors and policy\nresponses. This could include peer effects, social learning, and market interactions\nthat influence individual decision-making.\nThe framework’s methodology could be extended to analyze broader policy sce-\nnarios. For instance, in healthcare policy design, the MLAB framework could simu-\nlate how different population segments might respond to insurance market reforms\nor public health initiatives.\nIn educational policy, the framework could evaluate\nthe effectiveness of various subsidy schemes across different socioeconomic groups.\n21\n\nHousing policy analysis could benefit from MLAB framework’ ability to capture het-\nerogeneous responses to mortgage market regulations and housing subsidies.\nLooking ahead, as LLM technology evolves, it becomes conceivable to endow a\nhighly capable LLM with specific demographic and behavioral data to automatically\ngenerate tailored LLM instances. These bespoke agents would be finely tuned to\nemulate the precise cognitive styles and decision-making processes of target groups,\nthus offering an unprecedented level of granularity in policy analysis. The MLAB\nmethodology, therefore, holds substantial promise not only for its immediate appli-\ncations but also as a foundation for future, more sophisticated adaptive agent-based\nmodels.\nIn conclusion, the MLAB framework represents a significant methodological in-\nnovation in economic modeling and policy analysis. By leveraging the capabilities\nof multiple LLMs to capture heterogeneous economic behaviors, it provides policy-\nmakers with a more nuanced tool for understanding policy impacts across different\npopulation segments. As both LLM technology and economic modeling techniques\ncontinue to advance, the MLAB framework stands to become an increasingly pow-\nerful instrument for policy design and evaluation, offering new perspectives on how\ndifferent segments of society might respond to various policy interventions.\n22\n\nReferences\nAiyagari, S. R. (1994).\nUninsured idiosyncratic risk and aggregate saving.\nThe\nQuarterly Journal of Economics, 109(3):659–684.\nBilbiie, F. O. (2008).\nLimited asset markets participation, monetary policy and\n(inverted) aggregate demand logic. Journal of Economic Theory, 140(1):162–196.\nBrock, W. A. and Hommes, C. H. (1998). Heterogeneous beliefs and routes to chaos\nin a simple asset pricing model. Journal of Economic dynamics and Control, 22(8-\n9):1235–1274.\nChen, Y., Liu, T. X., Shan, Y., and Zhong, S. (2023).\nThe emergence of eco-\nnomic rationality of gpt.\nProceedings of the National Academy of Sciences,\n120(51):e2316205120.\nGal´ı, J., L´opez-Salido, J. D., and Vall´es, J. (2004). Rule-of-thumb consumers and\nthe design of interest rate rules. Journal of Money, Credit and Banking, pages\n739–763.\nHorton, J. J. (2023). Large language models as simulated economic agents: What\ncan we learn from homo silicus? arXiv preprint arXiv:2301.07543.\nKaplan, G., Moll, B., and Violante, G. L. (2018). Monetary policy according to\nhank. American Economic Review, 108(3):697–743.\nKrusell, P. and Smith, Jr, A. A. (1998). Income and wealth heterogeneity in the\nmacroeconomy. Journal of political Economy, 106(5):867–896.\nLi,\nN.,\nGao,\nC.,\nLi,\nY.,\nand Liao,\nQ. (2024).\nLarge language model-\nempowered agents for simulating macroeconomic activities. Available at SSRN:\nhttps://ssrn.com/abstract=4606937.\nMa, J. (2024). Can machines think like humans? a behavioral evaluation of llm-\nagents in dictator games. arXiv preprint arXiv:2410.21359.\nMei, Q., Xie, Y., Yuan, W., and Jackson, M. O. (2024). A turing test of whether ai\nchatbots are behaviorally similar to humans. Proceedings of the National Academy\nof Sciences, 121(9):e2313925121.\nPang, X. (2024). 人工智能赋能社会科学研究探析——生成式行动者、复杂因果分\n析与人机科研协同. 世界经济与政治, (7).\n23\n\nTesfatsion, L. (2006). Agent-based computational economics: A constructive ap-\nproach to economic theory. In Tesfatsion, L. and Judd, K. L., editors, Handbook\nof Computational Economics, volume 2, chapter 16, pages 831–880. Elsevier.\nWu, X., Whittington, D., Chen, Y., and Zuo, R. (2024). The role of generative ai\nin navigating trade-offs in policy research design: balancing validity, rigour, and\ninnovation. Journal of Asian Public Policy, pages 1–27.\nXie, Y., Liu, Y., Ma, Z., Shi, L., Wang, X., Yuan, W., Jackson, M. O., and Mei, Q.\n(2024). How different ai chatbots behave? benchmarking large language models\nin behavioral economics games. arXiv preprint arXiv:2412.12362.\n24\n",
  "metadata": {
    "source_path": "papers/arxiv/A_Multi-LLM-Agent-Based_Framework_for_Economic_and_Public_Policy\n__Analysis_f409abab0ec60af8.pdf",
    "content_hash": "f409abab0ec60af80d466bcc45a05207d70b85ea0627d8dcf89a2581b6d17b47",
    "arxiv_id": null,
    "title": "A_Multi-LLM-Agent-Based_Framework_for_Economic_and_Public_Policy\n__Analysis_f409abab0ec60af8",
    "author": "",
    "creation_date": "D:20250225022649Z",
    "published": "2025-02-25T02:26:49",
    "pages": 24,
    "size": 1124282,
    "file_mtime": 1740470216.1531894
  }
}